[
  {
    "texto1": "Un sustantivo que se refiere a la capacidad, el talento o el poder para hacer algo. Puede ser una habilidad física, mental, o una aptitud adquirida a través del aprendizaje o la práctica. También se usa para describir el potencial para realizar una tarea.",
    "texto2": "Habilidad / Capacidad / Aptitud",
    "texto3": "ability /əˈbɪləti/",
    "texto4": "N/A",
    "texto5": "She has a remarkable ability to learn new languages quickly.",
    "texto6": "Ella tiene una notable habilidad para aprender idiomas nuevos rápidamente."
  },
  {
    "texto1": "Un sustantivo que describe el potencial o el poder que se tiene para hacer algo en particular, o para realizar un acto. A menudo se usa con la preposición 'to' para referirse a la posibilidad de hacer una acción.",
    "texto2": "Capacidad / Potencial",
    "texto3": "ability /əˈbɪləti/",
    "texto4": "N/A",
    "texto5": "The car has the ability to go from 0 to 60 in under 5 seconds.",
    "texto6": "El coche tiene la capacidad de ir de 0 a 60 en menos de 5 segundos."
  },
  {
    "texto1": "Un sustantivo que se refiere a una habilidad o talento específico que una persona posee, a menudo en un contexto profesional o académico. Se usa en plural ('abilities') para referirse a un conjunto de talentos.",
    "texto2": "Talentos / Dones / Habilidades",
    "texto3": "ability /əˈbɪləti/",
    "texto4": "N/A",
    "texto5": "The job requires strong communication abilities and problem-solving skills.",
    "texto6": "El trabajo requiere fuertes habilidades de comunicación y capacidad para resolver problemas."
  },
  {
    "texto1": "Un adjetivo que describe la capacidad o la posibilidad de hacer algo. Se utiliza para indicar que alguien o algo tiene las habilidades, el poder, los medios o la oportunidad para realizar una acción.",
    "texto2": "Capaz / Habilidoso / Poder",
    "texto3": "able /ˈeɪbəl/",
    "texto4": "N/A",
    "texto5": "I am able to lift this heavy box by myself.",
    "texto6": "Soy capaz de levantar esta caja pesada yo solo."
  },
  {
    "texto1": "Un adjetivo que se usa en el contexto de las capacidades mentales o intelectuales, para describir a alguien que es inteligente o que tiene la aptitud para aprender o realizar una tarea intelectual. Se usa a menudo en un contexto escolar o de trabajo.",
    "texto2": "Inteligente / Capaz",
    "texto3": "able /ˈeɪbəl/",
    "texto4": "N/A",
    "texto5": "She is an able student who grasps new concepts quickly.",
    "texto6": "Ella es una estudiante capaz que capta nuevos conceptos rápidamente."
  },
  {
    "texto1": "Un adjetivo que se usa para describir a una persona que es competente y eficiente en su trabajo o en una tarea particular. A menudo se usa para hablar de la experiencia o la habilidad de alguien para hacer algo bien.",
    "texto2": "Competente / Eficiente",
    "texto3": "able /ˈeɪbəl/",
    "texto4": "N/A",
    "texto5": "He is an able manager who leads his team with confidence.",
    "texto6": "Él es un gerente competente que lidera a su equipo con confianza."
  },
  {
    "texto1": "Una preposición que se usa para referirse a un tema o asunto ('acerca de'), para indicar una ubicación cercana ('alrededor de'), o para dar una aproximación de un número o cantidad ('aproximadamente').",
    "texto2": "Acerca de / Sobre / Alrededor de / Aproximadamente",
    "texto3": "about /əˈbaʊt/",
    "texto4": "N/A",
    "texto5": "I want to talk to you about the new project.",
    "texto6": "Quiero hablar contigo acerca del nuevo proyecto."
  },
  {
    "texto1": "Un adverbio que se usa para indicar un movimiento alrededor de un lugar, o para referirse a una ubicación cercana, pero no precisa. También se puede usar para indicar que algo está 'aquí y allá'.",
    "texto2": "Alrededor / Por aquí / Por ahí",
    "texto3": "about /əˈbaʊt/",
    "texto4": "N/A",
    "texto5": "She looked about the room for her keys.",
    "texto6": "Ella miró por la habitación buscando sus llaves."
  },
  {
    "texto1": "Un adverbio que se usa para indicar una cantidad o un tiempo que no es exacto, sino una aproximación. Se usa para dar una estimación de un número o un período de tiempo.",
    "texto2": "Aproximadamente / Cerca de",
    "texto3": "about /əˈbaʊt/",
    "texto4": "N/A",
    "texto5": "The meeting lasted for about two hours.",
    "texto6": "La reunión duró aproximadamente dos horas."
  },
  {
    "texto1": "Un adjetivo que se usa en la frase 'to be about to do something', para indicar que una acción está a punto de suceder en un futuro muy cercano.",
    "texto2": "A punto de",
    "texto3": "about /əˈbaʊt/",
    "texto4": "N/A",
    "texto5": "I was about to leave when the phone rang.",
    "texto6": "Estaba a punto de irme cuando sonó el teléfono."
  },
  {
    "texto1": "Una preposición que se usa para indicar una posición o lugar que es más alto que otro. También se puede usar para referirse a una cantidad que es mayor que un número, a una posición jerárquica superior, o para indicar que algo se mencionó en una parte anterior de un texto.",
    "texto2": "Arriba de / Por encima de / Más que",
    "texto3": "above /əˈbʌv/",
    "texto4": "N/A",
    "texto5": "The airplane is flying high above the clouds.",
    "texto6": "El avión está volando muy por encima de las nubes."
  },
  {
    "texto1": "Un adjetivo que se usa para referirse a algo que está en un nivel o rango superior, o para describir una cualidad que es más importante o significativa que otras. A menudo se usa en un contexto abstracto o figurado.",
    "texto2": "Superior / Por encima",
    "texto3": "above /əˈbʌv/",
    "texto4": "N/A",
    "texto5": "The rules state that the needs of the community are above individual desires.",
    "texto6": "Las reglas establecen que las necesidades de la comunidad están por encima de los deseos individuales."
  },
  {
    "texto1": "Un adverbio que se usa para referirse a algo que se ha mencionado previamente en un documento, un texto o una conversación. Se usa para evitar la repetición y para dirigir la atención del lector a una parte anterior del escrito.",
    "texto2": "Anteriormente / Arriba",
    "texto3": "above /əˈbʌv/",
    "texto4": "N/A",
    "texto5": "Please refer to the chart above for the data.",
    "texto6": "Por favor, consulte la tabla de arriba para ver los datos."
  },
  {
    "texto1": "Una preposición que se usa para describir a una persona, un concepto o un objeto que está más allá del alcance de algo, como una crítica o una ley. A menudo se usa en la frase 'above the law' o 'above reproach'.",
    "texto2": "Por encima de",
    "texto3": "above /əˈbʌv/",
    "texto4": "N/A",
    "texto5": "The king believes he is above the law and can do whatever he wants.",
    "texto6": "El rey cree que está por encima de la ley y puede hacer lo que quiera."
  },
    {
    "texto1": "Un adverbio que se refiere a un país extranjero o a un lugar fuera del propio país. También se puede usar para indicar que algo se ha difundido ampliamente o en un área grande.",
    "texto2": "En el extranjero / Fuera del país",
    "texto3": "abroad /əˈbrɔːd/",
    "texto4": "N/A",
    "texto5": "I want to study abroad next year to learn a new language.",
    "texto6": "Quiero estudiar en el extranjero el próximo año para aprender un nuevo idioma."
  },
  {
    "texto1": "Un adverbio que se refiere a la acción de viajar o moverse fuera de los límites de un espacio o un país en particular, como en la expresión 'to travel abroad'.",
    "texto2": "Afuera / Al extranjero",
    "texto3": "abroad /əˈbrɔːd/",
    "texto4": "N/A",
    "texto5": "He travels abroad for work at least twice a year.",
    "texto6": "Él viaja al extranjero por trabajo al menos dos veces al año."
  },
  {
    "texto1": "Un adverbio usado en un contexto literario o arcaico para referirse a algo que está circulando o que se ha difundido de forma amplia entre la gente, como una noticia o un rumor.",
    "texto2": "Ampliamente / Circulando",
    "texto3": "abroad /əˈbrɔːd/",
    "texto4": "N/A",
    "texto5": "The news of the discovery soon spread abroad.",
    "texto6": "La noticia del descubrimiento pronto se difundió ampliamente."
  },
  {
    "texto1": "Un sustantivo que se refiere al estado de no estar presente en un lugar o situación. También se usa para describir el período de tiempo en que alguien está ausente o la falta de algo necesario o esperado.",
    "texto2": "Ausencia / Falta / Carencia",
    "texto3": "absence /ˈæbsəns/",
    "texto4": "N/A",
    "texto5": "Due to her absence, we had to postpone the meeting.",
    "texto6": "Debido a su ausencia, tuvimos que posponer la reunión."
  },
  {
    "texto1": "Un sustantivo que se usa para referirse a la falta de algo que se necesita o se espera, como la ausencia de pruebas en un caso legal o la falta de lluvia en una región seca.",
    "texto2": "Falta / Carencia",
    "texto3": "absence /ˈæbsəns/",
    "texto4": "N/A",
    "texto5": "The absence of evidence made it difficult to prove the case.",
    "texto6": "La falta de pruebas dificultó la prueba del caso."
  },
  {
    "texto1": "Un sustantivo que se refiere a un período de tiempo en el que alguien no está presente en el trabajo, la escuela o en un evento planificado. A menudo se usa en un contexto más formal o administrativo.",
    "texto2": "Ausencia / Inasistencia",
    "texto3": "absence /ˈæbsəns/",
    "texto4": "N/A",
    "texto5": "He had a high number of absences from class last semester.",
    "texto6": "Él tuvo un alto número de ausencias de clase el semestre pasado."
  },
  {
    "texto1": "Un adverbio que se usa para dar un énfasis fuerte a la afirmación de que algo es cierto, correcto o incondicional. También puede usarse como una respuesta corta para expresar un acuerdo total.",
    "texto2": "Absolutamente / Completamente / Sin duda",
    "texto3": "absolutely /ˌæbsəˈluːtli/",
    "texto4": "N/A",
    "texto5": "Are you sure you want to go? - Absolutely!",
    "texto6": "¿Estás seguro de que quieres ir? - ¡Absolutamente!"
  },
  {
    "texto1": "Un adverbio que describe algo que es totalmente, completamente o sin reservas. Se usa para intensificar el significado de un adjetivo o de un verbo, y a menudo se usa para hablar de una cualidad o un estado.",
    "texto2": "Completamente / Totalmente",
    "texto3": "absolutely /ˌæbsəˈluːtli/",
    "texto4": "N/A",
    "texto5": "I am absolutely certain that I locked the door before I left.",
    "texto6": "Estoy completamente seguro de que cerré la puerta con llave antes de irme."
  },
  {
    "texto1": "Un adverbio que se usa en un contexto de acuerdo o afirmación, para expresar un apoyo total a una idea, opinión o declaración. Es similar a 'ciertamente' o 'por supuesto'.",
    "texto2": "Por supuesto / Ciertamente",
    "texto3": "absolutely /ˌæbsəˈluːtli/",
    "texto4": "N/A",
    "texto5": "Do you think we can win? - Absolutely!",
    "texto6": "¿Crees que podemos ganar? - ¡Por supuesto!"
  },
  {
    "texto1": "Un verbo que describe la acción de tomar o retener algo dentro de una sustancia, como una esponja que absorbe agua. En sentido figurado, se usa para describir el acto de asimilar información, comprender una idea, o ser consumido por completo en una actividad.",
    "texto2": "Absorber / Asimilar / Absorber / Consumir",
    "texto3": "absorb /əbˈsɔːrb/",
    "texto4": "absorbed / will absorb / absorbing",
    "texto5": "The dry soil will absorb all the water from the rain.",
    "texto6": "La tierra seca absorberá toda el agua de la lluvia."
  },
  {
    "texto1": "Un verbo que se usa para referirse al acto de asimilar o comprender información, conocimientos o ideas, como en el contexto de estudiar o leer un libro. Implica un proceso mental de tomar algo y hacerlo propio.",
    "texto2": "Asimilar / Comprender",
    "texto3": "absorb /əbˈsɔːrb/",
    "texto4": "absorbed / will absorb / absorbing",
    "texto5": "It's difficult for me to absorb all this new information in one day.",
    "texto6": "Es difícil para mí asimilar toda esta nueva información en un solo día."
  },
  {
    "texto1": "Un verbo que describe el acto de captar y consumir por completo la atención de alguien en una actividad, haciendo que se concentre y se pierda en ella. A menudo se usa para hablar de un pasatiempo, un libro o una película.",
    "texto2": "Absorber / Consumir",
    "texto3": "absorb /əbˈsɔːrb/",
    "texto4": "absorbed / will absorb / absorbing",
    "texto5": "The exciting story completely absorbed the children.",
    "texto6": "La emocionante historia absorbió por completo a los niños."
  },
  {
    "texto1": "Un verbo que se usa en el contexto de las empresas o las finanzas para describir el acto de tomar y manejar un costo, una pérdida o una deuda. Implica que una entidad se hace cargo de la responsabilidad financiera.",
    "texto2": "Absorber / Asumir",
    "texto3": "absorb /əbˈsɔːrb/",
    "texto4": "absorbed / will absorb / absorbing",
    "texto5": "The company had to absorb the cost of the damaged goods.",
    "texto6": "La empresa tuvo que absorber el costo de los productos dañados."
  },
  {
    "texto1": "Un verbo que describe el uso indebido o excesivo de algo, como una sustancia o un poder. Como sustantivo, se refiere al trato cruel o violento de una persona o animal, o al uso inapropiado de una posición o recurso.",
    "texto2": "Abusar / Maltratar / Abuso / Maltrato",
    "texto3": "abuse /əˈbjuːs/",
    "texto4": "abused / will abuse / abusing",
    "texto5": "He was fired for abusing his position of power at the company.",
    "texto6": "Fue despedido por abusar de su posición de poder en la empresa."
  },
  {
    "texto1": "Un sustantivo que se refiere al trato cruel o violento de una persona o animal. Puede ser físico, emocional o psicológico. A menudo se usa en un contexto de violencia doméstica o maltrato infantil.",
    "texto2": "Maltrato / Violencia / Abuso",
    "texto3": "abuse /əˈbjuːs/",
    "texto4": "N/A",
    "texto5": "The police are investigating a case of child abuse in the neighborhood.",
    "texto6": "La policía está investigando un caso de abuso infantil en el vecindario."
  },
  {
    "texto1": "Un sustantivo que se refiere al uso excesivo o adictivo de una sustancia, como el alcohol o las drogas. Se usa comúnmente en la frase 'drug abuse' o 'substance abuse'.",
    "texto2": "Abuso (de drogas o alcohol)",
    "texto3": "abuse /əˈbjuːs/",
    "texto4": "N/A",
    "texto5": "Substance abuse is a serious problem that requires professional help.",
    "texto6": "El abuso de sustancias es un problema grave que requiere ayuda profesional."
  },
  {
    "texto1": "Un verbo que describe la acción de hablar a alguien de una manera grosera, ofensiva o insultante. Se usa para referirse a un maltrato verbal o a un lenguaje abusivo.",
    "texto2": "Insultar / Ofender / Maltratar (verbalmente)",
    "texto3": "abuse /əˈbjuːs/",
    "texto4": "abused / will abuse / abusing",
    "texto5": "He abused the referee with a lot of foul language after the game.",
    "texto6": "Él insultó al árbitro con mucho lenguaje soez después del partido."
  },
  {
    "texto1": "Un verbo que describe la acción de aumentar la velocidad de un vehículo u otro objeto en movimiento. También se usa en sentido figurado para describir el aumento de la velocidad o la intensidad de un proceso o un evento.",
    "texto2": "Acelerar / Aumentar la velocidad / Impulsar",
    "texto3": "accelerate /ækˈseləreɪt/",
    "texto4": "accelerated / will accelerate / accelerating",
    "texto5": "The car accelerated quickly as it entered the highway.",
    "texto6": "El coche aceleró rápidamente al entrar en la autopista."
  },
  {
    "texto1": "Un verbo que se usa para describir el aumento de la velocidad o la tasa de un proceso o evento, como el crecimiento de una economía, la propagación de un rumor o el desarrollo de una enfermedad.",
    "texto2": "Acelerar / Impulsar",
    "texto3": "accelerate /ækˈseləreɪt/",
    "texto4": "accelerated / will accelerate / accelerating",
    "texto5": "The new policies are designed to accelerate economic growth.",
    "texto6": "Las nuevas políticas están diseñadas para acelerar el crecimiento económico."
  },
  {
    "texto1": "Un verbo que describe el acto de hacer que algo suceda más rápido o a un ritmo más rápido de lo normal. A menudo se usa en un contexto más técnico o científico.",
    "texto2": "Acelerar / Apresurar",
    "texto3": "accelerate /ækˈseləreɪt/",
    "texto4": "accelerated / will accelerate / accelerating",
    "texto5": "The scientists used a catalyst to accelerate the chemical reaction.",
    "texto6": "Los científicos usaron un catalizador para acelerar la reacción química."
  },
  {
    "texto1": "Un sustantivo que se refiere a la forma distintiva en que una persona habla, lo que a menudo revela su país, región o clase social. Es el conjunto de sonidos, entonación y ritmo que caracterizan el habla de un grupo de personas. También puede referirse a un signo ortográfico que se añade a una letra.",
    "texto2": "Acento / Deje / Entonación",
    "texto3": "accent /ˈæksent/",
    "texto4": "N/A",
    "texto5": "She has a beautiful French accent when she speaks English.",
    "texto6": "Ella tiene un hermoso acento francés cuando habla inglés."
  },
  {
    "texto1": "Un sustantivo que se refiere a un signo ortográfico que se añade a una letra para indicar que su pronunciación es diferente, como en las palabras 'résumé' o 'café'.",
    "texto2": "Acento / Tilde",
    "texto3": "accent /ˈæksent/",
    "texto4": "N/A",
    "texto5": "In Spanish, the word 'teléfono' has an accent on the 'e'.",
    "texto6": "En español, la palabra 'teléfono' tiene un acento en la 'e'."
  },
  {
    "texto1": "Un sustantivo que se refiere a un énfasis o un estrés que se pone en una sílaba o una palabra al hablar. Es la fuerza o la prominencia que se le da a una parte del discurso, lo que hace que se escuche más fuerte que el resto.",
    "texto2": "Acento / Énfasis / Estrés",
    "texto3": "accent /ˈæksent/",
    "texto4": "N/A",
    "texto5": "The accent in the word 'beautiful' is on the first syllable.",
    "texto6": "El acento en la palabra 'beautiful' está en la primera sílaba."
  },
  {
    "texto1": "Un verbo que describe la acción de dar un énfasis particular a algo, ya sea en el habla o en un contexto figurado, como en el diseño o el arte. Se usa para destacar o enfatizar una parte de una composición.",
    "texto2": "Acentuar / Destacar / Enfatizar",
    "texto3": "accent /ˈæksent/",
    "texto4": "accented / will accent / accenting",
    "texto5": "She accented her outfit with a beautiful red scarf.",
    "texto6": "Ella acentuó su atuendo con una hermosa bufanda roja."
  },
  {
    "texto1": "Un verbo que describe la acción de recibir o tomar algo que se ofrece, como un regalo o una propuesta. También se usa para estar de acuerdo con una idea, reconocer la verdad de una situación, o admitir a alguien en un grupo o institución.",
    "texto2": "Aceptar / Recibir / Admitir",
    "texto3": "accept /əkˈsept/",
    "texto4": "accepted / will accept / accepting",
    "texto5": "I will accept the job offer because it's a great opportunity.",
    "texto6": "Aceptaré la oferta de trabajo porque es una gran oportunidad."
  },
  {
    "texto1": "Un verbo que describe el acto de estar de acuerdo con una idea, un plan o una opinión, sin necesariamente recibir algo físico. Implica una aprobación mental o verbal de algo que se ha propuesto.",
    "texto2": "Aceptar / Aprobar",
    "texto3": "accept /əkˈsept/",
    "texto4": "accepted / will accept / accepting",
    "texto5": "We all accepted the new rules without any discussion.",
    "texto6": "Todos aceptamos las nuevas reglas sin ninguna discusión."
  },
  {
    "texto1": "Un verbo que se usa para referirse al acto de reconocer una situación o un hecho como verdadero o válido, incluso si es desagradable. Implica un proceso de asimilación emocional o mental.",
    "texto2": "Aceptar / Asumir",
    "texto3": "accept /əkˈsept/",
    "texto4": "accepted / will accept / accepting",
    "texto5": "You need to accept that you made a mistake and move on.",
    "texto6": "Tienes que aceptar que cometiste un error y seguir adelante."
  },
  {
    "texto1": "Un verbo que describe el acto de permitir que alguien entre en un grupo, una escuela, un hospital o cualquier otra institución. Se usa para referirse a la admisión de una persona en una organización.",
    "texto2": "Admitir / Aceptar",
    "texto3": "accept /əkˈsept/",
    "texto4": "accepted / will accept / accepting",
    "texto5": "She was accepted into the university's engineering program.",
    "texto6": "Ella fue aceptada en el programa de ingeniería de la universidad."
  },
  {
    "texto1": "Un sustantivo que se refiere al derecho o la oportunidad de usar o entrar a un lugar o de usar algo. Como verbo, significa obtener la entrada o usar algo, como una computadora o una base de datos.",
    "texto2": "Acceso / Entrada / Acceder",
    "texto3": "access /ˈækses/",
    "texto4": "N/A",
    "texto5": "You need a password to get access to the computer files.",
    "texto6": "Necesitas una contraseña para tener acceso a los archivos de la computadora."
  },
  {
    "texto1": "Un verbo que describe el acto de obtener la entrada o la oportunidad de usar algo, como un sistema informático, un sitio web o una red. Se utiliza a menudo en un contexto de tecnología o seguridad.",
    "texto2": "Acceder / Conectarse",
    "texto3": "access /ˈækses/",
    "texto4": "accessed / will access / accessing",
    "texto5": "I can't access my email because the internet is not working.",
    "texto6": "No puedo acceder a mi correo electrónico porque el internet no funciona."
  },
  {
    "texto1": "Un sustantivo que se refiere a la forma física de entrar a un lugar, como una rampa, un camino o una puerta. Se usa para describir la entrada a un edificio, un parque o un área restringida.",
    "texto2": "Entrada / Vía de acceso",
    "texto3": "access /ˈækses/",
    "texto4": "N/A",
    "texto5": "The only access to the beach is through a small, winding path.",
    "texto6": "La única vía de acceso a la playa es a través de un pequeño y sinuoso sendero."
  },
  {
    "texto1": "Un verbo que describe la acción de obtener información de una base de datos, un archivo o una fuente de datos. Se usa en el contexto de la informática y la gestión de datos.",
    "texto2": "Acceder / Consultar / Recuperar",
    "texto3": "access /ˈækses/",
    "texto4": "accessed / will access / accessing",
    "texto5": "The program will access the database to retrieve the customer information.",
    "texto6": "El programa accederá a la base de datos para recuperar la información del cliente."
  },
  {
    "texto1": "Un adjetivo que describe algo que es fácil de alcanzar, entrar, usar o entender. Se aplica tanto a lugares físicos (con rampas para sillas de ruedas, por ejemplo) como a ideas o información que son sencillas de comprender para la mayoría de las personas.",
    "texto2": "Accesible / Asequible / Alcanzable",
    "texto3": "accessible /əkˈsesəbəl/",
    "texto4": "N/A",
    "texto5": "The building has a ramp, making it accessible to people in wheelchairs.",
    "texto6": "El edificio tiene una rampa, lo que lo hace accesible para personas en sillas de ruedas."
  },
  {
    "texto1": "Un adjetivo que se refiere a una persona o a un lugar que es fácil de contactar o visitar. Implica que no hay barreras, ya sean físicas o sociales, para poder llegar a alguien o a un sitio.",
    "texto2": "Accesible / Abierto / Asequible",
    "texto3": "accessible /əkˈsesəbəl/",
    "texto4": "N/A",
    "texto5": "The CEO has an accessible personality and is always willing to talk to employees.",
    "texto6": "El director ejecutivo tiene una personalidad accesible y siempre está dispuesto a hablar con los empleados."
  },
  {
    "texto1": "Un adjetivo que describe un precio o un costo que es razonable y que está al alcance de la mayoría de las personas. Se usa para hablar de productos, servicios o oportunidades que no son demasiado caros.",
    "texto2": "Asequible / Económico",
    "texto3": "accessible /əkˈsesəbəl/",
    "texto4": "N/A",
    "texto5": "The new public transport system is accessible to everyone in the city.",
    "texto6": "El nuevo sistema de transporte público es asequible para todos en la ciudad."
  },
  {
    "texto1": "Un adjetivo que se refiere a un lugar, como una base de datos o un documento, que es fácil de encontrar y consultar. Se usa en el contexto de la información y la tecnología para describir algo que no está oculto o protegido por contraseña.",
    "texto2": "Disponible / Accesible",
    "texto3": "accessible /əkˈsesəbəl/",
    "texto4": "N/A",
    "texto5": "The important documents are accessible from the company's main server.",
    "texto6": "Los documentos importantes son accesibles desde el servidor principal de la empresa."
  }
]
