[
  {
    "texto1": "Hacer que el aire se mueva, expulsándolo de la boca o con el viento.",
    "texto2": "Soplar / Echar",
    "texto3": "blow /bloʊ/",
    "texto4": "blew / will blow",
    "texto5": "Can you please blow out the candles on the cake?",
    "texto6": "¿Puedes soplar las velas del pastel, por favor?"
  },
  {
    "texto1": "Ser arrastrado o destruido por la fuerza del viento o una explosión.",
    "texto2": "Volar / Explotar",
    "texto3": "blow /bloʊ/",
    "texto4": "blew / will blow",
    "texto5": "The strong wind might blow the roof off our house.",
    "texto6": "El viento fuerte podría volar el techo de nuestra casa."
  },
  {
    "texto1": "Perder o usar algo (oportunidad, dinero) de forma descuidada.",
    "texto2": "Malgastar / Desaprovechar",
    "texto3": "blow /bloʊ/",
    "texto4": "blew / will blow",
    "texto5": "I can't believe I blew my chance to get that job.",
    "texto6": "No puedo creer que desaproveché mi oportunidad de conseguir ese trabajo."
  },
  {
    "texto1": "Producir sonido en un instrumento de viento.",
    "texto2": "Sonar / Tocar",
    "texto3": "blow /bloʊ/",
    "texto4": "blew / will blow",
    "texto5": "He likes to blow his trumpet loudly in the morning.",
    "texto6": "A él le gusta tocar su trompeta ruidosamente por la mañana."
  },
  {
    "texto1": "Dejar a alguien muy impresionado o asombrado (expresión idiomática).",
    "texto2": "Asombrar / Impresionar mucho",
    "texto3": "blow away /bloʊ əˈweɪ/",
    "texto4": "blew away / will blow away",
    "texto5": "The concert really blew me away; it was incredible.",
    "texto6": "El concierto realmente me impresionó; fue increíble."
  },
  {
    "texto1": "Un gesto o acción para comunicar algo sin palabras.",
    "texto2": "Seña / Gesto",
    "texto3": "sign /saɪn/",
    "texto4": "signs / will be a sign",
    "texto5": "He made a sign with his hand to tell me to wait.",
    "texto6": "Él hizo una seña con la mano para decirme que esperara."
  },
  {
    "texto1": "Un cartel o letrero que da información o advertencia.",
    "texto2": "Señal / Letrero",
    "texto3": "sign /saɪn/",
    "texto4": "signs / will be a sign",
    "texto5": "The stop sign was clearly visible at the intersection.",
    "texto6": "La señal de alto era claramente visible en la intersección."
  },
  {
    "texto1": "Indicio o evidencia de que algo existe o sucederá.",
    "texto2": "Señal / Indicio",
    "texto3": "sign /saɪn/",
    "texto4": "signs / will be a sign",
    "texto5": "There are no signs of life in the abandoned house.",
    "texto6": "No hay señales de vida en la casa abandonada."
  },
  {
    "texto1": "Firmar un documento, escribir tu nombre para indicar aprobación o acuerdo.",
    "texto2": "Firmar",
    "texto3": "sign /saɪn/",
    "texto4": "signed / will sign",
    "texto5": "Please sign your name at the bottom of the form to confirm.",
    "texto6": "Por favor, firme con su nombre en la parte inferior del formulario para confirmar."
  },
  {
    "texto1": "Contratar a alguien oficialmente (especialmente en deportes o música).",
    "texto2": "Fichar / Contratar",
    "texto3": "sign /saɪn/",
    "texto4": "signed / will sign",
    "texto5": "The team hopes to sign a new player before the next season.",
    "texto6": "El equipo espera fichar a un nuevo jugador antes de la próxima temporada."
  },
  {
    "texto1": "Presionar o meter algo a la fuerza en un espacio reducido, haciendo que se atasque.",
    "texto2": "Atascar / Encajar a la fuerza",
    "texto3": "jam /dʒæm/",
    "texto4": "jammed / will jam",
    "texto5": "The printer kept jamming because of the crumpled paper.",
    "texto6": "La impresora seguía atascándose por el papel arrugado."
  },
  {
    "texto1": "Una situación en la que muchas personas o vehículos están muy apretados y no pueden moverse.",
    "texto2": "Atasco / Embottellamiento",
    "texto3": "jam /dʒæm/",
    "texto4": "jams / will be a jam",
    "texto5": "We were stuck in a huge traffic jam for an hour.",
    "texto6": "Estuvimos atrapados en un atasco de tráfico enorme durante una hora."
  },
  {
    "texto1": "Un tipo de conserva de fruta cocida con azúcar, usada para untar pan.",
    "texto2": "Mermelada / Jalea",
    "texto3": "jam /dʒæm/",
    "texto4": "jams / will be a jam",
    "texto5": "I like to eat toast with strawberry jam for breakfast.",
    "texto6": "Me gusta comer tostadas con mermelada de fresa para el desayuno."
  },
  {
    "texto1": "Tocar música de forma improvisada con otros músicos, por diversión.",
    "texto2": "Improvisar música / Tocar un 'jam session'",
    "texto3": "jam /dʒæm/",
    "texto4": "jammed / will jam",
    "texto5": "Let's jam together in the garage tonight and make some music!",
    "texto6": "¡Vamos a improvisar música juntos en el garaje esta noche y a hacer algo de música!"
  },
  {
    "texto1": "Bloquear o interferir una señal de radio, teléfono, etc.",
    "texto2": "Interferir / Bloquear (señal)",
    "texto3": "jam /dʒæm/",
    "texto4": "jammed / will jam",
    "texto5": "The enemy tried to jam our radio communications to stop us.",
    "texto6": "El enemigo intentó bloquear nuestras comunicaciones por radio para detenernos."
  },
  {
    "texto1": "Pedir algo de forma muy humilde, desesperada o suplicante.",
    "texto2": "Suplicar / Rogar",
    "texto3": "beg /bɛɡ/",
    "texto4": "begged / will beg",
    "texto5": "He begged for forgiveness after making a big mistake.",
    "texto6": "Él suplicó por perdón después de cometer un gran error."
  },
  {
    "texto1": "Pedir comida o dinero en la calle, generalmente por necesidad.",
    "texto2": "Mendigar / Pedir limosna",
    "texto3": "beg /bɛɡ/",
    "texto4": "begged / will beg",
    "texto5": "Many homeless people are forced to beg for food and money on the streets.",
    "texto6": "Muchas personas sin hogar se ven obligadas a mendigar comida y dinero en las calles."
  },
  {
    "texto1": "Pedir permiso para hacer algo, a menudo con insistencia.",
    "texto2": "Pedir (permiso, por favor)",
    "texto3": "beg /bɛɡ/",
    "texto4": "begged / will beg",
    "texto5": "I begged my parents to let me go to the concert with my friends.",
    "texto6": "Les rogué a mis padres que me dejaran ir al concierto con mis amigos."
  },
  {
    "texto1": "Evadir una pregunta o asunto, especialmente en la frase 'beg the question'.",
    "texto2": "Eludir la pregunta / Plantear la cuestión (idiomático)",
    "texto3": "beg /bɛɡ/",
    "texto4": "begged / will beg",
    "texto5": "His answer seemed to beg the question of his true intentions.",
    "texto6": "Su respuesta pareció eludir la cuestión de sus verdaderas intenciones."
  },
  {
    "texto1": "Solicitar (formal y educadamente) un favor o asistencia, como en 'I beg to differ'.",
    "texto2": "Permitirse (formal) / Discrepar (cortésmente)",
    "texto3": "beg /bɛɡ/",
    "texto4": "begged / will beg",
    "texto5": "I beg to differ with your opinion on this matter, although I respect it.",
    "texto6": "Me permito discrepar de su opinión sobre este asunto, aunque la respeto."
  },
  {
    "texto1": "La parte frontal de la cabeza de una persona o animal.",
    "texto2": "Cara / Rostro",
    "texto3": "face /feɪs/",
    "texto4": "faces / will be a face",
    "texto5": "She has a friendly face and a warm smile.",
    "texto6": "Ella tiene una cara amigable y una sonrisa cálida."
  },
  {
    "texto1": "La superficie frontal de un objeto o estructura.",
    "texto2": "Cara / Superficie",
    "texto3": "face /feɪs/",
    "texto4": "faces / will be a face",
    "texto5": "The clock's face shows the time and also has some decorations.",
    "texto6": "La cara del reloj muestra la hora y también tiene algunas decoraciones."
  },
  {
    "texto1": "Enfrentar o afrontar una situación difícil, un problema o un peligro.",
    "texto2": "Enfrentar / Afrontar",
    "texto3": "face /feɪs/",
    "texto4": "faced / will face",
    "texto5": "We need to face our problems directly instead of avoiding them.",
    "texto6": "Necesitamos enfrentar nuestros problemas directamente en lugar de evitarlos."
  },
  {
    "texto1": "Estar orientado hacia una dirección particular o un lugar.",
    "texto2": "Dar a / Mirar hacia",
    "texto3": "face /feɪs/",
    "texto4": "faced / will face",
    "texto5": "The house faces the east, so it gets a lot of morning sun.",
    "texto6": "La casa da al este, por lo que recibe mucho sol por la mañana."
  },
  {
    "texto1": "Lidiar con una situación o persona desafiante de manera directa.",
    "texto2": "Hacer frente a / Plantar cara a",
    "texto3": "face /feɪs/",
    "texto4": "faced / will face",
    "texto5": "You have to face the consequences of your actions, whether they are good or bad.",
    "texto6": "Tienes que hacer frente a las consecuencias de tus acciones, ya sean buenas o malas."
  },
  {
    "texto1": "Moverse alrededor de un punto central o cambiar de dirección.",
    "texto2": "Girar / Voltear",
    "texto3": "turn /tɜːrn/",
    "texto4": "turned / will turn",
    "texto5": "Please turn right at the next intersection to get to the store.",
    "texto6": "Por favor, gira a la derecha en la próxima intersección para llegar a la tienda."
  },
  {
    "texto1": "Cambiar de estado, condición o color.",
    "texto2": "Volverse / Convertirse en",
    "texto3": "turn /tɜːrn/",
    "texto4": "turned / will turn",
    "texto5": "The leaves turn yellow and red in autumn.",
    "texto6": "Las hojas se vuelven amarillas y rojas en otoño."
  },
  {
    "texto1": "Activar un aparato o luz (phrasal verb).",
    "texto2": "Encender",
    "texto3": "turn on /tɜːrn ɒn/",
    "texto4": "turned on / will turn on",
    "texto5": "Could you turn on the radio? I want to listen to some music.",
    "texto6": "¿Podrías encender la radio? Quiero escuchar música."
  },
  {
    "texto1": "Desactivar un aparato o luz (phrasal verb).",
    "texto2": "Apagar",
    "texto3": "turn off /tɜːrn ɒf/",
    "texto4": "turned off / will turn off",
    "texto5": "Don't forget to turn off the lights before you leave.",
    "texto6": "No olvides apagar las luces antes de irte."
  },
  {
    "texto1": "Pasar una página o una esquina.",
    "texto2": "Pasar / Doblar",
    "texto3": "turn /tɜːrn/",
    "texto4": "turned / will turn",
    "texto5": "Please turn to page 50 in your book and start reading.",
    "texto6": "Por favor, pasa a la página 50 de tu libro y empieza a leer."
  },
  {
    "texto1": "Devolver o entregar algo a alguien.",
    "texto2": "Entregar / Devolver",
    "texto3": "turn in /tɜːrn ɪn/",
    "texto4": "turned in / will turn in",
    "texto5": "You must turn in your homework by Friday at the latest.",
    "texto6": "Debes entregar tu tarea a más tardar el viernes."
  },
  {
    "texto1": "Cumplir una edad específica.",
    "texto2": "Cumplir (años)",
    "texto3": "turn /tɜːrn/",
    "texto4": "turned / will turn",
    "texto5": "My brother will turn 30 next month, so we are planning a party.",
    "texto6": "Mi hermano cumplirá 30 el próximo mes, así que estamos planeando una fiesta."
  },
  {
    "texto1": "Cambiar a un estado, forma, condición o cualidad diferente.",
    "texto2": "Volverse / Convertirse en / Transformarse en",
    "texto3": "turn into /tɜːrn ˈɪntu/",
    "texto4": "turned into / will turn into",
    "texto5": "The caterpillar will turn into a beautiful butterfly soon.",
    "texto6": "La oruga se convertirá en una hermosa mariposa pronto."
  },
  {
    "texto1": "Una porción delgada y plana cortada de algo más grande (sustantivo).",
    "texto2": "Rebanada / Loncha",
    "texto3": "slice /slaɪs/",
    "texto4": "slices / will be a slice",
    "texto5": "Can I have a slice of pizza for dinner tonight?",
    "texto6": "¿Puedo tomar una rebanada de pizza para la cena de esta noche?"
  },
  {
    "texto1": "Cortar algo en porciones delgadas y planas (verbo).",
    "texto2": "Rebanar / Cortar en lonchas",
    "texto3": "slice /slaɪs/",
    "texto4": "sliced / will slice",
    "texto5": "He used a sharp knife to slice the bread into thin pieces.",
    "texto6": "Él usó un cuchillo afilado para rebanar el pan en rodajas finas."
  },
  {
    "texto1": "Una porción o parte de algo, especialmente de una gran cantidad (sustantivo).",
    "texto2": "Parte / Porción",
    "texto3": "slice /slaɪs/",
    "texto4": "slices / will be a slice",
    "texto5": "Everyone wants a slice of the pie, but few want to bake it.",
    "texto6": "Todos quieren una porción del pastel, pero pocos quieren hornearlo."
  },
  {
    "texto1": "Un golpe que hace que una pelota o un objeto se desvíe hacia un lado, especialmente en deportes como el golf o el tenis (sustantivo/verbo).",
    "texto2": "Efecto / Golpe con efecto (golf/tenis)",
    "texto3": "slice /slaɪs/",
    "texto4": "slices / will slice",
    "texto5": "His golf ball took a bad slice to the right and went into the water.",
    "texto6": "Su pelota de golf tomó un mal efecto hacia la derecha y se fue al agua."
  },
  {
    "texto1": "Agarrar, coger o mover algo de un lugar a otro.",
    "texto2": "Coger / Tomar",
    "texto3": "take /teɪk/",
    "texto4": "took / will take",
    "texto5": "Please take your books with you when you leave the classroom.",
    "texto6": "Por favor, coge tus libros contigo cuando salgas del aula."
  },
  {
    "texto1": "Llevar a alguien o algo de un lugar a otro.",
    "texto2": "Llevar / Conducir",
    "texto3": "take /teɪk/",
    "texto4": "took / will take",
    "texto5": "I will take you to the airport tomorrow morning.",
    "texto6": "Te llevaré al aeropuerto mañana por la mañana."
  },
  {
    "texto1": "Aceptar o recibir algo (un regalo, una oferta, una responsabilidad).",
    "texto2": "Aceptar / Recibir",
    "texto3": "take /teɪk/",
    "texto4": "took / will take",
    "texto5": "I will take the job offer because it's a great opportunity.",
    "texto6": "Aceptaré la oferta de trabajo porque es una gran oportunidad."
  },
  {
    "texto1": "Necesitar o requerir una cantidad de tiempo, esfuerzo, etc.",
    "texto2": "Llevar (tiempo) / Requerir",
    "texto3": "take /teɪk/",
    "texto4": "took / will take",
    "texto5": "It will take about two hours to get there by car.",
    "texto6": "Llevará unas dos horas llegar allí en coche."
  },
  {
    "texto1": "Quitar algo de su lugar o de alguien.",
    "texto2": "Quitar / Sacar",
    "texto3": "take /teɪk/",
    "texto4": "took / will take",
    "texto5": "Did you take my keys from the table this morning?",
    "texto6": "¿Cogiste mis llaves de la mesa esta mañana?"
  },
  {
    "texto1": "Consumir algo (comida, bebida, medicina).",
    "texto2": "Tomar (medicina, comida)",
    "texto3": "take /teɪk/",
    "texto4": "took / will take",
    "texto5": "Remember to take your medicine twice a day, after breakfast and dinner.",
    "texto6": "Recuerda tomar tu medicamento dos veces al día, después del desayuno y la cena."
  },
  {
    "texto1": "Soportar o tolerar algo, generalmente algo desagradable.",
    "texto2": "Soportar / Aguantar",
    "texto3": "take /teɪk/",
    "texto4": "took / will take",
    "texto5": "I can't take this loud noise anymore; my head hurts.",
    "texto6": "Ya no puedo soportar este ruido tan fuerte; me duele la cabeza."
  },
  {
    "texto1": "Entender o interpretar algo de cierta manera.",
    "texto2": "Interpretar / Entender",
    "texto3": "take /teɪk/",
    "texto4": "took / will take",
    "texto5": "How do you take his comment about the project?",
    "texto6": "¿Cómo interpretas su comentario sobre el proyecto?"
  },
  {
    "texto1": "Utilizar un medio de transporte.",
    "texto2": "Tomar (transporte)",
    "texto3": "take /teɪk/",
    "texto4": "took / will take",
    "texto5": "I usually take the bus to work to avoid traffic.",
    "texto6": "Normalmente tomo el autobús para ir al trabajo para evitar el tráfico."
  },
  {
    "texto1": "Poner o colocar algo en un lugar o posición específica.",
    "texto2": "Poner / Colocar",
    "texto3": "set /sɛt/",
    "texto4": "set / will set",
    "texto5": "Please set the table for dinner before the guests arrive.",
    "texto6": "Por favor, pon la mesa para la cena antes de que lleguen los invitados."
  },
  {
    "texto1": "Establecer una fecha, hora, límite o récord.",
    "texto2": "Establecer / Fijar",
    "texto3": "set /sɛt/",
    "texto4": "set / will set",
    "texto5": "They set a new date for the meeting, so we will meet next week.",
    "texto6": "Fijaron una nueva fecha para la reunión, así que nos veremos la próxima semana."
  },
  {
    "texto1": "Ajustar un aparato (reloj, alarma) para que funcione de cierta manera.",
    "texto2": "Ajustar / Programar",
    "texto3": "set /sɛt/",
    "texto4": "set / will set",
    "texto5": "I set my alarm for 6 AM so I don't oversleep.",
    "texto6": "Ajusté mi alarma para las 6 de la mañana para no quedarme dormido."
  },
  {
    "texto1": "Hacer que algo comience o iniciar algo (ej. una tendencia, un ejemplo).",
    "texto2": "Iniciar / Comenzar / Marcar",
    "texto3": "set /sɛt/",
    "texto4": "set / will set",
    "texto5": "The company aims to set a new trend in technology with this new product.",
    "texto6": "La empresa aspira a marcar una nueva tendencia en tecnología con este nuevo producto."
  },
  {
    "texto1": "El sol o la luna bajan y desaparecen del cielo.",
    "texto2": "Ponerse (el sol)",
    "texto3": "set /sɛt/",
    "texto4": "set / will set",
    "texto5": "The sun sets in the west, creating a beautiful orange sky.",
    "texto6": "El sol se pone por el oeste, creando un hermoso cielo anaranjado."
  },
  {
    "texto1": "Determinar o decidir algo, establecer reglas o normas.",
    "texto2": "Determinar / Decidir",
    "texto3": "set /sɛt/",
    "texto4": "set / will set",
    "texto5": "The teacher will set the rules for the class at the beginning of the year.",
    "texto6": "El profesor determinará las reglas para la clase al comienzo del año."
  },
  {
    "texto1": "Preparar o disponer algo para un propósito específico.",
    "texto2": "Preparar / Disponer",
    "texto3": "set /sɛt/",
    "texto4": "set / will set",
    "texto5": "He set the trap to catch the mouse that was in the kitchen.",
    "texto6": "Él preparó la trampa para atrapar al ratón que estaba en la cocina."
  },
  {
    "texto1": "Hacer que algo se solidifique o endurezca (ej. gelatina, cemento).",
    "texto2": "Cuajar / Endurecerse",
    "texto3": "set /sɛt/",
    "texto4": "set / will set",
    "texto5": "The jelly will set in a few hours in the refrigerator.",
    "texto6": "La gelatina cuajará en unas pocas horas en el refrigerador."
  },
  {
    "texto1": "No estar bajo control o restricción; poder moverse o actuar sin impedimentos.",
    "texto2": "Libre",
    "texto3": "free /friː/",
    "texto4": "freer / will be free",
    "texto5": "The bird is free to fly wherever it wants to go.",
    "texto6": "El pájaro es libre de volar a donde quiera ir."
  },
  {
    "texto1": "No tener que pagar por algo; sin costo.",
    "texto2": "Gratis / Gratuito",
    "texto3": "free /friː/",
    "texto4": "freer / will be free",
    "texto5": "Admission to the museum is free on Sundays for everyone.",
    "texto6": "La entrada al museo es gratis los domingos para todo el mundo."
  },
  {
    "texto1": "No estar ocupado o disponible para hacer algo; tener tiempo libre.",
    "texto2": "Libre / Desocupado",
    "texto3": "free /friː/",
    "texto4": "freer / will be free",
    "texto5": "Are you free this afternoon for a coffee or a walk?",
    "texto6": "¿Estás libre esta tarde para tomar un café o dar un paseo?"
  },
  {
    "texto1": "Liberar a alguien o algo de una prisión, restricción o dificultad.",
    "texto2": "Liberar / Soltar",
    "texto3": "free /friː/",
    "texto4": "freed / will free",
    "texto5": "They managed to free the trapped animal from the net.",
    "texto6": "Consiguieron liberar al animal atrapado de la red."
  },
  {
    "texto1": "No contener o carecer de algo (ej. libre de gluten, sin azúcar).",
    "texto2": "Libre de / Exento de",
    "texto3": "free /friː/",
    "texto4": "freer / will be free",
    "texto5": "This product is free from artificial colors and preservatives.",
    "texto6": "Este producto está libre de colorantes y conservantes artificiales."
  },
  {
    "texto1": "Cuando algo es dado sin costo; como en 'buy one, get one free'.",
    "texto2": "De regalo / De obsequio",
    "texto3": "free /friː/",
    "texto4": "freer / will be free",
    "texto5": "Buy one pizza and get another one free with this coupon.",
    "texto6": "¡Compra una pizza y llévate otra gratis con este cupón!"
  }
]
