[
  {
    "texto1": "Hacer que el aire se mueva, expulsándolo de la boca o con el viento.",
    "texto2": "Soplar / Echar",
    "texto3": "blow",
    "texto4": "Can you blow out the candles?"
  },
  {
    "texto1": "Ser arrastrado o destruido por la fuerza del viento o una explosión.",
    "texto2": "Volar / Explotar",
    "texto3": "blow",
    "texto4": "The strong wind might blow the roof off."
  },
  {
    "texto1": "Perder o usar algo (oportunidad, dinero) de forma descuidada.",
    "texto2": "Malgastar / Desaprovechar",
    "texto3": "blow",
    "texto4": "I can't believe I blew my chance to get that job."
  },
  {
    "texto1": "Producir sonido en un instrumento de viento.",
    "texto2": "Sonar / Tocar",
    "texto3": "blow",
    "texto4": "He likes to blow his trumpet loudly."
  },
  {
    "texto1": "Dejar a alguien muy impresionado o asombrado (expresión idiomática).",
    "texto2": "Asombrar / Impresionar mucho",
    "texto3": "blow",
    "texto4": "The concert really blew me away."
  },
  {
    "texto1": "Un gesto o acción para comunicar algo sin palabras.",
    "texto2": "Seña / Gesto",
    "texto3": "sign",
    "texto4": "He made a sign to tell me to wait."
  },
  {
    "texto1": "Un cartel o letrero que da información o advertencia.",
    "texto2": "Señal / Letrero",
    "texto3": "sign",
    "texto4": "The stop sign was clearly visible."
  },
  {
    "texto1": "Indicio o evidencia de que algo existe o sucederá.",
    "texto2": "Señal / Indicio",
    "texto3": "sign",
    "texto4": "There are no signs of life in the abandoned house."
  },
  {
    "texto1": "Firmar un documento, escribir tu nombre para indicar aprobación o acuerdo.",
    "texto2": "Firmar",
    "texto3": "sign",
    "texto4": "Please sign your name at the bottom of the form."
  },
  {
    "texto1": "Contratar a alguien oficialmente (especialmente en deportes o música).",
    "texto2": "Fichar / Contratar",
    "texto3": "sign",
    "texto4": "The team hopes to sign a new player next season."
  },
  {
    "texto1": "Presionar o meter algo a la fuerza en un espacio reducido, haciendo que se atasque.",
    "texto2": "Atascar / Encajar a la fuerza",
    "texto3": "jam",
    "texto4": "The printer kept jamming because of the crumpled paper."
  },
  {
    "texto1": "Una situación en la que muchas personas o vehículos están muy apretados y no pueden moverse.",
    "texto2": "Atasco / Embottellamiento",
    "texto3": "jam",
    "texto4": "We were stuck in a huge traffic jam for an hour."
  },
  {
    "texto1": "Un tipo de conserva de fruta cocida con azúcar, usada para untar pan.",
    "texto2": "Mermelada / Jalea",
    "texto3": "jam",
    "texto4": "I like to eat toast with strawberry jam for breakfast."
  },
  {
    "texto1": "Tocar música de forma improvisada con otros músicos, por diversión.",
    "texto2": "Improvisar música / Tocar un 'jam session'",
    "texto3": "jam",
    "texto4": "Let's **jam** together in the garage tonight!"
  },
  {
    "texto1": "Bloquear o interferir una señal de radio, teléfono, etc.",
    "texto2": "Interferir / Bloquear (señal)",
    "texto3": "jam",
    "texto4": "The enemy tried to **jam** our radio communications."
  },
  {
    "texto1": "Pedir algo de forma muy humilde, desesperada o suplicante.",
    "texto2": "Suplicar / Rogar",
    "texto3": "beg",
    "texto4": "He begged for forgiveness after making a mistake."
  },
  {
    "texto1": "Pedir comida o dinero en la calle, generalmente por necesidad.",
    "texto2": "Mendigar / Pedir limosna",
    "texto3": "beg",
    "texto4": "Many homeless people are forced to beg on the streets."
  },
  {
    "texto1": "Pedir permiso para hacer algo, a menudo con insistencia.",
    "texto2": "Pedir (permiso, por favor)",
    "texto3": "beg",
    "texto4": "I begged my parents to let me go to the concert."
  },
  {
    "texto1": "Evadir una pregunta o asunto, especialmente en la frase 'beg the question'.",
    "texto2": "Eludir la pregunta / Plantear la cuestión (idiomático)",
    "texto3": "beg",
    "texto4": "His answer seemed to beg the question of his true intentions."
  },
  {
    "texto1": "Solicitar (formal y educadamente) un favor o asistencia, como en 'I beg to differ'.",
    "texto2": "Permitirse (formal) / Discrepar (cortésmente)",
    "texto3": "beg",
    "texto4": "I beg to differ with your opinion on this matter."
  },
  {
    "texto1": "Obtener algo de alguien con la intención de devolverlo.",
    "texto2": "Pedir prestado / Tomar prestado",
    "texto3": "borrow",
    "texto4": "Can I borrow your pen for a moment?"
  },
  {
    "texto1": "Adoptar una idea, palabra o estilo de otra fuente o cultura.",
    "texto2": "Tomar prestado (idea, palabra) / Adoptar",
    "texto3": "borrow",
    "texto4": "Many English words are borrowed from Latin."
  },
  {
    "texto1": "Usar dinero de un banco u otra entidad con la obligación de devolverlo con intereses.",
    "texto2": "Pedir un préstamo / Endeudarse",
    "texto3": "borrow",
    "texto4": "We had to borrow a lot of money to buy the house."
  },
  {
    "texto1": "Tomar algo de un lugar específico, como un libro de una biblioteca.",
    "texto2": "Sacar (de una biblioteca) / Pedir prestado",
    "texto3": "borrow",
    "texto4": "You can borrow up to five books from the library at a time."
  },
  {
    "texto1": "La parte frontal de la cabeza de una persona o animal.",
    "texto2": "Cara / Rostro",
    "texto3": "face",
    "texto4": "She has a friendly face."
  },
  {
    "texto1": "La superficie frontal de un objeto o estructura.",
    "texto2": "Cara / Superficie",
    "texto3": "face",
    "texto4": "The clock's face shows the time clearly."
  },
  {
    "texto1": "Enfrentar o afrontar una situación difícil, un problema o un peligro.",
    "texto2": "Enfrentar / Afrontar",
    "texto3": "face",
    "texto4": "We need to face our problems directly."
  },
  {
    "texto1": "Estar orientado hacia una dirección particular o un lugar.",
    "texto2": "Dar a / Mirar hacia",
    "texto3": "face",
    "texto4": "The house faces the east, so it gets morning sun."
  },
  {
    "texto1": "Lidiar con una situación o persona desafiante de manera directa.",
    "texto2": "Hacer frente a / Plantar cara a",
    "texto3": "face",
    "texto4": "You have to face the consequences of your actions."
  },
  {
    "texto1": "Moverse alrededor de un punto central o cambiar de dirección.",
    "texto2": "Girar / Voltear",
    "texto3": "turn",
    "texto4": "Please turn right at the next intersection."
  },
  {
    "texto1": "Cambiar de estado, condición o color.",
    "texto2": "Volverse / Convertirse en",
    "texto3": "turn",
    "texto4": "The leaves turn yellow in autumn."
  },
  {
    "texto1": "Activar un aparato o luz (phrasal verb).",
    "texto2": "Encender",
    "texto3": "turn on",
    "texto4": "Could you **turn on** the radio? (¿Podrías encender la radio?)"
  },
  {
    "texto1": "Desactivar un aparato o luz (phrasal verb).",
    "texto2": "Apagar",
    "texto3": "turn off",
    "texto4": "Don't forget to **turn off** the lights before you leave. (No olvides apagar las luces antes de irte.)"
  },
  {
    "texto1": "Pasar una página o una esquina.",
    "texto2": "Pasar / Doblar",
    "texto3": "turn",
    "texto4": "Please turn to page 50 in your book."
  },
  {
    "texto1": "Devolver o entregar algo a alguien.",
    "texto2": "Entregar / Devolver",
    "texto3": "turn",
    "texto4": "You must turn in your homework by Friday."
  },
  {
    "texto1": "Cumplir una edad específica.",
    "texto2": "Cumplir (años)",
    "texto3": "turn",
    "texto4": "My brother will turn 30 next month."
  },
  {
    "texto1": "Cambiar a un estado, forma, condición o cualidad diferente.",
    "texto2": "Volverse / Convertirse en / Transformarse en",
    "texto3": "turn",
    "texto4": "The frog will turn into a prince. (La rana se convertirá en un príncipe.)"
  },
  {
    "texto1": "Una porción delgada y plana cortada de algo más grande (sustantivo).",
    "texto2": "Rebanada / Loncha",
    "texto3": "slice",
    "texto4": "Can I have a slice of pizza?"
  },
  {
    "texto1": "Cortar algo en porciones delgadas y planas (verbo).",
    "texto2": "Rebanar / Cortar en lonchas",
    "texto3": "slice",
    "texto4": "He used a sharp knife to slice the bread."
  },
  {
    "texto1": "Una porción o parte de algo, especialmente de una gran cantidad (sustantivo).",
    "texto2": "Parte / Porción",
    "texto3": "slice",
    "texto4": "Everyone wants a slice of the pie, but few want to bake it."
  },
  {
    "texto1": "Un golpe que hace que una pelota o un objeto se desvíe hacia un lado, especialmente en deportes como el golf o el tenis (sustantivo/verbo).",
    "texto2": "Efecto / Golpe con efecto (golf/tenis)",
    "texto3": "slice",
    "texto4": "His golf ball took a bad slice to the right."
  },
  {
    "texto1": "Agarrar, coger o mover algo de un lugar a otro.",
    "texto2": "Coger / Tomar",
    "texto3": "take",
    "texto4": "Please take your books with you when you leave. (Por favor, coge tus libros cuando te vayas.)"
  },
  {
    "texto1": "Llevar a alguien o algo de un lugar a otro.",
    "texto2": "Llevar / Conducir",
    "texto3": "take",
    "texto4": "I will take you to the airport tomorrow. (Te llevaré al aeropuerto mañana.)"
  },
  {
    "texto1": "Aceptar o recibir algo (un regalo, una oferta, una responsabilidad).",
    "texto2": "Aceptar / Recibir",
    "texto3": "take",
    "texto4": "I will take the job offer. (Aceptaré la oferta de trabajo.)"
  },
  {
    "texto1": "Necesitar o requerir una cantidad de tiempo, esfuerzo, etc.",
    "texto2": "Llevar (tiempo) / Requerir",
    "texto3": "take",
    "texto4": "It will take about two hours to get there. (Tomará unas dos horas llegar allí.)"
  },
  {
    "texto1": "Quitar algo de su lugar o de alguien.",
    "texto2": "Quitar / Sacar",
    "texto3": "take",
    "texto4": "Did you take my keys from the table? (¿Cogiste mis llaves de la mesa?)"
  },
  {
    "texto1": "Consumir algo (comida, bebida, medicina).",
    "texto2": "Tomar (medicina, comida)",
    "texto3": "take",
    "texto4": "Remember to take your medicine twice a day. (Recuerda tomar tu medicamento dos veces al día.)"
  },
  {
    "texto1": "Soportar o tolerar algo, generalmente algo desagradable.",
    "texto2": "Soportar / Aguantar",
    "texto3": "take",
    "texto4": "I can't take this noise anymore. (No puedo soportar más este ruido.)"
  },
  {
    "texto1": "Entender o interpretar algo de cierta manera.",
    "texto2": "Interpretar / Entender",
    "texto3": "take",
    "texto4": "How do you take his comment? (¿Cómo interpretas su comentario?)"
  },
  {
    "texto1": "Utilizar un medio de transporte.",
    "texto2": "Tomar (transporte)",
    "texto3": "take",
    "texto4": "I usually take the bus to work. (Normalmente tomo el autobús para ir al trabajo.)"
  },
  {
    "texto1": "Poner o colocar algo en un lugar o posición específica.",
    "texto2": "Poner / Colocar",
    "texto3": "set",
    "texto4": "Please set the table for dinner. (Por favor, pon la mesa para la cena.)"
  },
  {
    "texto1": "Establecer una fecha, hora, límite o récord.",
    "texto2": "Establecer / Fijar",
    "texto3": "set",
    "texto4": "They set a new date for the meeting. (Fijaron una nueva fecha para la reunión.)"
  },
  {
    "texto1": "Ajustar un aparato (reloj, alarma) para que funcione de cierta manera.",
    "texto2": "Ajustar / Programar",
    "texto3": "set",
    "texto4": "I set my alarm for 6 AM. (Ajusté mi alarma para las 6 AM.)"
  },
  {
    "texto1": "Hacer que algo comience o iniciar algo (ej. una tendencia, un ejemplo).",
    "texto2": "Iniciar / Comenzar / Marcar",
    "texto3": "set",
    "texto4": "The company aims to set a new trend in technology. (La empresa aspira a marcar una nueva tendencia en tecnología.)"
  },
  {
    "texto1": "El sol o la luna bajan y desaparecen del cielo.",
    "texto2": "Ponerse (el sol)",
    "texto3": "set",
    "texto4": "The sun sets in the west. (El sol se pone por el oeste.)"
  },
  {
    "texto1": "Determinar o decidir algo, establecer reglas o normas.",
    "texto2": "Determinar / Decidir",
    "texto3": "set",
    "texto4": "The teacher will set the rules for the class. (El profesor determinará las reglas para la clase.)"
  },
  {
    "texto1": "Preparar o disponer algo para un propósito específico.",
    "texto2": "Preparar / Disponer",
    "texto3": "set",
    "texto4": "He set the trap to catch the mouse. (Preparó la trampa para atrapar al ratón.)"
  },
  {
    "texto1": "Hacer que algo se solidifique o endurezca (ej. gelatina, cemento).",
    "texto2": "Cuajar / Endurecerse",
    "texto3": "set",
    "texto4": "The jelly will set in a few hours. (La gelatina cuajará en unas pocas horas.)"
  },
  {
    "texto1": "No estar bajo control o restricción; poder moverse o actuar sin impedimentos.",
    "texto2": "Libre",
    "texto3": "free",
    "texto4": "The bird is free to fly wherever it wants. (El pájaro es libre de volar donde quiera.)"
  },
  {
    "texto1": "No tener que pagar por algo; sin costo.",
    "texto2": "Gratis / Gratuito",
    "texto3": "free",
    "texto4": "Admission to the museum is free on Sundays. (La entrada al museo es gratis los domingos.)"
  },
  {
    "texto1": "No estar ocupado o disponible para hacer algo; tener tiempo libre.",
    "texto2": "Libre / Desocupado",
    "texto3": "free",
    "texto4": "Are you free this afternoon for a coffee? (¿Estás libre esta tarde para un café?)"
  },
  {
    "texto1": "Liberar a alguien o algo de una prisión, restricción o dificultad.",
    "texto2": "Liberar / Soltar",
    "texto3": "free",
    "texto4": "They managed to free the trapped animal. (Consiguieron liberar al animal atrapado.)"
  },
  {
    "texto1": "No contener o carecer de algo (ej. libre de gluten, sin azúcar).",
    "texto2": "Libre de / Exento de",
    "texto3": "free",
    "texto4": "This product is free from artificial colors. (Este producto está libre de colorantes artificiales.)"
  },
  {
    "texto1": "Cuando algo es dado sin costo; como en 'buy one, get one free'.",
    "texto2": "De regalo / De obsequio",
    "texto3": "free",
    "texto4": "Buy one pizza and get another one free! (¡Compra una pizza y llévate otra gratis!)"
  },
{
    "texto1": "Estar o colocar algo suspendido desde arriba sin tocar el suelo o una superficie.",
    "texto2": "Colgar / Pender",
    "texto3": "hang",
    "texto4": "Please hang your coat on the hook. (Por favor, cuelga tu abrigo en el gancho.)"
  },
  {
    "texto1": "Suspender a una persona por el cuello como forma de ejecución (histórico).",
    "texto2": "Ahorcar",
    "texto3": "hang",
    "texto4": "In the past, criminals were sometimes condemned to hang for their crimes. (En el pasado, los criminales a veces eran condenados a ahorcar por sus crímenes.)"
  },
  {
    "texto1": "Mantenerse en el aire o permanecer suspendido (ej. humo, niebla).",
    "texto2": "Flotar / Quedarse (en el aire)",
    "texto3": "hang",
    "texto4": "A thick mist began to hang over the valley. (Una densa niebla comenzó a quedarse sobre el valle.)"
  },
  {
    "texto1": "Decorar o cubrir paredes con cuadros, tapices, etc.",
    "texto2": "Colgar (cuadros) / Tapizar",
    "texto3": "hang",
    "texto4": "They decided to hang new curtains in the living room. (Decidieron colgar cortinas nuevas en la sala.)"
  },
  {
    "texto1": "Cuando una prenda de vestir cae o se ajusta de cierta manera.",
    "texto2": "Caer / Ajustar (prenda)",
    "texto3": "hang",
    "texto4": "The dress doesn't hang well on me. (El vestido no me sienta bien.)"
  },
  {
    "texto1": "Reparar o arreglar algo que está roto o dañado.",
    "texto2": "Reparar / Arreglar",
    "texto3": "fix",
    "texto4": "Can you fix my broken bicycle? (¿Puedes reparar mi bicicleta rota?)"
  },
  {
    "texto1": "Preparar comida o bebida.",
    "texto2": "Preparar (comida)",
    "texto3": "fix",
    "texto4": "I need to fix some breakfast before I leave. (Necesito preparar el desayuno antes de irme.)"
  },
  {
    "texto1": "Establecer o determinar algo de forma permanente o segura.",
    "texto2": "Fijar / Establecer",
    "texto3": "fix",
    "texto4": "Let's fix a date for our next meeting. (Fijemos una fecha para nuestra próxima reunión.)"
  },
  {
    "texto1": "Dirigir la mirada o la atención de forma constante a algo o alguien.",
    "texto2": "Fijar (la mirada)",
    "texto3": "fix",
    "texto4": "She fixed her eyes on the distant horizon. (Ella fijó su mirada en el horizonte distante.)"
  },
  {
    "texto1": "Una dosis de una droga adictiva (sustantivo, informal).",
    "texto2": "Dosis / Dosis de droga",
    "texto3": "fix",
    "texto4": "He was desperate for his daily fix. (Estaba desesperado por su dosis diaria.)"
  },
  {
    "texto1": "Pronunciar el nombre de alguien o algo para atraer su atención o indicar su presencia.",
    "texto2": "Llamar / Nombrar",
    "texto3": "call",
    "texto4": "Could you call my name when it's my turn? (¿Podrías decir mi nombre cuando sea mi turno?)"
  },
  {
    "texto1": "Intentar comunicarse con alguien por teléfono.",
    "texto2": "Llamar por teléfono",
    "texto3": "call",
    "texto4": "I need to call my mom after work. (Necesito llamar a mi mamá después del trabajo.)"
  },
  {
    "texto1": "Designar o referirse a algo o alguien con un nombre particular.",
    "texto2": "Llamar / Denominar",
    "texto3": "call",
    "texto4": "They call him 'the professor' because he knows so much. (Lo llaman 'el profesor' porque sabe mucho.)"
  },
  {
    "texto1": "Visitar brevemente un lugar o a alguien.",
    "texto2": "Visitar (brevemente)",
    "texto3": "call",
    "texto4": "I'll call on you later this evening. (Te visitaré más tarde esta noche.)"
  },
  {
    "texto1": "Considerar o describir algo de una manera particular.",
    "texto2": "Considerar / Describir",
    "texto3": "call",
    "texto4": "It's difficult to call that a victory. (Es difícil considerar eso una victoria.)"
  },
  {
    "texto1": "Solicitar la presencia de alguien o pedirle que venga.",
    "texto2": "Convocar / Llamar (a alguien)",
    "texto3": "call",
    "texto4": "The manager decided to call a meeting. (El gerente decidió convocar una reunión.)"
  },
  {
    "texto1": "Una breve visita (sustantivo).",
    "texto2": "Visita (corta)",
    "texto3": "call",
    "texto4": "I paid a quick call to my aunt. (Le hice una visita rápida a mi tía.)"
  },
  {
    "texto1": "Un ruido o sonido que se usa para llamar la atención (sustantivo).",
    "texto2": "Llamada / Grito",
    "texto3": "call",
    "texto4": "We heard the call of a bird in the forest. (Escuchamos el grito de un pájaro en el bosque.)"
  },
  {
    "texto1": "Permitir que algo sea visto; presentar o hacer visible.",
    "texto2": "Mostrar / Enseñar",
    "texto3": "show",
    "texto4": "Can you show me how to use this new app? (¿Puedes enseñarme cómo usar esta nueva aplicación?)"
  },
  {
    "texto1": "Exhibir algo en público, como una obra de arte o un producto.",
    "texto2": "Exhibir / Exponer",
    "texto3": "show",
    "texto4": "The gallery will show her latest paintings next month. (La galería exhibirá sus últimas pinturas el próximo mes.)"
  },
  {
    "texto1": "Demostrar una cualidad, habilidad o sentimiento.",
    "texto2": "Demostrar / Revelar",
    "texto3": "show",
    "texto4": "Her actions show great courage. (Sus acciones demuestran gran valor.)"
  },
  {
    "texto1": "Indicar o señalar algo con un gesto o dirección.",
    "texto2": "Indicar / Señalar",
    "texto3": "show",
    "texto4": "The map will show you the way to the station. (El mapa te indicará el camino a la estación.)"
  },
  {
    "texto1": "Un espectáculo, una obra de teatro, una película o un programa de televisión (sustantivo).",
    "texto2": "Espectáculo / Programa",
    "texto3": "show",
    "texto4": "We went to see a fantastic magic show last night. (Fuimos a ver un fantástico espectáculo de magia anoche.)"
  },
  {
    "texto1": "Una feria o exhibición donde se presentan productos o animales (sustantivo).",
    "texto2": "Feria / Exhibición",
    "texto3": "show",
    "texto4": "Are you going to the car show this weekend? (¿Vas a la exhibición de autos este fin de semana?)"
  },
  {
    "texto1": "Separado o a distancia; no juntos en el espacio o el tiempo.",
    "texto2": "Separado / Aparte",
    "texto3": "apart",
    "texto4": "The two houses are quite far apart. (Las dos casas están bastante separadas.)"
  },
  {
    "texto1": "En pedazos o desintegrado; roto en partes.",
    "texto2": "En pedazos / Desarmado",
    "texto3": "apart",
    "texto4": "The old machine fell apart when he tried to move it. (La vieja máquina se desarmó cuando intentó moverla.)"
  },
  {
    "texto1": "Excepto o con la excepción de (generalmente en la frase 'apart from').",
    "texto2": "Aparte de / Excepto",
    "texto3": "apart",
    "texto4": "Everything went well, apart from a small delay. (Todo salió bien, aparte de un pequeño retraso.)"
  },
  {
    "texto1": "De manera individual o distinta; con distinción de los demás.",
    "texto2": "Individualmente / Distintamente",
    "texto3": "apart",
    "texto4": "He stands apart from the others because of his talent. (Se distingue de los demás por su talento.)"
  },
  {
    "texto1": "Desglosar o analizar algo en sus componentes individuales (ej. 'pull apart', 'take apart').",
    "texto2": "Desglosar / Desarmar",
    "texto3": "apart",
    "texto4": "We need to take this engine apart to find the problem. (Necesitamos desarmar este motor para encontrar el problema.)"
  },
  {
    "texto1": "Atribuir la responsabilidad de un error o algo negativo a alguien o algo.",
    "texto2": "Culpar / Echar la culpa",
    "texto3": "blame",
    "texto4": "Don't blame me for your mistakes. (No me culpes por tus errores.)"
  },
  {
    "texto1": "La responsabilidad de un error o de algo malo (sustantivo).",
    "texto2": "Culpa / Responsabilidad",
    "texto3": "blame",
    "texto4": "The manager took all the blame for the failed project. (El gerente asumió toda la culpa por el proyecto fallido.)"
  },
  {
    "texto1": "Sentir o expresar que algo o alguien tiene la culpa (generalmente en 'be to blame').",
    "texto2": "Tener la culpa / Ser culpable",
    "texto3": "blame",
    "texto4": "He was to blame for the accident. (Él tuvo la culpa del accidente.)"
  },
  {
    "texto1": "Reprochar o censurar a alguien por algo (menos común que 'culpar').",
    "texto2": "Reprochar / Censurar",
    "texto3": "blame",
    "texto4": "You can't blame him for trying. (No puedes reprocharle que lo intentara.)"
  },
  {
    "texto1": "Dirigir los ojos hacia algo o alguien para ver.",
    "texto2": "Mirar / Ver",
    "texto3": "look",
    "texto4": "Please look at me when I'm talking to you. (Por favor, mírame cuando te estoy hablando.)"
  },
  {
    "texto1": "Parecer o tener una apariencia determinada.",
    "texto2": "Parecer / Verse",
    "texto3": "look",
    "texto4": "You look tired today. (Hoy pareces cansado.)"
  },
  {
    "texto1": "Buscar algo o a alguien.",
    "texto2": "Buscar",
    "texto3": "look",
    "texto4": "I need to look for my lost keys. (Necesito buscar mis llaves perdidas.)"
  },
  {
    "texto1": "Una mirada o una expresión visual (sustantivo).",
    "texto2": "Mirada / Aspecto",
    "texto3": "look",
    "texto4": "She gave me a strange look. (Me dio una mirada extraña.)"
  },
  {
    "texto1": "Investigar o examinar algo cuidadosamente.",
    "texto2": "Investigar / Examinar",
    "texto3": "look",
    "texto4": "The police will look into the matter. (La policía investigará el asunto.)"
  },
  {
    "texto1": "Volver los ojos en una dirección específica.",
    "texto2": "Mirar hacia",
    "texto3": "look",
    "texto4": "He looked out the window at the snow. (Miró por la ventana la nieve.)"
  },
  {
    "texto1": "Tomar o coger algo rápidamente o con fuerza.",
    "texto2": "Agarrar / Coger",
    "texto3": "grab",
    "texto4": "He tried to grab the falling vase. (Él intentó agarrar el jarrón que se caía.)"
  },
  {
    "texto1": "Aprovechar una oportunidad rápidamente.",
    "texto2": "Aprovechar / Agarrar (oportunidad)",
    "texto3": "grab",
    "texto4": "You should grab this chance while you can. (Deberías aprovechar esta oportunidad mientras puedas.)"
  },
  {
    "texto1": "Comer o beber algo rápidamente.",
    "texto2": "Comer/Beber (rápidamente)",
    "texto3": "grab",
    "texto4": "Let's grab a quick bite before the movie. (Vamos a comer algo rápido antes de la película.)"
  },
  {
    "texto1": "Obtener la atención de alguien rápidamente.",
    "texto2": "Captar (atención)",
    "texto3": "grab",
    "texto4": "The headline immediately grabbed my attention. (El titular captó inmediatamente mi atención.)"
  },
  {
    "texto1": "Tomar posesión de algo, a menudo de forma ilícita o agresiva.",
    "texto2": "Arrebatar / Aferrarse a",
    "texto3": "grab",
    "texto4": "The thief grabbed her purse and ran away. (El ladrón le arrebató el bolso y salió corriendo.)"
  },
    {
    "texto1": "Romper o fracturar algo sin que se separe completamente.",
    "texto2": "Rajar / Agrietar",
    "texto3": "crack",
    "texto4": "The glass window started to crack from the cold. (La ventana de vidrio comenzó a agrietarse por el frío.)"
  },
  {
    "texto1": "Hacer un sonido seco y fuerte al romperse o golpearse.",
    "texto2": "Crujir / Estallar",
    "texto3": "crack",
    "texto4": "I heard a loud crack as the branch fell. (Oí un crujido fuerte cuando cayó la rama.)"
  },
  {
    "texto1": "Abrir algo con un sonido abrupto (ej. un huevo, una nuez).",
    "texto2": "Romper (un huevo, una nuez)",
    "texto3": "crack",
    "texto4": "Please crack the eggs into the bowl. (Por favor, rompe los huevos en el tazón.)"
  },
  {
    "texto1": "Una línea estrecha donde algo se ha roto o agrietado (sustantivo).",
    "texto2": "Grieta / Raja",
    "texto3": "crack",
    "texto4": "There's a crack in the wall. (Hay una grieta en la pared.)"
  },
  {
    "texto1": "Una abertura estrecha o rendija.",
    "texto2": "Rendija / Hendidura",
    "texto3": "crack",
    "texto4": "Light shone through the crack in the door. (La luz brillaba a través de la rendija de la puerta.)"
  },
  {
    "texto1": "Intentar o resolver un problema o un código (coloquial).",
    "texto2": "Resolver / Descifrar (coloquial)",
    "texto3": "crack",
    "texto4": "We need to crack this problem before the deadline. (Necesitamos resolver este problema antes de la fecha límite.)"
  },
  {
    "texto1": "Cumplimiento",
    "texto2": "Realización",
    "texto3": "fulfillment",
    "texto4": "She found great fulfillment in her career"
  },
  {
    "texto1": "Movimiento o forma elegante y fluida.",
    "texto2": "Gracia / Elegancia",
    "texto3": "grace",
    "texto4": "The ballet dancer moved with incredible grace. (La bailarina de ballet se movía con una gracia increíble.)"
  },
  {
    "texto1": "Cortesía, amabilidad o buena voluntad.",
    "texto2": "Gracia / Cortesía",
    "texto3": "grace",
    "texto4": "He accepted the defeat with grace. (Aceptó la derrota con cortesía.)"
  },
  {
    "texto1": "Un período de tiempo adicional otorgado para cumplir una obligación.",
    "texto2": "Plazo de gracia",
    "texto3": "grace",
    "texto4": "You have a 30-day grace period to pay the bill. (Tienes un plazo de gracia de 30 días para pagar la factura.)"
  },
  {
    "texto1": "Una cualidad de belleza o atractivo que se muestra en la forma o el movimiento.",
    "texto2": "Gracia / Encanto",
    "texto3": "grace",
    "texto4": "Her natural grace captivated everyone. (Su gracia natural cautivó a todos.)"
  },
  {
    "texto1": "Añadir elegancia o adorno a algo.",
    "texto2": "Adornar / Engalanar (verbo)",
    "texto3": "grace",
    "texto4": "Her presence will grace the event. (Su presencia engalanará el evento.)"
  },
  {
    "texto1": "Mostrar buenas maneras, cortesía y respeto hacia los demás.",
    "texto2": "Educado / Cortés",
    "texto3": "polite",
    "texto4": "It's important to be polite when you talk to strangers. (Es importante ser educado cuando hablas con extraños.)"
  },
  {
    "texto1": "Actuar de una manera respetuosa y con buenos modales.",
    "texto2": "Amable / Atento",
    "texto3": "polite",
    "texto4": "She gave a polite nod as she walked past. (Ella dio un asentimiento amable al pasar.)"
  },
  {
    "texto1": "Expresar algo de forma indirecta o suave para no ofender.",
    "texto2": "Discreto / Suave (al expresar)",
    "texto3": "polite",
    "texto4": "He made a polite suggestion, rather than a direct order. (Hizo una sugerencia discreta, en lugar de una orden directa.)"
  },
  {
    "texto1": "Refiriéndose a la sociedad o el comportamiento social que se considera refinado o civilizado.",
    "texto2": "Refinado / Civilizado",
    "texto3": "polite",
    "texto4": "In polite society, it's customary to offer guests a drink. (En la sociedad civilizada, es costumbre ofrecer una bebida a los invitados.)"
  },
  {
    "texto1": "Animar",
    "texto2": "Fomentar",
    "texto3": "encourage",
    "texto4": "Her friends encouraged her to apply for the job"
  },
  {
    "texto1": "Considerar algo probable que suceda o que alguien llegue.",
    "texto2": "Esperar / Contar con",
    "texto3": "expect",
    "texto4": "I expect her to arrive any minute now. (Espero que ella llegue en cualquier momento.)"
  },
  {
    "texto1": "Creer que algo es verdad o que es lo normal o lo que se debe hacer.",
    "texto2": "Esperar / Suponer",
    "texto3": "expect",
    "texto4": "I expect you'll want to rest after your long journey. (Supongo que querrás descansar después de tu largo viaje.)"
  },
  {
    "texto1": "Requerir o demandar algo de alguien porque se considera su deber o derecho.",
    "texto2": "Exigir / Requerir",
    "texto3": "expect",
    "texto4": "They expect high standards from their employees. (Ellos exigen altos estándares de sus empleados.)"
  },
  {
    "texto1": "Anticipar el nacimiento de un bebé.",
    "texto2": "Esperar (un bebé)",
    "texto3": "expect",
    "texto4": "My sister is expecting her first child in October. (Mi hermana está esperando a su primer hijo en octubre.)"
  },
  {
    "texto1": "La capacidad de ver; el sentido de la vista.",
    "texto2": "Vista",
    "texto3": "sight",
    "texto4": "His sight is not as good as it used to be. (Su vista no es tan buena como solía ser.)"
  },
  {
    "texto1": "Algo que se ve o se puede ver; una vista o un espectáculo.",
    "texto2": "Vista / Espectáculo",
    "texto3": "sight",
    "texto4": "The Grand Canyon is an amazing sight. (El Gran Cañón es un espectáculo asombroso.)"
  },
  {
    "texto1": "Un lugar o edificio que es popular para visitar; una atracción turística.",
    "texto2": "Sitio turístico / Atracción",
    "texto3": "sight",
    "texto4": "We visited all the famous sights in Paris. (Visitamos todos los sitios turísticos famosos de París.)"
  },
  {
    "texto1": "El acto de ver o percibir algo.",
    "texto2": "Avistamiento / Percepción",
    "texto3": "sight",
    "texto4": "The first sight of land brought cheers from the sailors. (El primer avistamiento de tierra provocó vítores entre los marineros.)"
  },
  {
    "texto1": "Algo desagradable o desordenado de ver (coloquial, a menudo negativo).",
    "texto2": "Espectáculo lamentable / Desastre",
    "texto3": "sight",
    "texto4": "Your room is a sight! Please clean it up. (¡Tu habitación es un desastre! Por favor, límpiala.)"
  },
  {
    "texto1": "Establecerse en un lugar de forma permanente o por un período prolongado.",
    "texto2": "Establecerse / Asentarse / Instalarse",
    "texto3": "settle",
    "texto4": "They decided to settle in a small town in the countryside. (Decidieron establecerse en un pueblo pequeño en el campo.)"
  },
  {
    "texto1": "Llegar a un acuerdo o resolver una disputa o problema.",
    "texto2": "Resolver / Acordar / Zanja",
    "texto3": "settle",
    "texto4": "The two companies managed to settle their dispute out of court. (Las dos empresas lograron resolver su disputa fuera de los tribunales.)"
  },
  {
    "texto1": "Calmarse o tranquilizarse, especialmente después de un período de agitación o excitación.",
    "texto2": "Calmarse / Tranquilizarse / Serenarse",
    "texto3": "settle",
    "texto4": "The children finally settled down after their exciting day. (Los niños finalmente se calmaron después de su emocionante día.)"
  },
  {
    "texto1": "Pagar una deuda o una cuenta.",
    "texto2": "Pagar / Saldar / Liquidar",
    "texto3": "settle",
    "texto4": "I need to settle my bill before checking out of the hotel. (Necesito pagar mi cuenta antes de salir del hotel.)"
  },
  {
    "texto1": "Sentarse o recostarse cómodamente.",
    "texto2": "Acomodarse / Sentarse / Recostarse",
    "texto3": "settle",
    "texto4": "She settled into her favorite armchair with a book. (Se acomodó en su sillón favorito con un libro.)"
  },
  {
    "texto1": "Un objeto, marca o forma que consiste en dos líneas o barras que se cruzan. También puede referirse a un símbolo religioso cristiano.",
    "texto2": "Cruz / Cruce / Símbolo",
    "texto3": "cross",
    "texto4": "The old church had a large wooden cross on its altar. (La iglesia antigua tenía una gran cruz de madera en su altar.)"
  },
  {
    "texto1": "Acción de moverse de un lado a otro, o de un punto a otro, generalmente con el fin de llegar a un destino.",
    "texto2": "Cruzar / Atravesar / Pasar",
    "texto3": "cross",
    "texto4": "Be careful when you cross the street. (Ten cuidado cuando cruces la calle.)"
  },
  {
    "texto1": "Estar enojado o irritado con alguien.",
    "texto2": "Enojado / Irritado / Molesto",
    "texto3": "cross",
    "texto4": "Don't cross your mother, she's in a bad mood. (No hagas enojar a tu madre, está de mal humor.)"
  },
  {
    "texto1": "Un híbrido, un animal o planta que es una mezcla de dos razas o especies diferentes.",
    "texto2": "Híbrido / Cruce / Mestizo",
    "texto3": "cross",
    "texto4": "The new rose is a cross between two different varieties. (La nueva rosa es un cruce entre dos variedades diferentes.)"
  },
  {
    "texto1": "Permitir o dar permiso para que algo suceda o para que alguien haga algo.",
    "texto2": "Permitir / Dejar / Conceder",
    "texto3": "let",
    "texto4": "My parents let me go to the party. (Mis padres me dejaron ir a la fiesta.)"
  },
  {
    "texto1": "Alquilar o arrendar una propiedad.",
    "texto2": "Alquilar / Arrendar / Ceder en alquiler",
    "texto3": "let",
    "texto4": "They decided to let their spare room to a student. (Decidieron alquilar su habitación libre a un estudiante.)"
  },
  {
    "texto1": "Causar o permitir que algo se mueva o fluya.",
    "texto2": "Dejar salir / Soltar / Liberar",
    "texto3": "let",
    "texto4": "She opened the window to let the fresh air in. (Abrió la ventana para dejar entrar el aire fresco.)"
  },
  {
    "texto1": "En tenis y otros deportes de raqueta, una jugada que debe repetirse porque la pelota toca la red pero cae en el campo correcto.",
    "texto2": "Repetición / Nula / Bola a la red",
    "texto3": "let",
    "texto4": "The umpire called a let after the serve touched the net. (El árbitro cantó 'let' después de que el saque tocó la red.)"
  },
  {
    "texto1": "Repetir o escribir las palabras exactas de alguien o de algún texto.",
    "texto2": "Citar / Mencionar / Referenciar",
    "texto3": "quote",
    "texto4": "He likes to quote famous philosophers in his essays. (Le gusta citar a filósofos famosos en sus ensayos.)"
  },
  {
    "texto1": "Dar un precio estimado por un trabajo o servicio.",
    "texto2": "Cotizar / Presupuestar / Tarifar",
    "texto3": "quote",
    "texto4": "Can you quote me a price for repairing my car? (¿Puedes cotizarme un precio por reparar mi coche?)"
  },
  {
    "texto1": "Una sección de texto o discurso extraída de un libro, documento o de las palabras de alguien.",
    "texto2": "Cita / Extracto / Frase",
    "texto3": "quote",
    "texto4": "The article began with a powerful quote from the president. (El artículo comenzó con una cita poderosa del presidente.)"
  },
  {
    "texto1": "En el mercado de valores, el precio actual de una acción o un valor.",
    "texto2": "Cotización / Precio / Valor",
    "texto3": "quote",
    "texto4": "The stock market quotes change throughout the day. (Las cotizaciones del mercado de valores cambian a lo largo del día.)"
  },
  {
    "texto1": "Abogar",
    "texto2": "Promover",
    "texto3": "advocate",
    "texto4": "They advocate for healthier eating habits."
  },
  {
    "texto1": "Luchar con gran esfuerzo para lograr algo o superar una dificultad.",
    "texto2": "Luchar / Esforzarse / Batallar",
    "texto3": "struggle",
    "texto4": "He had to struggle to finish the marathon. (Tuvo que esforzarse mucho para terminar el maratón.)"
  },
  {
    "texto1": "Tener dificultades económicas o para sobrevivir.",
    "texto2": "Apuros / Penurias / Dificultades",
    "texto3": "struggle",
    "texto4": "Many families struggle to make ends meet in this economy. (Muchas familias tienen dificultades para llegar a fin de mes en esta economía.)"
  },
  {
    "texto1": "Un esfuerzo grande y difícil para lograr algo.",
    "texto2": "Lucha / Esfuerzo / Dificultad",
    "texto3": "struggle",
    "texto4": "Her struggle for justice lasted for years. (Su lucha por la justicia duró años.)"
  },
  {
    "texto1": "Una pelea o combate físico en el que se ejerce fuerza.",
    "texto2": "Forcejeo / Pelea / Refriega",
    "texto3": "struggle",
    "texto4": "There was a brief struggle before the police subdued him. (Hubo un breve forcejeo antes de que la policía lo sometiera.)"
  },
  {
    "texto1": "Una característica distintiva o cualidad importante de algo.",
    "texto2": "Característica / Atributo / Cualidad",
    "texto3": "feature",
    "texto4": "The new phone has many impressive features, including a high-resolution camera. (El nuevo teléfono tiene muchas características impresionantes, incluyendo una cámara de alta resolución.)"
  },
  {
    "texto1": "Una parte prominente del rostro, como los ojos, la nariz o la boca.",
    "texto2": "Rasgo / Facción / Rasgo facial",
    "texto3": "feature",
    "texto4": "Her most striking feature is her beautiful blue eyes. (Su rasgo más llamativo son sus hermosos ojos azules.)"
  },
  {
    "texto1": "Presentar o incluir algo o a alguien como una parte importante o prominente.",
    "texto2": "Presentar / Destacar / Incluir",
    "texto3": "feature",
    "texto4": "The documentary will feature interviews with famous scientists. (El documental presentará entrevistas con científicos famosos.)"
  },
  {
    "texto1": "Un artículo o programa especial que se presenta con prominencia en un periódico, revista, sitio web o emisión de televisión.",
    "texto2": "Reportaje / Artículo especial / Pieza central",
    "texto3": "feature",
    "texto4": "The newspaper ran a feature on the growing trend of remote work. (El periódico publicó un reportaje sobre la creciente tendencia del trabajo remoto.)"
  },
  {
    "texto1": "Unión o conexión entre dos o más cosas, ideas o personas.",
    "texto2": "Vínculo / Conexión / Enlace",
    "texto3": "link",
    "texto4": "There's a strong link between diet and health. (Hay un fuerte vínculo entre la dieta y la salud.)"
  },
  {
    "texto1": "Un elemento en una página web que permite navegar a otra página o recurso al hacer clic en él.",
    "texto2": "Enlace / Hipervínculo / Link",
    "texto3": "link",
    "texto4": "Click on the link to download the document. (Haz clic en el enlace para descargar el documento.)"
  },
  {
    "texto1": "Conectar o unir dos o más cosas, personas o eventos.",
    "texto2": "Conectar / Unir / Vincular",
    "texto3": "link",
    "texto4": "The new bridge will link the two cities. (El nuevo puente unirá las dos ciudades.)"
  },
  {
    "texto1": "Un eslabón en una cadena o serie.",
    "texto2": "Eslabón / Aro / Pieza",
    "texto3": "link",
    "texto4": "Each link in the chain was carefully crafted. (Cada eslabón de la cadena fue cuidadosamente elaborado.)"
  },
  {
    "texto1": "singularidad",
    "texto2": "rareza",
    "texto3": "oddity",
    "texto4": "The oddity of the situation was"
  },
  {
    "texto1": "Hacia adelante; continuando en una dirección o curso.",
    "texto2": "Hacia adelante / Adelante / En adelante",
    "texto3": "forth",
    "texto4": "From this day forth, I will work harder. (De este día en adelante, trabajaré más duro.)"
  },
  {
    "texto1": "Fuera a la vista; hacia la existencia o a la luz.",
    "texto2": "A la vista / A la luz / Fuera",
    "texto3": "forth",
    "texto4": "The sun came forth from behind the clouds. (El sol salió de detrás de las nubes.)"
  },
  {
    "texto1": "Desde un lugar o fuente específica, o como un resultado.",
    "texto2": "Desde / A partir de / Como resultado",
    "texto3": "forth",
    "texto4": "The music poured forth from the speakers. (La música brotaba de los altavoces.)"
  },
  {
    "texto1": "Un trozo delgado de madera, más largo que ancho, que ha sido cortado o roto de un árbol o arbusto.",
    "texto2": "Palo / Rama / Vara",
    "texto3": "stick",
    "texto4": "The dog loves to fetch sticks in the park. (Al perro le encanta ir a buscar palos en el parque.)"
  },
  {
    "texto1": "Un objeto largo y delgado utilizado para un propósito específico, como un bastón o un palo de hockey.",
    "texto2": "Bastón / Palo / Barra",
    "texto3": "stick",
    "texto4": "He used a walking stick to help him climb the hill. (Usó un bastón para ayudarse a subir la colina.)"
  },
  {
    "texto1": "Adherirse o pegarse a una superficie.",
    "texto2": "Pegar / Adherir / Enganchar",
    "texto3": "stick",
    "texto4": "The mud stuck to his boots. (El barro se le pegó a las botas.)"
  },
  {
    "texto1": "Sobresalir o proyectarse de una superficie.",
    "texto2": "Asomar / Sobresalir / Proyectarse",
    "texto3": "stick",
    "texto4": "A small branch was sticking out of the bush. (Una pequeña rama sobresalía del arbusto.)"
  },
  {
    "texto1": "Ser difícil o imposible de quitar de un lugar o situación.",
    "texto2": "Atascarse / Quedarse atorado / Bloquearse",
    "texto3": "stick",
    "texto4": "The key got stuck in the lock. (La llave se atascó en la cerradura.)"
  },
  {
    "texto1": "Permanecer con algo, como una decisión o un plan, a pesar de las dificultades.",
    "texto2": "Perseverar / Mantenerse firme / Insistir",
    "texto3": "stick",
    "texto4": "You need to stick to your decision. (Tienes que mantenerte firme en tu decisión.)"
  },
  {
    "texto1": "Un beneficio o ventaja adicional que se recibe por un trabajo, un cargo o una situación.",
    "texto2": "Beneficio / Ventaja / Extra",
    "texto3": "perk",
    "texto4": "One of the perks of the job is free travel. (Uno de los beneficios del trabajo es viajar gratis.)"
  },
  {
    "texto1": "Levantar la cabeza de forma rápida y enérgica, a menudo para escuchar o mirar algo.",
    "texto2": "Levantar / Erguir / Alzar",
    "texto3": "perk",
    "texto4": "The dog perked up its ears when it heard the doorbell. (El perro levantó las orejas cuando escuchó el timbre.)"
  },
  {
    "texto1": "Profundo dolor o sufrimiento causado por la pérdida de algo o alguien, especialmente por la muerte de una persona.",
    "texto2": "Pena / Duelo / Tristeza profunda",
    "texto3": "grief",
    "texto4": "She felt overwhelming grief after the loss of her pet. (Ella sintió una pena abrumadora después de la pérdida de su mascota.)"
  },
  {
    "texto1": "Causa de gran angustia o molestia.",
    "texto2": "Angustia / Molestia / Sufrimiento",
    "texto3": "grief",
    "texto4": "The constant delays caused them a lot of grief. (Los constantes retrasos les causaron mucha molestia.)"
  },
  {
    "texto1": "Presumir o alardear de los propios logros, posesiones o cualidades de manera excesiva y jactanciosa.",
    "texto2": "Alardear / Presumir / Jactarse",
    "texto3": "brag",
    "texto4": "He always brags about his expensive car. (Siempre alardea de su coche caro.)"
  },
  {
    "texto1": "Un acto de presumir o una declaración jactanciosa.",
    "texto2": "Alarde / Fanfarronería / Presunción",
    "texto3": "brag",
    "texto4": "I'm not trying to make a brag, but I did win the competition. (No estoy tratando de alardear, pero sí gané la competición.)"
  },
  {
    "texto1": "Prestar dinero o un objeto a alguien con la expectativa de que sea devuelto.",
    "texto2": "Prestar / Dejar / Facilitar",
    "texto3": "lend",
    "texto4": "Can you lend me your pen for a moment? (¿Puedes prestarme tu bolígrafo un momento?)"
  },
  {
    "texto1": "Dar o añadir una cualidad o característica a algo.",
    "texto2": "Dar / Aportar / Conferir",
    "texto3": "lend",
    "texto4": "The flowers lend a touch of beauty to the room. (Las flores aportan un toque de belleza a la habitación.)"
  },
  {
    "texto1": "Permitirse o ser susceptible a algo.",
    "texto2": "Prestarse a / Ser propenso a / Permitir",
    "texto3": "lend",
    "texto4": "The story doesn't lend itself to a simple explanation. (La historia no se presta a una explicación sencilla.)"
  },
  {
    "texto1": "Un frío desagradable o ligeramente frío.",
    "texto2": "Fresco / Frío / Templado",
    "texto3": "chilly",
    "texto4": "It's a bit chilly outside, so you might want to wear a jacket. (Hace un poco de frío afuera, así que quizás quieras ponerte una chaqueta.)"
  },
  {
    "texto1": "Una sensación de frío en el cuerpo, a menudo acompañada de escalofríos.",
    "texto2": "Escalofrío / Sensación de frío / Cardenal",
    "texto3": "chilly",
    "texto4": "She felt a chilly sensation running down her spine. (Sintió un escalofrío recorriendo su espalda.)"
  },
  {
    "texto1": "De manera fría, distante o poco amigable.",
    "texto2": "Frío / Distante / Poco amigable",
    "texto3": "chilly",
    "texto4": "His response was a bit chilly, and I felt unwelcome. (Su respuesta fue un poco fría y me sentí incómodo.)"
  },
  {
    "texto1": "Guiar o dirigir a un grupo de personas o una organización.",
    "texto2": "Dirigir / Guiar / Encabezar",
    "texto3": "lead",
    "texto4": "She will lead the team on the new project. (Ella dirigirá el equipo en el nuevo proyecto.)"
  },
  {
    "texto1": "Ir delante o en primera posición.",
    "texto2": "Ir a la cabeza / Encabezar / Delantero",
    "texto3": "lead",
    "texto4": "The fastest runner will lead the race. (El corredor más rápido irá a la cabeza de la carrera.)"
  },
  {
    "texto1": "Causar que algo ocurra o tenga un resultado específico.",
    "texto2": "Conducir a / Llevar a / Provocar",
    "texto3": "lead",
    "texto4": "Lack of exercise can lead to health problems. (La falta de ejercicio puede llevar a problemas de salud.)"
  },
  {
    "texto1": "El acto o ejemplo de guiar o dirigir.",
    "texto2": "Liderazgo / Dirección / Guía",
    "texto3": "lead",
    "texto4": "Her strong lead inspired the rest of the team. (Su fuerte liderazgo inspiró al resto del equipo.)"
  },
  {
    "texto1": "El papel principal en una obra de teatro, película o grupo musical.",
    "texto2": "Protagonista / Papel principal / Voz principal",
    "texto3": "lead",
    "texto4": "He got the lead role in the school play. (Él obtuvo el papel principal en la obra de teatro de la escuela.)"
  },
  {
    "texto1": "Un metal pesado, blando y gris, utilizado en baterías y otros productos.",
    "texto2": "Plomo",
    "texto3": "lead",
    "texto4": "Old pipes were often made of lead. (Las tuberías antiguas a menudo estaban hechas de plomo.)"
  },
  {
    "texto1": "Un punto de acceso o entrada a un lugar o sistema, ya sea físico o virtual.",
    "texto2": "Acceso / Entrada / Portal",
    "texto3": "gateway",
    "texto4": "The city gate served as a gateway to the ancient fortress. (La puerta de la ciudad servía como acceso a la antigua fortaleza.)"
  },
  {
    "texto1": "Un dispositivo o sistema que permite la comunicación entre redes con protocolos diferentes.",
    "texto2": "Pasarela / Puerta de enlace / Conector",
    "texto3": "gateway",
    "texto4": "The internet router acts as a gateway to the worldwide web. (El router de internet actúa como una pasarela a la red mundial.)"
  },
  {
    "texto1": "Algo que sirve como medio para lograr algo más grande o más importante.",
    "texto2": "Vía / Canal / Paso",
    "texto3": "gateway",
    "texto4": "This training program is a gateway to a new career. (Este programa de capacitación es una vía para una nueva carrera.)"
  },
  {
    "texto1": "Una gran cantidad de dinero, propiedades u otros recursos valiosos.",
    "texto2": "Riqueza / Fortuna / Patrimonio",
    "texto3": "wealth",
    "texto4": "The family accumulated great wealth over generations. (La familia acumuló una gran riqueza a lo largo de generaciones.)"
  },
  {
    "texto1": "Abundancia de algo deseable o valioso.",
    "texto2": "Abundancia / Profusión / Riqueza",
    "texto3": "wealth",
    "texto4": "The country has a wealth of natural resources. (El país tiene una gran riqueza de recursos naturales.)"
  },
  {
    "texto1": "El estado de ser rico o próspero.",
    "texto2": "Prosperidad / Afluencia / Opulencia",
    "texto3": "wealth",
    "texto4": "His goal in life was to achieve wealth and happiness. (Su objetivo en la vida era alcanzar la riqueza y la felicidad.)"
  },
  {
    "texto1": "Realizar o llevar a cabo una acción, especialmente una ilegal o incorrecta.",
    "texto2": "Cometer / Perpetrar / Realizar",
    "texto3": "commit",
    "texto4": "He committed a serious error in judgment. (Cometió un grave error de juicio.)"
  },
  {
    "texto1": "Dedicarse o prometerse firmemente a una persona, causa o curso de acción.",
    "texto2": "Comprometerse / Dedicarse / Prometerse",
    "texto3": "commit",
    "texto4": "She is committed to her work and always gives her best. (Ella está comprometida con su trabajo y siempre da lo mejor de sí.)"
  },
  {
    "texto1": "Confiar a alguien o algo al cuidado de otro, o enviar a alguien a una institución, como una prisión o un hospital psiquiátrico.",
    "texto2": "Encomendar / Ingresar / Internar",
    "texto3": "commit",
    "texto4": "The judge decided to commit the patient to a psychiatric hospital. (El juez decidió internar al paciente en un hospital psiquiátrico.)"
  },
  {
    "texto1": "En sistemas de control de versiones, guardar los cambios realizados en un archivo o conjunto de archivos en el repositorio.",
    "texto2": "Confirmar / Guardar cambios / Consolidar",
    "texto3": "commit",
    "texto4": "Don't forget to commit your changes before pushing. (No olvides confirmar tus cambios antes de subir.)"
  },
  {
    "texto1": "Un acto o una instancia de cometer algo.",
    "texto2": "Compromiso / Acto / Ejecución",
    "texto3": "commit",
    "texto4": "The company showed a strong commit to environmental protection. (La empresa mostró un fuerte compromiso con la protección del medio ambiente.)"
  },
  {
    "texto1": "Producir o generar un resultado, beneficio o cosecha.",
    "texto2": "Producir / Generar / Rendir",
    "texto3": "yield",
    "texto4": "The apple tree yields a lot of fruit every summer. (El manzano produce mucha fruta cada verano.)"
  },
  {
    "texto1": "Ceder el paso o la prioridad, especialmente en el tráfico o en una discusión.",
    "texto2": "Ceder el paso / Ceder / Rendirse",
    "texto3": "yield",
    "texto4": "You must yield to pedestrians at the crosswalk. (Debes ceder el paso a los peatones en el cruce de peatones.)"
  },
  {
    "texto1": "Colapsar o doblarse bajo presión o fuerza.",
    "texto2": "Ceder / Colapsar / Doblarse",
    "texto3": "yield",
    "texto4": "The old bridge might yield under the heavy weight. (El viejo puente podría ceder bajo el peso pesado.)"
  },
  {
    "texto1": "La cantidad producida o generada por un proceso o cultivo.",
    "texto2": "Rendimiento / Producción / Cosecha",
    "texto3": "yield",
    "texto4": "The farmer was pleased with the high yield of corn this year. (El agricultor estaba contento con el alto rendimiento de maíz este año.)"
  },
  {
    "texto1": "El ingreso o ganancia obtenida de una inversión.",
    "texto2": "Rentabilidad / Rendimiento / Ganancia",
    "texto3": "yield",
    "texto4": "The bond has a high yield, making it an attractive investment. (El bono tiene un alto rendimiento, lo que lo convierte en una inversión atractiva.)"
  },
  {
    "texto1": "Que tiene poca fuerza física, energía o resistencia.",
    "texto2": "Débil / Frágil / Enteble",
    "texto3": "weak",
    "texto4": "He felt too weak to lift the heavy box. (Se sentía demasiado débil para levantar la caja pesada.)"
  },
  {
    "texto1": "Que es propenso a ceder, romperse o fallar; que no es fuerte o sólido.",
    "texto2": "Débil / Vulnerable / Poco resistente",
    "texto3": "weak",
    "texto4": "The bridge's structure was weak and needed repairs. (La estructura del puente era débil y necesitaba reparaciones.)"
  },
  {
    "texto1": "Que carece de poder, autoridad o influencia.",
    "texto2": "Débil / Impotente / Indefenso",
    "texto3": "weak",
    "texto4": "The argument was based on weak evidence. (El argumento se basaba en pruebas débiles.)"
  },
  {
    "texto1": "Que tiene una concentración o intensidad baja, como una bebida o una luz.",
    "texto2": "Flojo / Suave / Diluido",
    "texto3": "weak",
    "texto4": "I prefer weak coffee in the mornings. (Prefiero el café flojo por las mañanas.)"
  },
  {
    "texto1": "Que no tiene convicción o resolución; que es fácilmente influenciable.",
    "texto2": "Débil de carácter / Indeciso / Influenciable",
    "texto3": "weak",
    "texto4": "He has a weak will when it comes to resisting desserts. (Tiene una voluntad débil cuando se trata de resistir los postres.)"
  },
  {
    "texto1": "Muñeco",
    "texto2": "Tonto",
    "texto3": "dummy",
    "texto4": "Don't be such a dummy"
  },
  {
    "texto1": "Llevar o transportar algo o a alguien de un lugar a otro.",
    "texto2": "Traer / Llevar / Aportar",
    "texto3": "bring",
    "texto4": "Don't forget to bring your umbrella; it might rain. (No olvides traer tu paraguas; podría llover.)"
  },
  {
    "texto1": "Causar que algo ocurra o suceda.",
    "texto2": "Provocar / Causar / Generar",
    "texto3": "bring",
    "texto4": "The new policy will bring about significant changes. (La nueva política provocará cambios significativos.)"
  },
  {
    "texto1": "Hacer que alguien o algo llegue a un estado o condición particular.",
    "texto2": "Poner / Dejar / Conducir a",
    "texto3": "bring",
    "texto4": "The bad news brought her to tears. (La mala noticia la hizo llorar.)"
  },
  {
    "texto1": "Presentar una demanda o una acusación formal.",
    "texto2": "Presentar / Interponer / Entablar",
    "texto3": "bring",
    "texto4": "They decided to bring a lawsuit against the company. (Decidieron interponer una demanda contra la empresa.)"
  },
  {
    "texto1": "Con relación a o con respecto a algo o alguien.",
    "texto2": "Respecto a / En cuanto a / Sobre",
    "texto3": "regarding",
    "texto4": "I have a question regarding your recent announcement. (Tengo una pregunta con respecto a su reciente anuncio.)"
  },
  {
    "texto1": "Considerar o ver a alguien o algo de una manera particular.",
    "texto2": "Considerar / Ver / Estimar",
    "texto3": "regarding",
    "texto4": "She is regarded as one of the best artists of her generation. (Ella es considerada una de las mejores artistas de su generación.)"
  },
  {
    "texto1": "Sorprender o asombrar a alguien de una manera que causa admiración o desconcierto.",
    "texto2": "Asombrar / Sorprender / Maravillar",
    "texto3": "amaze",
    "texto4": "The magician's tricks always amaze the audience. (Los trucos del mago siempre asombran a la audiencia.)"
  },
  {
    "texto1": "Causar gran admiración o impacto.",
    "texto2": "Impresionar / Deslumbrar / Fascinar",
    "texto3": "amaze",
    "texto4": "Her talent continues to amaze everyone who sees her perform. (Su talento sigue asombrando a todos los que la ven actuar.)"
  },
  {
    "texto1": "Que se espera que ocurra o se realice en un momento determinado; con fecha límite.",
    "texto2": "Previsto / Vencido / A pagar",
    "texto3": "due",
    "texto4": "The rent is due on the first of every month. (El alquiler vence el primer día de cada mes.)"
  },
  {
    "texto1": "Adecuado o apropiado para una situación o propósito.",
    "texto2": "Debido / Apropiado / Justo",
    "texto3": "due",
    "texto4": "Please give the matter due consideration. (Por favor, tómese el asunto con la debida consideración.)"
  },
  {
    "texto1": "Como resultado de o causado por algo.",
    "texto2": "Debido a / A causa de / Gracias a",
    "texto3": "due",
    "texto4": "The accident was due to careless driving. (El accidente fue debido a la conducción descuidada.)"
  },
  {
    "texto1": "Un pago o cuota que se debe.",
    "texto2": "Cuota / Cargo / Tarifa",
    "texto3": "due",
    "texto4": "Membership dues are collected annually. (Las cuotas de membresía se cobran anualmente.)"
  },
  {
    "texto1": "Una plataforma elevada en un teatro, sala de conciertos, etc., donde actúan los artistas.",
    "texto2": "Escenario / Tarima / Plataforma",
    "texto3": "stage",
    "texto4": "The band walked onto the stage to a cheering crowd. (La banda subió al escenario ante una multitud que aplaudía.)"
  },
  {
    "texto1": "Un período o fase en el desarrollo de algo.",
    "texto2": "Etapa / Fase / Estadio",
    "texto3": "stage",
    "texto4": "The project is in its final stage of development. (El proyecto está en su etapa final de desarrollo.)"
  },
  {
    "texto1": "Organizar o llevar a cabo un evento, una obra de teatro o una protesta.",
    "texto2": "Organizar / Montar / Escenificar",
    "texto3": "stage",
    "texto4": "The students decided to stage a protest against the new rules. (Los estudiantes decidieron organizar una protesta contra las nuevas reglas.)"
  },
  {
    "texto1": "La profesión de actor o actriz en el teatro.",
    "texto2": "Teatro / Escena / Interpretación",
    "texto3": "stage",
    "texto4": "She always dreamed of a career on the stage. (Ella siempre soñó con una carrera en el teatro.)"
  },
  {
    "texto1": "Ser del tamaño o la forma correctos para alguien o algo.",
    "texto2": "Ajustar / Quedar bien / Servir",
    "texto3": "fit",
    "texto4": "These shoes fit me perfectly. (Estos zapatos me quedan perfectos.)"
  },
  {
    "texto1": "Ser adecuado o apropiado para una situación o propósito.",
    "texto2": "Encajar / Ser apropiado / Corresponder",
    "texto3": "fit",
    "texto4": "His explanation didn't quite fit the facts. (Su explicación no encajaba del todo con los hechos.)"
  },
  {
    "texto1": "Instalar o colocar algo en una posición específica.",
    "texto2": "Instalar / Montar / Colocar",
    "texto3": "fit",
    "texto4": "We need to fit a new lock on the door. (Necesitamos instalar una cerradura nueva en la puerta.)"
  },
  {
    "texto1": "En buena condición física o saludable.",
    "texto2": "En forma / Saludable / Atlético",
    "texto3": "fit",
    "texto4": "She works out regularly to stay fit. (Ella hace ejercicio regularmente para mantenerse en forma.)"
  },
  {
    "texto1": "Un acceso o arrebato repentino de una emoción o enfermedad.",
    "texto2": "Ataque / Acceso / Arrebato",
    "texto3": "fit",
    "texto4": "He had a fit of coughing after inhaling the smoke. (Le dio un ataque de tos después de inhalar el humo.)"
  },
  {
    "texto1": "Percibir con los ojos; notar o ser consciente de algo usando el sentido de la vista.",
    "texto2": "Ver / Mirar / Observar",
    "texto3": "see",
    "texto4": "Did you see that beautiful bird? (¿Viste ese pájaro hermoso?)"
  },
  {
    "texto1": "Entender o comprender algo.",
    "texto2": "Entender / Comprender / Darse cuenta",
    "texto3": "see",
    "texto4": "Now I see what you mean. (Ahora entiendo lo que quieres decir.)"
  },
  {
    "texto1": "Encontrarse o reunirse con alguien.",
    "texto2": "Ver a / Reunirse con / Encontrarse con",
    "texto3": "see",
    "texto4": "I'll see you tomorrow at the office. (Te veré mañana en la oficina.)"
  },
  {
    "texto1": "Acompañar a alguien a un lugar o guiarlo.",
    "texto2": "Acompañar / Guiar / Llevar",
    "texto3": "see",
    "texto4": "Let me see you to the door. (Déjame acompañarte a la puerta.)"
  },
  {
    "texto1": "Asegurarse de que algo se haga o suceda.",
    "texto2": "Asegurarse / Encargarse / Velar por",
    "texto3": "see",
    "texto4": "Can you see to it that the report is finished on time? (¿Puedes encargarte de que el informe esté terminado a tiempo?)"
  },
  {
    "texto1": "Hacerse visible o presentarse, especialmente de forma inesperada o repentina.",
    "texto2": "Aparecer / Surgir / Manifestarse",
    "texto3": "appear",
    "texto4": "A strange light appeared in the sky. (Una luz extraña apareció en el cielo.)"
  },
  {
    "texto1": "Dar la impresión de ser o existir de cierta manera.",
    "texto2": "Parecer / Aparentar / Tener aspecto de",
    "texto3": "appear",
    "texto4": "He appears to be very tired today. (Parece estar muy cansado hoy.)"
  },
  {
    "texto1": "Presentarse formalmente en un lugar, como un tribunal o un escenario.",
    "texto2": "Comparecer / Actuar / Presentarse",
    "texto3": "appear",
    "texto4": "The lawyer will appear in court tomorrow. (El abogado comparecerá ante el tribunal mañana.)"
  },
  {
    "texto1": "Ser publicado o salir a la luz (refiriéndose a un libro, artículo, etc.).",
    "texto2": "Publicarse / Salir / Ver la luz",
    "texto3": "appear",
    "texto4": "His new novel will appear next month. (Su nueva novela se publicará el próximo mes.)"
  },
  {
    "texto1": "Tabla",
    "texto2": "Pizarra",
    "texto3": "board",
    "texto4": "She wrote the lesson on the board"
  },
  {
    "texto1": "Que tiene un carácter o temperamento suave, amable y considerado, evitando la brusquedad o la dureza.",
    "texto2": "Amable / Suave / Tierno",
    "texto3": "gentle",
    "texto4": "He has a very gentle nature and is always kind to everyone. (Tiene un carácter muy amable y siempre es bueno con todos.)"
  },
  {
    "texto1": "Que es delicado, ligero y no causa daño ni dolor, especialmente en el tacto o el movimiento.",
    "texto2": "Delicado / Leve / Suave",
    "texto3": "gentle",
    "texto4": "She applied the cream with gentle strokes to avoid irritating her skin. (Aplicó la crema con suaves toques para evitar irritar su piel.)"
  },
  {
    "texto1": "Que tiene una inclinación o pendiente ligera y gradual.",
    "texto2": "Suave / Leve / Ligero",
    "texto3": "gentle",
    "texto4": "The path led down a gentle slope to the river. (El camino bajaba por una suave pendiente hasta el río.)"
  },
  {
    "texto1": "Que pertenece a una clase social distinguida o noble.",
    "texto2": "Noble / De buena familia / Distinguido",
    "texto3": "gentle",
    "texto4": "He was born into a gentle family with a long history. (Nació en una familia noble con una larga historia.)"
  },
  {
    "texto1": "Formular una pregunta a alguien para obtener información o una respuesta.",
    "texto2": "Preguntar / Interrogar / Cuestionar",
    "texto3": "ask",
    "texto4": "I need to ask my teacher about the homework. (Necesito preguntarle a mi profesor sobre la tarea.)"
  },
  {
    "texto1": "Pedir algo, como ayuda, permiso o un favor.",
    "texto2": "Pedir / Solicitar / Rogar",
    "texto3": "ask",
    "texto4": "She decided to ask for a raise at work. (Ella decidió pedir un aumento en el trabajo.)"
  },
  {
    "texto1": "Invitar a alguien a ir a un lugar o a hacer algo.",
    "texto2": "Invitar / Convidar / Llamar",
    "texto3": "ask",
    "texto4": "He asked her to the dance. (Él la invitó al baile.)"
  },
  {
    "texto1": "Exigir o requerir algo, especialmente un precio o una condición.",
    "texto2": "Pedir / Exigir / Requerir",
    "texto3": "ask",
    "texto4": "The antique dealer was asking a very high price for the vase. (El anticuario estaba pidiendo un precio muy alto por el jarrón.)"
  },
  {
    "texto1": "Depender de alguien o algo para recibir apoyo, ayuda o para que algo suceda.",
    "texto2": "Depender / Confiar / Contar con",
    "texto3": "rely",
    "texto4": "You can always rely on me for help. (Siempre puedes contar conmigo para que te ayude.)"
  },
  {
    "texto1": "Tener confianza o fe en alguien o algo.",
    "texto2": "Confiar / Fiarse / Creer en",
    "texto3": "rely",
    "texto4": "We rely on our data for accurate predictions. (Confiamos en nuestros datos para predicciones precisas.)"
  },
  {
    "texto1": "Que tiene la capacidad, los medios o la cualificación para hacer algo.",
    "texto2": "Capaz / Habilidoso / Competente",
    "texto3": "able",
    "texto4": "She is able to speak three languages fluently. (Ella es capaz de hablar tres idiomas con fluidez.)"
  },
  {
    "texto1": "Que tiene el poder o la oportunidad de hacer algo.",
    "texto2": "Capaz de / En condiciones de / Con posibilidad de",
    "texto3": "able",
    "texto4": "I won't be able to attend the meeting tomorrow. (No podré asistir a la reunión mañana.)"
  },
  {
    "texto1": "Que es inteligente, competente o tiene talento.",
    "texto2": "Inteligente / Capaz / Talentoso",
    "texto3": "able",
    "texto4": "He is an able student who quickly grasps new concepts. (Es un estudiante capaz que asimila rápidamente nuevos conceptos.)"
  },
  {
    "texto1": "Apuntar",
    "texto2": "Aspirar/objetivo",
    "texto3": "aim",
    "texto4": "She aims to become a doctor"
  },
  {
    "texto1": "Revolcarse",
    "texto2": "Disfrutar",
    "texto3": "wallow",
    "texto4": "The pigs wallow in the mud"
  },
  {
    "texto1": "Hundirse o descender bajo la superficie del agua o de un líquido.",
    "texto2": "Hundirse / Sumergirse / Irse a pique",
    "texto3": "sink",
    "texto4": "The heavy stone began to sink in the water. (La piedra pesada comenzó a hundirse en el agua.)"
  },
  {
    "texto1": "Descender o moverse hacia abajo lentamente.",
    "texto2": "Bajar / Caer / Descender",
    "texto3": "sink",
    "texto4": "The sun began to sink below the horizon. (El sol comenzó a descender por debajo del horizonte.)"
  },
  {
    "texto1": "Empeorar o disminuir en calidad, cantidad o intensidad.",
    "texto2": "Deteriorarse / Degradar / Disminuir",
    "texto3": "sink",
    "texto4": "His health began to sink after the illness. (Su salud comenzó a deteriorarse después de la enfermedad.)"
  },
  {
    "texto1": "Un recipiente fijo con grifos, generalmente en una cocina o baño, para lavarse o lavar cosas.",
    "texto2": "Fregadero / Lavabo / Pila",
    "texto3": "sink",
    "texto4": "Please put the dirty dishes in the kitchen sink. (Por favor, pon los platos sucios en el fregadero de la cocina.)"
  },
  {
    "texto1": "Un lugar bajo o deprimido donde el agua tiende a acumularse.",
    "texto2": "Depresión / Hondonada / Sumidero",
    "texto3": "sink",
    "texto4": "The area became a natural sink for rainwater. (El área se convirtió en un sumidero natural para el agua de lluvia.)"
  },
  {
    "texto1": "Un mamífero marino con aletas, pelaje grueso y cuerpo fusiforme, que vive en regiones costeras y polares.",
    "texto2": "Foca / Lobo marino / Otaria",
    "texto3": "seal",
    "texto4": "We saw a large seal basking on the rocks. (Vimos una foca grande tomando el sol en las rocas.)"
  },
  {
    "texto1": "Un dispositivo o material que se utiliza para cerrar o asegurar algo herméticamente, impidiendo la entrada o salida de aire, líquido, etc.",
    "texto2": "Sello / Junta / Cierre hermético",
    "texto3": "seal",
    "texto4": "Make sure the container has a tight seal to keep the food fresh. (Asegúrate de que el recipiente tenga un cierre hermético para mantener la comida fresca.)"
  },
  {
    "texto1": "Un diseño o imagen estampado en cera, papel, etc., para autenticar un documento, o un troquel o sello con el que se hace esta marca.",
    "texto2": "Sello / Timbre / Emblema",
    "texto3": "seal",
    "texto4": "The letter had the king's official seal. (La carta tenía el sello oficial del rey.)"
  },
  {
    "texto1": "Cerrar o asegurar algo herméticamente para evitar fugas o la entrada de elementos externos.",
    "texto2": "Sellar / Cerrar / Hermetizar",
    "texto3": "seal",
    "texto4": "You need to seal the package before mailing it. (Necesitas sellar el paquete antes de enviarlo por correo.)"
  },
  {
    "texto1": "Confirmar o finalizar un acuerdo o pacto.",
    "texto2": "Sellar / Ratificar / Confirmar",
    "texto3": "seal",
    "texto4": "They shook hands to seal the deal. (Se dieron la mano para sellar el trato.)"
  },
  {
    "texto1": "Que muestra una falta de experiencia, juicio o sofisticación, a menudo por inocencia o credulidad.",
    "texto2": "Ingenuo / Inocente / Crédulo",
    "texto3": "naive",
    "texto4": "She was so naive she believed everything he told her. (Era tan ingenua que creyó todo lo que él le dijo.)"
  },
  {
    "texto1": "Que es demasiado simple o poco realista en su concepción, a menudo debido a la falta de consideración de las complejidades del mundo real.",
    "texto2": "Simplista / Poco realista / Cándido",
    "texto3": "naive",
    "texto4": "His plan for world peace was a bit naive. (Su plan para la paz mundial era un poco ingenuo.)"
  },
  {
    "texto1": "Referido al arte, un estilo que carece de formación académica formal, a menudo caracterizado por una simplicidad y espontaneidad.",
    "texto2": "Naíf / Primitivo / Informal",
    "texto3": "naive",
    "texto4": "The painting had a charming, naive quality. (La pintura tenía una cualidad encantadora y naíf.)"
  },
  {
    "texto1": "El desarrollo inevitable y predestinado de los acontecimientos; el destino.",
    "texto2": "Destino / Hado / Suerte",
    "texto3": "fate",
    "texto4": "It was fate that brought them together. (Fue el destino lo que los unió.)"
  },
  {
    "texto1": "Un poder o agencia supuestamente responsable de predeterminar y ordenar los acontecimientos.",
    "texto2": "Sino / Fortuna / Providencia",
    "texto3": "fate",
    "texto4": "She believed her fate was to become a great artist. (Ella creía que su sino era convertirse en una gran artista.)"
  },
  {
    "texto1": "El resultado final o la consecuencia de algo o de la vida de una persona.",
    "texto2": "Desenlace / Fin / Condición final",
    "texto3": "fate",
    "texto4": "The fate of the missing explorers remains unknown. (El desenlace de los exploradores desaparecidos sigue siendo desconocido.)"
  },
  {
    "texto1": "Un proceso formal en un tribunal para determinar la culpabilidad o inocencia de una persona acusada de un delito.",
    "texto2": "Juicio / Proceso judicial / Visto",
    "texto3": "trials",
    "texto4": "The criminal trials can last for several weeks. (Los juicios penales pueden durar varias semanas.)"
  },
  {
    "texto1": "Un experimento o prueba para evaluar la eficacia, calidad o seguridad de algo.",
    "texto2": "Ensayo / Prueba / Experimentación",
    "texto3": "trials",
    "texto4": "The new drug is currently undergoing clinical trials. (El nuevo medicamento está actualmente en ensayos clínicos.)"
  },
  {
    "texto1": "Dificultades o problemas que alguien enfrenta en la vida.",
    "texto2": "Penalidades / Tribulaciones / Adversidades",
    "texto3": "trials",
    "texto4": "She faced many trials and tribulations throughout her life. (Ella enfrentó muchas penalidades y tribulaciones a lo largo de su vida.)"
  },
  {
    "texto1": "Una competición o serie de competiciones para probar habilidades o capacidades.",
    "texto2": "Pruebas / Eliminatorias / Competiciones",
    "texto3": "trials",
    "texto4": "The Olympic trials will determine who represents the country. (Las pruebas olímpicas determinarán quién representa al país.)"
  },
  {
    "texto1": "Pretérito y participio pasado de 'mean'. Tener la intención de hacer algo o tener un propósito particular.",
    "texto2": "Quiso decir / Tuvo la intención / Significó",
    "texto3": "meant",
    "texto4": "I meant to call you earlier, but I got busy. (Quise llamarte antes, pero me ocupé.)"
  },
  {
    "texto1": "Pretérito y participio pasado de 'mean'. Transmitir o expresar un significado o idea.",
    "texto2": "Significó / Quería decir / Representó",
    "texto3": "meant",
    "texto4": "What he said meant a lot to me. (Lo que dijo significó mucho para mí.)"
  },
  {
    "texto1": "Pretérito y participio pasado de 'mean'. Estar destinado a ser o a ocurrir.",
    "texto2": "Estaba destinado / Debía ser / Corresponder",
    "texto3": "meant",
    "texto4": "They were meant to be together. (Estaban destinados a estar juntos.)"
  },
  {
    "texto1": "El fundamento o la razón principal de algo; la base sobre la que se construye o se apoya algo.",
    "texto2": "Base / Fundamento / Cimiento",
    "texto3": "basis",
    "texto4": "The theory forms the basis for his research. (La teoría constituye la base de su investigación.)"
  },
  {
    "texto1": "La forma o el modo en que se organiza o se hace algo.",
    "texto2": "Forma / Modo / Criterio",
    "texto3": "basis",
    "texto4": "They meet on a regular basis to discuss their progress. (Se reúnen de forma regular para discutir su progreso.)"
  },
  {
    "texto1": "Un ingrediente principal o componente esencial de algo.",
    "texto2": "Componente / Ingrediente / Elemento principal",
    "texto3": "basis",
    "texto4": "This recipe uses tomatoes as its main basis. (Esta receta usa tomates como su principal componente.)"
  },
  {
    "texto1": "Preocupación, ansiedad o inquietud sobre algo.",
    "texto2": "Preocupación / Inquietud / Ansiedad",
    "texto3": "concern",
    "texto4": "There is growing concern about climate change. (Existe una creciente preocupación por el cambio climático.)"
  },
  {
    "texto1": "Un asunto que afecta o es de interés para alguien o algo.",
    "texto2": "Asunto / Interés / Incumbencia",
    "texto3": "concern",
    "texto4": "That's no concern of yours. (Eso no es asunto tuyo.)"
  },
  {
    "texto1": "Afectar, involucrar o ser relevante para alguien o algo.",
    "texto2": "Afectar / Atener / Incumbir",
    "texto3": "concern",
    "texto4": "The new regulations primarily concern environmental protection. (Las nuevas regulaciones conciernen principalmente a la protección del medio ambiente.)"
  },
  {
    "texto1": "Causar preocupación o ansiedad a alguien.",
    "texto2": "Preocupar / Inquietar / Afligir",
    "texto3": "concern",
    "texto4": "His poor health greatly concerns his family. (Su mala salud preocupa mucho a su familia.)"
  },
  {
    "texto1": "El uso de la fuerza física o mental para lograr algo; un intento arduo o laborioso.",
    "texto2": "Esfuerzo / Empeño / Dédicacion",
    "texto3": "effort",
    "texto4": "Learning a new language requires a lot of effort. (Aprender un nuevo idioma requiere mucho esfuerzo.)"
  },
  {
    "texto1": "Un resultado del trabajo o la acción; un logro.",
    "texto2": "Logro / Resultado / Obra",
    "texto3": "effort",
    "texto4": "The charity gala was a great effort and raised a lot of money. (La gala benéfica fue un gran esfuerzo y recaudó mucho dinero.)"
  },
  {
    "texto1": "Un intento serio o determinado de hacer algo.",
    "texto2": "Intento / Tentativa / Prueba",
    "texto3": "effort",
    "texto4": "He made an effort to be more punctual. (Hizo un esfuerzo por ser más puntual.)"
  },
  {
    "texto1": "Una medida, cantidad o frecuencia de algo en relación con otra cantidad o período de tiempo.",
    "texto2": "Tasa / Índice / Proporción",
    "texto3": "rate",
    "texto4": "The birth rate in the country has decreased. (La tasa de natalidad en el país ha disminuido.)"
  },
  {
    "texto1": "El costo o cargo por un servicio o producto, a menudo expresado por unidad.",
    "texto2": "Tarifa / Precio / Cuota",
    "texto3": "rate",
    "texto4": "What's the hourly rate for this service? (¿Cuál es la tarifa por hora de este servicio?)"
  },
  {
    "texto1": "Asignar un valor, clasificación o evaluación a algo o alguien.",
    "texto2": "Clasificar / Evaluar / Calificar",
    "texto3": "rate",
    "texto4": "How would you rate this movie out of five stars? (¿Cómo calificarías esta película de cinco estrellas?)"
  },
  {
    "texto1": "Considerar algo o a alguien de una manera particular.",
    "texto2": "Considerar / Estimar / Valorar",
    "texto3": "rate",
    "texto4": "I would rate him as one of the best players on the team. (Lo consideraría uno de los mejores jugadores del equipo.)"
  },
  {
    "texto1": "Considerar o pensar en algo o alguien de una manera particular.",
    "texto2": "Considerar / Estimar / Ver",
    "texto3": "regard",
    "texto4": "He is highly regarded as a leader in his field. (Es muy considerado como un líder en su campo.)"
  },
  {
    "texto1": "Mirar o observar a alguien o algo, prestando atención.",
    "texto2": "Mirar / Observar / Contemplar",
    "texto3": "regard",
    "texto4": "She regarded him with a puzzled expression. (Ella lo miró con una expresión perpleja.)"
  },
  {
    "texto1": "Respeto, admiración o aprecio por alguien o algo.",
    "texto2": "Respeto / Admiración / Estima",
    "texto3": "regard",
    "texto4": "I have great regard for her honesty. (Tengo un gran respeto por su honestidad.)"
  },
  {
    "texto1": "Atención o consideración hacia algo.",
    "texto2": "Atención / Consideración / Cuidado",
    "texto3": "regard",
    "texto4": "You should act with due regard for safety. (Debes actuar con la debida consideración por la seguridad.)"
  },
  {
    "texto1": "Permitir que algo o alguien salga o se libere de un lugar, control o confinamiento.",
    "texto2": "Soltar / Liberar / Dejar ir",
    "texto3": "release",
    "texto4": "The police decided to release the suspect due to lack of evidence. (La policía decidió soltar al sospechoso por falta de pruebas.)"
  },
  {
    "texto1": "Hacer que un producto, una película, un disco, etc., esté disponible para el público.",
    "texto2": "Lanzar / Estrenar / Publicar",
    "texto3": "release",
    "texto4": "The band will release their new album next month. (La banda lanzará su nuevo álbum el próximo mes.)"
  },
  {
    "texto1": "El acto de liberar o dejar salir a alguien o algo.",
    "texto2": "Liberación / Descarga / Soltura",
    "texto3": "release",
    "texto4": "The prisoner's release was celebrated by his family. (La liberación del prisionero fue celebrada por su familia.)"
  },
  {
    "texto1": "Un producto, como una película, un álbum de música o un software, que se ha hecho público.",
    "texto2": "Lanzamiento / Estreno / Publicación",
    "texto3": "release",
    "texto4": "The new movie is a major release for the studio. (La nueva película es un gran lanzamiento para el estudio.)"
  },
  {
    "texto1": "Una autorización formal para hacer algo público o disponible.",
    "texto2": "Autorización / Permiso / Licencia",
    "texto3": "release",
    "texto4": "They signed a press release to announce the event. (Firmaron un comunicado de prensa para anunciar el evento.)"
  },
  {
    "texto1": "Golpear algo o a alguien con fuerza.",
    "texto2": "Golpear / Pegar / Azotar",
    "texto3": "strike",
    "texto4": "The clock began to strike twelve. (El reloj empezó a dar las doce.)"
  },
  {
    "texto1": "Un paro de trabajo organizado por un grupo de empleados para protestar por las condiciones laborales o exigir mejores salarios.",
    "texto2": "Huelga / Paro / Cese de actividades",
    "texto3": "strike",
    "texto4": "The workers decided to go on strike for better pay. (Los trabajadores decidieron ir a la huelga por un mejor sueldo.)"
  },
  {
    "texto1": "Ocurrir a alguien repentinamente, como una idea o una enfermedad.",
    "texto2": "Sobrevenir / Afligir / Acometer",
    "texto3": "strike",
    "texto4": "A sudden illness struck him down. (Una enfermedad repentina lo abatió.)"
  },
  {
    "texto1": "Causar una impresión particular en la mente de alguien.",
    "texto2": "Impresionar / Llamar la atención / Sorprender",
    "texto3": "strike",
    "texto4": "His honesty struck me as unusual. (Su honestidad me pareció inusual.)"
  },
  {
    "texto1": "En béisbol, una pelota lanzada que pasa por la zona de strike y no es bateada, o una pelota que es bateada fuera de juego o fallada.",
    "texto2": "Strike / Bola mala / Ponche",
    "texto3": "strike",
    "texto4": "The batter got two strikes before hitting the ball. (El bateador tuvo dos strikes antes de golpear la pelota.)"
  },
  {
    "texto1": "Un descubrimiento repentino e importante de petróleo, gas o minerales.",
    "texto2": "Hallazgo / Descubrimiento / Yacimiento",
    "texto3": "strike",
    "texto4": "The company announced a major oil strike in the North Sea. (La empresa anunció un importante hallazgo de petróleo en el Mar del Norte.)"
  },
  {
    "texto1": "Desmoronarse o romperse en pedazos pequeños, especialmente algo seco y quebradizo.",
    "texto2": "Desmoronarse / Deshacerse / Fragmentarse",
    "texto3": "crumble",
    "texto4": "The old wall began to crumble with age. (La vieja pared comenzó a desmoronarse con la edad.)"
  },
  {
    "texto1": "Colapsar, desintegrarse o fallar gradualmente.",
    "texto2": "Colapsar / Deteriorarse / Venirse abajo",
    "texto3": "crumble",
    "texto4": "The empire began to crumble from within. (El imperio empezó a colapsar desde dentro.)"
  },
  {
    "texto1": "Un postre de frutas horneado con una cobertura desmenuzada hecha de harina, mantequilla y azúcar.",
    "texto2": "Crumble / Pastel desmenuzado / Postre de frutas",
    "texto3": "crumble",
    "texto4": "My grandmother makes the best apple crumble. (Mi abuela hace el mejor crumble de manzana.)"
  },
  {
    "texto1": "Manipular, tocar o gestionar algo con las manos.",
    "texto2": "Manejar / Tocar / Manipular",
    "texto3": "handle",
    "texto4": "Please handle the delicate items with care. (Por favor, manipule los artículos delicados con cuidado.)"
  },
  {
    "texto1": "Gestionar, controlar o resolver una situación, un problema o a una persona.",
    "texto2": "Gestionar / Ocuparse de / Resolver",
    "texto3": "handle",
    "texto4": "She's good at handling difficult customers. (Ella es buena gestionando clientes difíciles.)"
  },
  {
    "texto1": "La parte de un objeto que está diseñada para ser agarrada o sostenida.",
    "texto2": "Mango / Asa / Manija",
    "texto3": "handle",
    "texto4": "The cup has a comfortable handle. (La taza tiene un mango cómodo.)"
  },
  {
    "texto1": "Un nombre o apodo, especialmente uno utilizado en un sistema de comunicación o en línea.",
    "texto2": "Nombre de usuario / Nick / Alias",
    "texto3": "handle",
    "texto4": "What's your Twitter handle? (¿Cuál es tu nombre de usuario de Twitter?)"
  },
  {
    "texto1": "Comerciar o traficar con bienes específicos, a menudo de forma ilegal.",
    "texto2": "Comerciar / Traficar / Vender",
    "texto3": "handle",
    "texto4": "They were accused of handling stolen goods. (Fueron acusados de traficar con bienes robados.)"
  },
  {
    "texto1": "Considerar que algo es probable que suceda o que alguien llegue o haga algo.",
    "texto2": "Esperar / Prever / Suponer",
    "texto3": "expect",
    "texto4": "I expect him to arrive any moment now. (Espero que llegue en cualquier momento.)"
  },
  {
    "texto1": "Requerir o demandar algo de alguien, especialmente porque se considera un deber o una obligación.",
    "texto2": "Exigir / Requerir / Demandar",
    "texto3": "expect",
    "texto4": "Parents expect their children to be respectful. (Los padres esperan que sus hijos sean respetuosos.)"
  },
  {
    "texto1": "Estar embarazada o a punto de dar a luz.",
    "texto2": "Esperar / Estar encinta / Estar de parto",
    "texto3": "expect",
    "texto4": "They are expecting their first child in October. (Están esperando su primer hijo en octubre.)"
  },
  {
    "texto1": "Creer que algo es cierto o que alguien es de cierta manera.",
    "texto2": "Creer / Suponer / Imaginar",
    "texto3": "expect",
    "texto4": "I expect you're tired after your long journey. (Supongo que estás cansado después de tu largo viaje.)"
  },
  {
    "texto1": "Cubrir o envolver algo con un material flexible.",
    "texto2": "Envolver / Envolver / Cubrir",
    "texto3": "wrap",
    "texto4": "Please wrap the gift in colorful paper. (Por favor, envuelve el regalo en papel de colores.)"
  },
  {
    "texto1": "Un material flexible utilizado para envolver o cubrir algo.",
    "texto2": "Envoltura / Envoltorio / Cubierta",
    "texto3": "wrap",
    "texto4": "The plastic wrap keeps the food fresh. (El envoltorio de plástico mantiene la comida fresca.)"
  },
  {
    "texto1": "Terminar o completar una actividad, un proyecto o un evento.",
    "texto2": "Finalizar / Concluir / Terminar",
    "texto3": "wrap",
    "texto4": "We need to wrap up the meeting soon. (Necesitamos terminar la reunión pronto.)"
  },
  {
    "texto1": "Rodear o abrazar con los brazos o con algo flexible.",
    "texto2": "Rodear / Abrazar / Ceñir",
    "texto3": "wrap",
    "texto4": "She wrapped her arms around her child. (Ella rodeó a su hijo con los brazos.)"
  },
  {
    "texto1": "Un trozo de metal delgado y flexible, a menudo cilíndrico, que se usa para conducir electricidad o transmitir señales, o como parte de una estructura.",
    "texto2": "Cable / Alambre / Conductor",
    "texto3": "wire",
    "texto4": "The electrician checked all the wires in the house. (El electricista revisó todos los cables de la casa.)"
  },
  {
    "texto1": "Un sistema de cables que se utiliza para transmitir información, como un telégrafo o un sistema telefónico.",
    "texto2": "Cableado / Red de cables / Sistema de comunicación",
    "texto3": "wire",
    "texto4": "The news came over the wire early this morning. (La noticia llegó por el cableado a primera hora de esta mañana.)"
  },
  {
    "texto1": "Conectar un aparato o sistema eléctrico con cables.",
    "texto2": "Cablear / Conectar / Instalar",
    "texto3": "wire",
    "texto4": "You need to wire the new speakers to the amplifier. (Necesitas cablear los nuevos altavoces al amplificador.)"
  },
  {
    "texto1": "Enviar dinero electrónicamente a través de una red bancaria.",
    "texto2": "Transferir (dinero) / Enviar por transferencia / Girar",
    "texto3": "wire",
    "texto4": "I'll wire the money to your account tomorrow. (Te transferiré el dinero a tu cuenta mañana.)"
  },
  {
    "texto1": "Las cuerdas tensas utilizadas para manipular marionetas o para un acto de equilibrismo.",
    "texto2": "Cuerdas / Hilos / Cables (de títeres)",
    "texto3": "wires",
    "texto4": "The puppeteer skillfully controlled the puppet with its wires. (El titiritero controlaba hábilmente la marioneta con sus hilos.)"
  },
  {
    "texto1": "Un conjunto de chaqueta y pantalones, o chaqueta y falda, hechos del mismo tejido y para ser usados juntos.",
    "texto2": "Traje / Terno / Conjunto",
    "texto3": "suit",
    "texto4": "He wore a smart business suit to the interview. (Llevaba un elegante traje de negocios para la entrevista.)"
  },
  {
    "texto1": "Ser adecuado o conveniente para una persona o situación.",
    "texto2": "Convenir / Sentar bien / Ser adecuado",
    "texto3": "suit",
    "texto4": "That color doesn't really suit her. (Ese color no le sienta muy bien.)"
  },
  {
    "texto1": "Una acción legal o demanda presentada en un tribunal.",
    "texto2": "Demanda / Pleito / Litigio",
    "texto3": "suit",
    "texto4": "The company filed a lawsuit for breach of contract. (La empresa presentó una demanda por incumplimiento de contrato.)"
  },
  {
    "texto1": "Un conjunto de ropa especial para un propósito particular, como un traje de baño o un traje espacial.",
    "texto2": "Traje / Indumentaria / Equipo",
    "texto3": "suit",
    "texto4": "Astronauts wear a special suit for space travel. (Los astronautas usan un traje especial para los viajes espaciales.)"
  },
  {
    "texto1": "Agradar o satisfacer a alguien.",
    "texto2": "Agradar / Satisfacer / Complacer",
    "texto3": "suit",
    "texto4": "Whatever suits you is fine with me. (Lo que te agrade está bien para mí.)"
  },
  {
    "texto1": "Emitir un olor muy fuerte y desagradable.",
    "texto2": "Apestar / Heder / Oler mal",
    "texto3": "stink",
    "texto4": "The garbage in the alley began to stink. (La basura en el callejón empezó a apestar.)"
  },
  {
    "texto1": "Tener una reputación muy mala o ser de muy mala calidad.",
    "texto2": "Ser un asco / Ser una porquería / Dejar mucho que desear",
    "texto3": "stink",
    "texto4": "That movie really stinks; I wouldn't recommend it. (Esa película es un asco; no la recomendaría.)"
  },
  {
    "texto1": "Un olor fuerte y desagradable.",
    "texto2": "Hedor / Fetidez / Pestilencia",
    "texto3": "stink",
    "texto4": "There's a terrible stink coming from the drains. (Hay un hedor terrible que viene de los desagües.)"
  },
  {
    "texto1": "Una situación o un asunto que es muy malo o desagradable.",
    "texto2": "Problema / Asunto desagradable / Lío",
    "texto3": "stink",
    "texto4": "The whole situation created a big stink in the office. (Toda la situación creó un gran problema en la oficina.)"
  },
  {
    "texto1": "Una cualidad o rasgo distintivo de una persona, un animal o una cosa.",
    "texto2": "Característica / Rasgo / Cualidad",
    "texto3": "characteristic",
    "texto4": "One of his main characteristics is his honesty. (Una de sus principales características es su honestidad.)"
  },
  {
    "texto1": "Algo que es típico o peculiar de una persona, cosa o grupo.",
    "texto2": "Típico / Peculiar / Propio",
    "texto3": "characteristic",
    "texto4": "The painting has the characteristic style of the artist. (La pintura tiene el estilo característico del artista.)"
  },
  {
    "texto1": "Recibir o tomar algo que se ofrece, se da o se envía, especialmente de buena gana.",
    "texto2": "Aceptar / Recibir / Admitir",
    "texto3": "accept",
    "texto4": "She decided to accept the job offer. (Ella decidió aceptar la oferta de trabajo.)"
  },
  {
    "texto1": "Creer o reconocer que algo es verdadero, válido o correcto.",
    "texto2": "Aceptar / Creer / Reconocer",
    "texto3": "accept",
    "texto4": "It's difficult for him to accept constructive criticism. (Le resulta difícil aceptar las críticas constructivas.)"
  },
  {
    "texto1": "Soportar o tolerar una situación o circunstancia sin oponer resistencia o quejarse.",
    "texto2": "Aceptar / Resignarse / Conformarse",
    "texto3": "accept",
    "texto4": "You have to accept the consequences of your actions. (Tienes que aceptar las consecuencias de tus acciones.)"
  },
  {
    "texto1": "Admitir a alguien en un grupo, una institución o un programa.",
    "texto2": "Admitir / Aceptar / Recibir",
    "texto3": "accept",
    "texto4": "The university accepted her application. (La universidad aceptó su solicitud.)"
  },
  {
    "texto1": "Excluyendo; con la excepción de.",
    "texto2": "Excepto / Salvo / A excepción de",
    "texto3": "except",
    "texto4": "Everyone went to the party except for John. (Todos fueron a la fiesta excepto John.)"
  },
  {
    "texto1": "A menos que; si no.",
    "texto2": "A menos que / Si no / Sino",
    "texto3": "except",
    "texto4": "I won't go out except if it stops raining. (No saldré a menos que deje de llover.)"
  },
  {
    "texto1": "Objetar o estar en desacuerdo con algo.",
    "texto2": "Objetar / Disentir / Oponerse",
    "texto3": "except",
    "texto4": "He excepted to the unfair terms of the contract. (Objetó los términos injustos del contrato.)"
  }
]
