[
  {
    "texto1": "Algo o alguien que es socialmente torpe, poco a la moda o un poco tonto, a menudo de una manera entrañable.",
    "texto2": "Bobo / Tonto / Patoso / Torpe / Nerdo",
    "texto3": "dorky",
    "texto4": "dorkier / dorkiest (comparative/superlative for describing things or people as more/most dorky); will be dorky (future)",
    "texto5": "He wore a dorky hat to the party, but he still looked cute.",
    "texto6": "Llevaba un sombrero bobo a la fiesta, pero aun así se veía lindo."
  },
  {
    "texto1": "Mantenerse firme, equilibrado y sin cambios en su posición o estado.",
    "texto2": "Firme / Estable / Constante / Equilibrado",
    "texto3": "steady",
    "texto4": "steadied / will steady",
    "texto5": "Hold the camera steady to get a clear shot.",
    "texto6": "Sostén la cámara firme para obtener una toma clara."
  },
  {
    "texto1": "Algo que no cambia de intensidad, velocidad o cantidad; uniforme.",
    "texto2": "Constante / Regular / Uniforme / Continuo",
    "texto3": "steady",
    "texto4": "steadied / will steady",
    "texto5": "The car maintained a steady speed on the highway.",
    "texto6": "El coche mantuvo una velocidad constante en la autopista."
  },
  {
    "texto1": "Una persona que es confiable, responsable y sensata.",
    "texto2": "Serio / Formal / Responsable / Confiable",
    "texto3": "steady",
    "texto4": "steadied / will steady",
    "texto5": "He's a steady worker, always gets the job done.",
    "texto6": "Es un trabajador serio, siempre termina el trabajo."
  },
  {
    "texto1": "Una dirección general en la que algo se está desarrollando o cambiando; una forma de comportarse, proceder, etc., que se está volviendo más común o popular.",
    "texto2": "Tendencia / Dirección / Movimiento / Inclinación",
    "texto3": "trend",
    "texto4": "trended / will trend",
    "texto5": "The latest trend in technology is artificial intelligence.",
    "texto6": "La última tendencia en tecnología es la inteligencia artificial."
  },
  {
    "texto1": "Algo que es actualmente popular o de moda, especialmente en la industria de la moda, el entretenimiento o el comportamiento social.",
    "texto2": "Moda / Voga / Estilo / Corriente",
    "texto3": "trend",
    "texto4": "trended / will trend",
    "texto5": "Bright colors are a big trend this season.",
    "texto6": "Los colores brillantes son una gran tendencia esta temporada."
  },
  {
    "texto1": "En redes sociales o plataformas de noticias, un tema, palabra o nombre que está siendo mencionado con mayor frecuencia en un momento particular.",
    "texto2": "Tendencia / Trending topic",
    "texto3": "trend",
    "texto4": "trended / will trend",
    "texto5": "The hashtag started to trend on Twitter after the announcement.",
    "texto6": "El hashtag empezó a ser tendencia en Twitter después del anuncio."
  },
  {
    "texto1": "Una comprensión profunda y clara de una situación o problema complejo.",
    "texto2": "Conocimiento / Comprensión / Perspicacia / Revelación",
    "texto3": "insight",
    "texto4": "insights (plural) / gained insight (past) / will gain insight (future)",
    "texto5": "The report provided valuable insights into consumer behavior.",
    "texto6": "El informe proporcionó conocimientos valiosos sobre el comportamiento del consumidor."
  },
  {
    "texto1": "La capacidad de obtener una comprensión precisa e intuitiva de una persona o cosa.",
    "texto2": "Clarividencia / Intuición / Percepción / Agudeza",
    "texto3": "insight",
    "texto4": "insights (plural) / gained insight (past) / will gain insight (future)",
    "texto5": "Her unique insight allowed her to solve the difficult problem quickly.",
    "texto6": "Su percepción única le permitió resolver el problema difícil rápidamente."
  },
  {
    "texto1": "Un pequeño fragmento, pieza o parte de algo, especialmente de información o código.",
    "texto2": "Fragmento / Pedazo / Trozo / Retazo",
    "texto3": "snippet",
    "texto4": "snippets (plural)",
    "texto5": "Could you send me a small snippet of the code?",
    "texto6": "Me podrías enviar un pequeño fragmento del código?"
  },
  {
    "texto1": "Una breve porción de una conversación, una canción, un video u otra forma de contenido.",
    "texto2": "Extracto / Recorte / Muestra / Clip",
    "texto3": "snippet",
    "texto4": "snippets (plural)",
    "texto5": "I heard a snippet of their new song on the radio.",
    "texto6": "Escuché un extracto de su nueva canción en la radio."
  },
  {
    "texto1": "Juntar o recolectar cosas o personas de diferentes lugares.",
    "texto2": "Reunir / Recoger / Acumular / Agrupar",
    "texto3": "gather",
    "texto4": "gathered / will gather",
    "texto5": "We need to gather all the documents for the meeting.",
    "texto6": "Necesitamos reunir todos los documentos para la reunión."
  },
  {
    "texto1": "Formar una opinión o conclusión a partir de la información disponible.",
    "texto2": "Deducir / Concluir / Inferir / Comprender",
    "texto3": "gather",
    "texto4": "gathered / will gather",
    "texto5": "From what he said, I gather he's not happy with the decision.",
    "texto6": "Por lo que dijo, deduzco que no está contento con la decisión."
  },
  {
    "texto1": "Acercarse o juntarse en un grupo.",
    "texto2": "Juntarse / Congregar / Agruparse / Reunirse",
    "texto3": "gather",
    "texto4": "gathered / will gather",
    "texto5": "The crowd began to gather outside the stadium.",
    "texto6": "La multitud comenzó a juntarse afuera del estadio."
  },
  {
    "texto1": "Ocupar o atraer la atención, el interés o las emociones de alguien.",
    "texto2": "Atraer / Cautivar / Fascinar / Interesar",
    "texto3": "engage",
    "texto4": "engaged / will engage",
    "texto5": "The speaker's story really engaged the audience.",
    "texto6": "La historia del orador realmente atrajo a la audiencia."
  },
  {
    "texto1": "Participar o involucrarse en una actividad, conversación o proceso.",
    "texto2": "Participar / Involucrarse / Comprometerse / Entablar",
    "texto3": "engage",
    "texto4": "engaged / will engage",
    "texto5": "It's important to engage in regular physical activity.",
    "texto6": "Es importante participar en actividad física regular."
  },
  {
    "texto1": "Hacer que algo (como un mecanismo o sistema) encaje o se conecte para funcionar.",
    "texto2": "Acoplar / Conectar / Engranar / Poner en marcha",
    "texto3": "engage",
    "texto4": "engaged / will engage",
    "texto5": "Make sure the gears engage properly before starting the machine.",
    "texto6": "Asegúrate de que los engranajes se acoplen correctamente antes de encender la máquina."
  },
  {
    "texto1": "Comenzar una batalla o enfrentamiento con un oponente.",
    "texto2": "Enfrentar / Entrar en combate / Luchar contra",
    "texto3": "engage",
    "texto4": "engaged / will engage",
    "texto5": "The troops were ordered to engage the enemy.",
    "texto6": "Las tropas recibieron la orden de enfrentar al enemigo."
  },
  {
    "texto1": "Convertir información o datos a un formato diferente, especialmente para su transmisión, almacenamiento o procesamiento por un sistema informático o electrónico.",
    "texto2": "Codificar / Cifrar / Encriptar / Transcribir",
    "texto3": "encode",
    "texto4": "encoded / will encode",
    "texto5": "The software will encode the video file into a smaller format.",
    "texto6": "El software codificará el archivo de video a un formato más pequeño."
  },
  {
    "texto1": "Convertir un mensaje o señal en un código o lenguaje secreto para ocultar su significado.",
    "texto2": "Cifrar / Encriptar / Codificar (en secreto)",
    "texto3": "encode",
    "texto4": "encoded / will encode",
    "texto5": "The spies encoded their messages to prevent them from being intercepted.",
    "texto6": "Los espías cifraron sus mensajes para evitar que fueran interceptados."
  },
  {
    "texto1": "Formar una memoria en el cerebro; convertir información sensorial en una forma que pueda ser almacenada y recuperada.",
    "texto2": "Grabar (en la memoria) / Fijar / Registrar",
    "texto3": "encode",
    "texto4": "encoded / will encode",
    "texto5": "Our brains encode new experiences into long-term memories.",
    "texto6": "Nuestros cerebros graban nuevas experiencias en memorias a largo plazo."
  },
  {
    "texto1": "Un conjunto de equipos o indumentaria que se usa para un propósito particular.",
    "texto2": "Equipo / Indumentaria / Atuendo / Material",
    "texto3": "gear",
    "texto4": "geared (as in 'geared up' - to prepare with gear); will gear (as in 'will gear up')",
    "texto5": "Don't forget to pack your hiking gear for the trip.",
    "texto6": "No olvides empacar tu equipo de senderismo para el viaje."
  },
  {
    "texto1": "Un mecanismo con dientes, como una rueda o cilindro, que engrana con otro para transmitir o cambiar el movimiento o la potencia.",
    "texto2": "Engranaje / Piñón / Rueda dentada",
    "texto3": "gear",
    "texto4": "geared (as in 'geared to' - designed or adjusted for a particular purpose); will gear",
    "texto5": "The car's transmission uses several gears to change speed.",
    "texto6": "La transmisión del coche usa varios engranajes para cambiar la velocidad."
  },
  {
    "texto1": "La ropa o atuendo que se usa para protegerse o para realizar una actividad específica.",
    "texto2": "Ropa / Vestimenta / Equipo de protección",
    "texto3": "gear",
    "texto4": "geared (as in 'geared up' for an event); will gear (as in 'will gear up' for something)",
    "texto5": "The firefighters put on their protective gear before entering the building.",
    "texto6": "Los bomberos se pusieron su equipo de protección antes de entrar al edificio."
  },
  {
    "texto1": "Declarar o afirmar que algo es verdadero o que uno tiene derecho a algo.",
    "texto2": "Afirmar / Declarar / Sostener / Reclamar / Alegar",
    "texto3": "claim",
    "texto4": "claimed / will claim",
    "texto5": "She claims to be the rightful owner of the property.",
    "texto6": "Ella afirma ser la legítima dueña de la propiedad."
  },
  {
    "texto1": "Pedir oficialmente una cantidad de dinero a una organización porque se tiene derecho a ella.",
    "texto2": "Reclamar / Solicitar / Demandar / Pedir una indemnización",
    "texto3": "claim",
    "texto4": "claimed / will claim",
    "texto5": "You can claim expenses for your business trip.",
    "texto6": "Puedes reclamar los gastos de tu viaje de negocios."
  },
  {
    "texto1": "Un derecho legal a algo; una demanda o petición formal de algo.",
    "texto2": "Reclamo / Demanda / Derecho / Petición",
    "texto3": "claim",
    "texto4": "claims (plural)",
    "texto5": "The insurance company denied his claim for damages.",
    "texto6": "La compañía de seguros denegó su reclamo por daños."
  },
  {
    "texto1": "Una afirmación que se hace sin prueba, que puede ser discutible o no.",
    "texto2": "Aserción / Afirmación / Alegación / Proposición",
    "texto3": "claim",
    "texto4": "claims (plural)",
    "texto5": "His claim that he never received the letter was false.",
    "texto6": "Su afirmación de que nunca recibió la carta era falsa."
  },
  {
    "texto1": "Pasar la lengua por algo o sobre algo.",
    "texto2": "Lamer / Relamer / Chupar",
    "texto3": "lick",
    "texto4": "licked / will lick",
    "texto5": "The dog licked the ice cream cone.",
    "texto6": "El perro lamió el cono de helado."
  },
  {
    "texto1": "Tocar o moverse sobre una superficie suavemente y por un breve tiempo.",
    "texto2": "Rozar / Tocar / Besar",
    "texto3": "lick",
    "texto4": "licked / will lick",
    "texto5": "Flames began to lick the dry wood.",
    "texto6": "Las llamas comenzaron a rozar la madera seca."
  },
  {
    "texto1": "Derrotar o vencer a alguien con facilidad.",
    "texto2": "Vencer / Derrotar / Ganar (fácilmente)",
    "texto3": "lick",
    "texto4": "licked / will lick",
    "texto5": "Our team licked the competition in the final game.",
    "texto6": "Nuestro equipo venció fácilmente a la competencia en el juego final."
  },
  {
    "texto1": "Mirar de forma rápida o furtiva, a menudo a través de una abertura o desde un escondite.",
    "texto2": "Echar un vistazo / Ojeada / Fisgonear / Atisbar",
    "texto3": "peek",
    "texto4": "peeked / will peek",
    "texto5": "She peeked through the curtains to see who was at the door.",
    "texto6": "Ella echó un vistazo a través de las cortinas para ver quién estaba en la puerta."
  },
  {
    "texto1": "Una mirada rápida y breve.",
    "texto2": "Vistazo / Ojeada / Atisbo / Mirada fugaz",
    "texto3": "peek",
    "texto4": "peeks (plural)",
    "texto5": "I took a quick peek at the test answers.",
    "texto6": "Le eché un vistazo rápido a las respuestas del examen."
  },
  {
    "texto1": "El punto más alto de una montaña o colina.",
    "texto2": "Cima / Pico / Cúspide / Cumbre",
    "texto3": "peak",
    "texto4": "peaked / will peak",
    "texto5": "They reached the peak of the mountain after a long climb.",
    "texto6": "Alcanzaron la cima de la montaña después de una larga subida."
  },
  {
    "texto1": "El punto más alto de actividad, rendimiento o intensidad.",
    "texto2": "Punto máximo / Auge / Apogeo / Cénit",
    "texto3": "peak",
    "texto4": "peaked / will peak",
    "texto5": "The singer's career reached its peak in the 1990s.",
    "texto6": "La carrera del cantante alcanzó su punto máximo en los años 90."
  },
  {
    "texto1": "Alcanzar el punto más alto de algo, como una actividad, un rendimiento o una intensidad.",
    "texto2": "Alcanzar el máximo / Llegar al punto álgido / Tocar techo",
    "texto3": "peak",
    "texto4": "peaked / will peak",
    "texto5": "Traffic usually peaks between 5 and 6 PM.",
    "texto6": "El tráfico suele alcanzar su máximo entre las 5 y las 6 de la tarde."
  },
  {
    "texto1": "Una ventaja o beneficio adicional que se recibe por un trabajo o posición.",
    "texto2": "Beneficio / Ventaja / Prebenda / Gaje",
    "texto3": "perk",
    "texto4": "perks (plural)",
    "texto5": "Free coffee and snacks are a nice perk of the job.",
    "texto6": "Café y aperitivos gratis son un buen beneficio del trabajo."
  },
  {
    "texto1": "La acción de animarse o levantar la cabeza rápidamente, a menudo con interés o curiosidad.",
    "texto2": "Levantar / Animar / Espabilarse / Avivar",
    "texto3": "perk",
    "texto4": "perked / will perk",
    "texto5": "The dog's ears perked up when it heard a noise.",
    "texto6": "Las orejas del perro se levantaron cuando escuchó un ruido."
  },
  {
    "texto1": "Revitalizar o mejorar el ánimo de alguien; hacer que alguien se sienta más animado o enérgico.",
    "texto2": "Animar / Reavivar / Vigorizar / Tonificar",
    "texto3": "perk",
    "texto4": "perked / will perk",
    "texto5": "A strong cup of coffee can really perk you up in the morning.",
    "texto6": "Una taza de café fuerte realmente te puede animar por la mañana."
  },
  {
    "texto1": "Sentirse seguro de uno mismo o de sus habilidades; creer firmemente en algo.",
    "texto2": "Seguro / Confiado / Firme / Persuadido",
    "texto3": "confident",
    "texto4": "more confident / most confident (comparative/superlative); felt confident (past); will be confident (future)",
    "texto5": "She felt confident about her presentation after rehearsing it multiple times.",
    "texto6": "Se sentía segura de su presentación después de ensayarla varias veces."
  },
  {
    "texto1": "Estar seguro de que algo sucederá o es verdad.",
    "texto2": "Seguro / Convencido / Certero / Con la certeza",
    "texto3": "confident",
    "texto4": "more confident / most confident (comparative/superlative); felt confident (past); will be confident (future)",
    "texto5": "I am confident that we will find a solution to this problem.",
    "texto6": "Estoy seguro de que encontraremos una solución a este problema."
  },
  {
    "texto1": "Una respuesta a una pregunta, problema o solicitud.",
    "texto2": "Respuesta / Solución / Contestación / Réplica",
    "texto3": "answer",
    "texto4": "answered / will answer",
    "texto5": "Please write your answer on a separate sheet of paper.",
    "texto6": "Por favor, escribe tu respuesta en una hoja de papel aparte."
  },
  {
    "texto1": "Responder a una pregunta, resolver un problema o cumplir con una solicitud.",
    "texto2": "Responder / Contestar / Solucionar / Resolver",
    "texto3": "answer",
    "texto4": "answered / will answer",
    "texto5": "I will answer your question after the presentation.",
    "texto6": "Responderé a tu pregunta después de la presentación."
  },
  {
    "texto1": "El resultado o la solución de un problema matemático o un enigma.",
    "texto2": "Resultado / Solución / Clave / Desenlace",
    "texto3": "answer",
    "texto4": "answered / will answer",
    "texto5": "The correct answer to the riddle was 'a secret'.",
    "texto6": "La respuesta correcta al acertijo era 'un secreto'."
  },
  {
    "texto1": "Llevar a cabo, ejecutar o realizar una acción, tarea o función.",
    "texto2": "Realizar / Ejecutar / Llevar a cabo / Cumplir",
    "texto3": "perform",
    "texto4": "performed / will perform",
    "texto5": "The surgeon will perform a complex operation tomorrow.",
    "texto6": "El cirujano realizará una operación compleja mañana."
  },
  {
    "texto1": "Actuar, cantar, bailar u ofrecer un espectáculo para el entretenimiento de una audiencia.",
    "texto2": "Actuar / Representar / Presentar / Entretener",
    "texto3": "perform",
    "texto4": "performed / will perform",
    "texto5": "The band will perform live at the festival next month.",
    "texto6": "La banda actuará en vivo en el festival el próximo mes."
  },
  {
    "texto1": "Funcionar o comportarse de una manera específica o con una cierta eficiencia.",
    "texto2": "Funcionar / Rendir / Trabajar / Desempeñarse",
    "texto3": "perform",
    "texto4": "performed / will perform",
    "texto5": "The new engine performs much better than the old one.",
    "texto6": "El nuevo motor funciona mucho mejor que el anterior."
  },
  {
    "texto1": "El proceso de convertir información en un código para evitar el acceso no autorizado, especialmente durante la transmisión o el almacenamiento.",
    "texto2": "Cifrado / Codificación / Encriptación",
    "texto3": "encryption",
    "texto4": "encrypted (past tense of the verb 'to encrypt') / will encrypt (future tense of the verb 'to encrypt')",
    "texto5": "Strong encryption is essential for protecting sensitive data online.",
    "texto6": "Un cifrado fuerte es esencial para proteger los datos sensibles en línea."
  },
  {
    "texto1": "La técnica de transformar datos de su forma original legible (texto plano) a una forma ilegible (texto cifrado) utilizando un algoritmo y una clave, de modo que solo las partes autorizadas puedan descifrarla.",
    "texto2": "Cifrado de datos / Criptografía / Encriptación de información",
    "texto3": "encryption",
    "texto4": "encrypted (past tense of the verb 'to encrypt') / will encrypt (future tense of the verb 'to encrypt')",
    "texto5": "End-to-end encryption ensures that only the sender and intended recipient can read the messages.",
    "texto6": "El cifrado de extremo a extremo asegura que solo el remitente y el destinatario previsto puedan leer los mensajes."
  },
  {
    "texto1": "Un propósito o papel natural para el que una persona o cosa está diseñada o empleada.",
    "texto2": "Función / Propósito / Rol / cometido",
    "texto3": "function",
    "texto4": "functioned / will function",
    "texto5": "The main function of the heart is to pump blood.",
    "texto6": "La función principal del corazón es bombear sangre."
  },
  {
    "texto1": "Una actividad o propósito para el cual algo existe o es utilizado.",
    "texto2": "Actividad / Operación / Tarea / Uso",
    "texto3": "function",
    "texto4": "functioned / will function",
    "texto5": "The new machine performs its function perfectly.",
    "texto6": "La nueva máquina realiza su función perfectamente."
  },
  {
    "texto1": "En informática, un bloque de código diseñado para realizar una tarea específica y que puede ser llamado y reutilizado dentro de un programa.",
    "texto2": "Función / Subrutina / Procedimiento",
    "texto3": "function",
    "texto4": "functioned / will function",
    "texto5": "This function calculates the total sum of the numbers in the list.",
    "texto6": "Esta función calcula la suma total de los números en la lista."
  },
  {
    "texto1": "Trabajar o funcionar de una manera particular.",
    "texto2": "Funcionar / Operar / Servir",
    "texto3": "function",
    "texto4": "functioned / will function",
    "texto5": "The old car still functions well despite its age.",
    "texto6": "El coche viejo todavía funciona bien a pesar de su edad."
  },
  {
    "texto1": "Un algoritmo o función matemática que transforma datos de un tamaño arbitrario en un valor de tamaño fijo, usualmente para fines de seguridad, indexación o verificación de integridad.",
    "texto2": "Función hash / Resumen criptográfico / Algoritmo de dispersión / Código hash",
    "texto3": "hash",
    "texto4": "hashed / will hash",
    "texto5": "The system uses a hash function to secure user passwords.",
    "texto6": "El sistema utiliza una función hash para proteger las contraseñas de los usuarios."
  },
  {
    "texto1": "Los datos resultantes de aplicar una función hash; una cadena de caracteres alfanuméricos de longitud fija que representa los datos originales.",
    "texto2": "Hash / Valor hash / Código de dispersión / Suma de verificación",
    "texto3": "hash",
    "texto4": "hashes (plural)",
    "texto5": "Even a small change in the file will result in a completely different hash.",
    "texto6": "Incluso un pequeño cambio en el archivo resultará en un hash completamente diferente."
  },
  {
    "texto1": "Cortar algo en trozos pequeños, especialmente comida, y luego mezclarlo.",
    "texto2": "Picar / Trocear / Mezclar / Rebanar",
    "texto3": "hash",
    "texto4": "hashed / will hash",
    "texto5": "She hashed the potatoes and onions for breakfast.",
    "texto6": "Ella picó las patatas y las cebollas para el desayuno."
  },
  {
    "texto1": "Hacer un desorden o desastre de algo; confundir o estropear.",
    "texto2": "Estropear / Enredar / Desordenar / Confundir",
    "texto3": "hash",
    "texto4": "hashed / will hash",
    "texto5": "He really hashed up the presentation with all the mistakes.",
    "texto6": "Realmente estropeó la presentación con todos los errores."
  },
  {
    "texto1": "Un sistema de principios de razonamiento utilizado para sacar conclusiones válidas y correctas.",
    "texto2": "Razón / Razonamiento / Coherencia / Sentido común",
    "texto3": "logic",
    "texto4": "logics (plural, en contextos específicos como 'lógicas modales'); has logic (past); will have logic (future)",
    "texto5": "The lawyer's argument was based on sound logic and evidence.",
    "texto6": "El argumento del abogado se basó en una lógica y evidencia sólidas."
  },
  {
    "texto1": "La forma en que se estructura algo o la secuencia de eventos que tienen sentido o siguen un orden natural.",
    "texto2": "Estructura / Secuencia / Hilo / Conexión",
    "texto3": "logic",
    "texto4": "logics (plural, en contextos específicos); had a logic (past); will have a logic (future)",
    "texto5": "There's a certain logic to how the universe works.",
    "texto6": "Hay una cierta lógica en cómo funciona el universo."
  },
  {
    "texto1": "En informática y electrónica, la disposición de los componentes o el diseño de un sistema para realizar una función específica de manera predeterminada.",
    "texto2": "Lógica (de programación) / Diseño lógico / Circuito lógico",
    "texto3": "logic",
    "texto4": "logics (plural, en contextos de tipos de lógica); implemented logic (past); will implement logic (future)",
    "texto5": "The programmer designed the game's core logic before writing the code.",
    "texto6": "El programador diseñó la lógica central del juego antes de escribir el código."
  },
  {
    "texto1": "Un área de almacenamiento temporal de datos que permite un acceso rápido a la información utilizada con frecuencia, mejorando así el rendimiento.",
    "texto2": "Caché / Memoria caché / Almacenamiento temporal",
    "texto3": "cache",
    "texto4": "cached / will cache",
    "texto5": "Web browsers use a cache to store images and files from websites, making them load faster on subsequent visits.",
    "texto6": "Los navegadores web usan una caché para almacenar imágenes y archivos de sitios web, haciendo que carguen más rápido en visitas posteriores."
  },
  {
    "texto1": "Un escondite de objetos valiosos o provisiones; un alijo.",
    "texto2": "Escondite / Alijo / Depósito / Provisión secreta",
    "texto3": "cache",
    "texto4": "cached / will cache",
    "texto5": "The explorer discovered a hidden cache of ancient artifacts in the cave.",
    "texto6": "El explorador descubrió un escondite oculto de artefactos antiguos en la cueva."
  },
  {
    "texto1": "Almacenar datos en una caché para un acceso más rápido en el futuro.",
    "texto2": "Guardar en caché / Almacenar temporalmente / Cachear",
    "texto3": "cache",
    "texto4": "cached / will cache",
    "texto5": "The server will cache the most frequently requested data to reduce load times.",
    "texto6": "El servidor guardará en caché los datos más solicitados para reducir los tiempos de carga."
  },
  {
    "texto1": "Un punto de entrada para la comunicación entre dos sistemas, especialmente en redes informáticas o APIs, donde se realizan solicitudes y se envían respuestas.",
    "texto2": "Punto final / Punto de acceso / URL de API / Interfaz",
    "texto3": "endpoint",
    "texto4": "endpoints (plural)",
    "texto5": "To get user data, you need to send a request to the `/users` endpoint of the API.",
    "texto6": "Para obtener datos de usuario, debes enviar una solicitud al 'endpoint' `/users` de la API."
  },
  {
    "texto1": "El final o la conclusión de un proceso, viaje o actividad.",
    "texto2": "Punto final / Fin / Conclusión / Destino",
    "texto3": "endpoint",
    "texto4": "endpoints (plural)",
    "texto5": "The journey from the source to the endpoint was long and arduous.",
    "texto6": "El viaje desde el origen hasta el punto final fue largo y arduo."
  },
  {
    "texto1": "Un texto escrito que contiene las palabras de un discurso, obra de teatro, película o programa de televisión.",
    "texto2": "Guion / Libreto / Texto",
    "texto3": "script",
    "texto4": "scripted / will script",
    "texto5": "The actors are rehearsing their lines from the new movie script.",
    "texto6": "Los actores están ensayando sus líneas del guion de la nueva película."
  },
  {
    "texto1": "Un archivo de computadora que contiene una secuencia de comandos o instrucciones que un programa o sistema operativo puede ejecutar.",
    "texto2": "Script / Programa / Rutina / Código",
    "texto3": "script",
    "texto4": "scripted / will script",
    "texto5": "I wrote a Python script to automate the data processing.",
    "texto6": "Escribí un script de Python para automatizar el procesamiento de datos."
  },
  {
    "texto1": "La escritura a mano de una persona, especialmente en términos de caligrafía.",
    "texto2": "Escritura / Caligrafía / Manuscrito / Letra",
    "texto3": "script",
    "texto4": "scripts (plural)",
    "texto5": "Her elegant script was difficult to read for those unfamiliar with it.",
    "texto6": "Su elegante escritura era difícil de leer para aquellos no familiarizados con ella."
  },
  {
    "texto1": "Un plan detallado para una acción o serie de acciones; una rutina predecible o establecida.",
    "texto2": "Guion / Patrón / Rutina / Procedimiento",
    "texto3": "script",
    "texto4": "scripted / will script",
    "texto5": "The protest followed a predictable script of speeches and marches.",
    "texto6": "La protesta siguió un guion predecible de discursos y marchas."
  },
  {
    "texto1": "La secuencia de operaciones o tareas que se realizan para completar un proceso, especialmente en el ámbito empresarial o tecnológico.",
    "texto2": "Flujo de trabajo / Proceso / Cadena de tareas / Procedimiento",
    "texto3": "workflow",
    "texto4": "workflows (plural)",
    "texto5": "The new software streamlines our entire sales workflow, from lead generation to closing the deal.",
    "texto6": "El nuevo software optimiza todo nuestro flujo de trabajo de ventas, desde la generación de clientes potenciales hasta el cierre del trato."
  },
  {
    "texto1": "Un conjunto de pasos o actividades coordinadas y repetibles que se siguen para lograr un objetivo específico.",
    "texto2": "Metodología / Sistema / Ruta / Esquem",
    "texto3": "workflow",
    "texto4": "workflows (plural)",
    "texto5": "Automating this workflow will save us a lot of time and reduce errors.",
    "texto6": "Automatizar este flujo de trabajo nos ahorrará mucho tiempo y reducirá errores."
  },
  {
    "texto1": "Un camino, forma o diseño circular o que regresa sobre sí mismo.",
    "texto2": "Bucle / Lazo / Aro / Ciclo",
    "texto3": "loop",
    "texto4": "looped / will loop",
    "texto5": "The road forms a loop around the lake.",
    "texto6": "La carretera forma un bucle alrededor del lago."
  },
  {
    "texto1": "En programación, una secuencia de instrucciones que se repite un número determinado de veces o hasta que se cumple una condición específica.",
    "texto2": "Bucle / Ciclo / Iteración",
    "texto3": "loop",
    "texto4": "looped / will loop",
    "texto5": "The program entered an infinite loop, causing it to crash.",
    "texto6": "El programa entró en un bucle infinito, provocando su caída."
  },
  {
    "texto1": "Hacer que algo se doble, se curve o se enrolle para formar un bucle.",
    "texto2": "Enlazar / Enlazar / Enredar / Doblar",
    "texto3": "loop",
    "texto4": "looped / will loop",
    "texto5": "She looped the rope around the post to secure it.",
    "texto6": "Ella enlazó la cuerda alrededor del poste para asegurarla."
  },
  {
    "texto1": "Repetir una acción o una secuencia de sonido o video continuamente.",
    "texto2": "Repetir / Reproducir en bucle / Reiterar",
    "texto3": "loop",
    "texto4": "looped / will loop",
    "texto5": "The song will loop automatically when it finishes.",
    "texto6": "La canción se repetirá automáticamente cuando termine."
  },
  {
    "texto1": "Durante el tiempo que algo está sucediendo; al mismo tiempo que.",
    "texto2": "Mientras / Durante / Al mismo tiempo que",
    "texto3": "while",
    "texto4": "was/were while (past continuous, e.g., 'I was working while he was sleeping') / will be while (future continuous)",
    "texto5": "While I was studying, my brother was watching TV.",
    "texto6": "Mientras yo estaba estudiando, mi hermano estaba viendo televisión."
  },
  {
    "texto1": "Aunque; a pesar de que; en contraste con (usado para introducir un contraste).",
    "texto2": "Aunque / Si bien / Mientras que / Considerando que",
    "texto3": "while",
    "texto4": "was/were while (past contrasting situations) / will be while (future contrasting situations)",
    "texto5": "While I understand your point, I don't agree with your conclusion.",
    "texto6": "Aunque entiendo tu punto, no estoy de acuerdo con tu conclusión."
  },
  {
    "texto1": "Un período de tiempo; un rato.",
    "texto2": "Rato / Momento / Tiempo / Lapso",
    "texto3": "while",
    "texto4": "whiles (rare plural, as in 'for a while'); has been a while (past); will be a while (future)",
    "texto5": "I haven't seen her in a while.",
    "texto6": "No la he visto en un rato."
  },
  {
    "texto1": "Separar algo en pedazos como resultado de un golpe, presión o tensión.",
    "texto2": "Romper / Quebrar / Fracturar / Partir",
    "texto3": "break",
    "texto4": "broke / broken / will break",
    "texto5": "Be careful not to break the glass.",
    "texto6": "Ten cuidado de no romper el vaso."
  },
  {
    "texto1": "Interrumpir la continuidad, el orden o el progreso de algo.",
    "texto2": "Interrumpir / Pausar / Suspender / Cortar",
    "texto3": "break",
    "texto4": "broke / broken / will break",
    "texto5": "Let's take a short break for coffee.",
    "texto6": "Tomemos un breve descanso para el café."
  },
  {
    "texto1": "Un período corto de tiempo durante el cual se detiene una actividad, trabajo o rutina.",
    "texto2": "Descanso / Pausa / Interrupción / Receso",
    "texto3": "break",
    "texto4": "breaks (plural)",
    "texto5": "The students enjoyed their summer break.",
    "texto6": "Los estudiantes disfrutaron de sus vacaciones de verano."
  },
  {
    "texto1": "Revelar una noticia o información importante, a menudo por primera vez.",
    "texto2": "Revelar / Publicar / Difundir / Dar a conocer",
    "texto3": "break",
    "texto4": "broke / broken / will break",
    "texto5": "The newspaper was the first to break the story.",
    "texto6": "El periódico fue el primero en revelar la noticia."
  },
  {
    "texto1": "Superar un récord o una barrera.",
    "texto2": "Superar / Batir / Romper (récord)",
    "texto3": "break",
    "texto4": "broke / broken / will break",
    "texto5": "The athlete tried to break the world record.",
    "texto6": "El atleta intentó batir el récord mundial."
  },
  {
    "texto1": "Un valor que indica la ausencia de cualquier valor o un valor desconocido o indefinido.",
    "texto2": "Nulo / Vacío / Ninguno / Sin valor",
    "texto3": "null",
    "texto4": "was null / will be null",
    "texto5": "In many programming languages, 'null' is used to represent an empty reference or pointer.",
    "texto6": "En muchos lenguajes de programación, 'null' se usa para representar una referencia o puntero vacío."
  },
  {
    "texto1": "En bases de datos, un marcador que especifica que un valor de datos no existe en la base de datos.",
    "texto2": "Nulo (base de datos) / Ausente / Indefinido",
    "texto3": "null",
    "texto4": "was null / will be null",
    "texto5": "If a field in the database allows null values, it means it can be left empty.",
    "texto6": "Si un campo en la base de datos permite valores nulos, significa que puede dejarse vacío."
  },
  {
    "texto1": "Algo que no tiene fuerza legal o validez; inválido.",
    "texto2": "Nulo / Inválido / Sin efecto / Anulado",
    "texto3": "null",
    "texto4": "was null / will be null",
    "texto5": "The contract was declared null and void due to a technicality.",
    "texto6": "El contrato fue declarado nulo y sin efecto debido a un tecnicismo."
  },
  {
    "texto1": "Recibir propiedades, títulos o dinero como heredero al morir el dueño anterior.",
    "texto2": "Heredar / Recibir en herencia / Adquirir por sucesión",
    "texto3": "inherit",
    "texto4": "inherited / will inherit",
    "texto5": "She inherited a large sum of money from her grandmother.",
    "texto6": "Ella heredó una gran suma de dinero de su abuela."
  },
  {
    "texto1": "Obtener una característica, rasgo o cualidad genética de los padres o ancestros.",
    "texto2": "Heredar (genético) / Transmitir (rasgos) / Adquirir (de padres)",
    "texto3": "inherit",
    "texto4": "inherited / will inherit",
    "texto5": "He inherited his father's blue eyes and musical talent.",
    "texto6": "Él heredó los ojos azules y el talento musical de su padre."
  },
  {
    "texto1": "En programación, adquirir propiedades y métodos de una clase superior o padre.",
    "texto2": "Heredar (programación) / Derivar / Extender",
    "texto3": "inherit",
    "texto4": "inherited / will inherit",
    "texto5": "The 'Dog' class inherits properties from the 'Animal' class.",
    "texto6": "La clase 'Perro' hereda propiedades de la clase 'Animal'."
  },
  {
    "texto1": "Intentar hacer algo o esforzarse por lograrlo.",
    "texto2": "Intentar / Probar / Esforzarse / Procurar",
    "texto3": "try",
    "texto4": "tried / will try",
    "texto5": "I will try my best to finish the project on time.",
    "texto6": "Intentaré dar lo mejor de mí para terminar el proyecto a tiempo."
  },
  {
    "texto1": "Experimentar con algo para ver si funciona, es adecuado o es efectivo.",
    "texto2": "Probar / Ensayar / Experimentar / Catare",
    "texto3": "try",
    "texto4": "tried / will try",
    "texto5": "You should try this new restaurant; the food is delicious.",
    "texto6": "Deberías probar este nuevo restaurante; la comida es deliciosa."
  },
  {
    "texto1": "Someter a una persona o caso a un juicio legal.",
    "texto2": "Juzgar / Enjuiciar / Procesar / Someter a juicio",
    "texto3": "try",
    "texto4": "tried / will try",
    "texto5": "The suspect will be tried in court next month.",
    "texto6": "El sospechoso será juzgado en el tribunal el próximo mes."
  },
  {
    "texto1": "Un intento de hacer o lograr algo.",
    "texto2": "Intento / Prueba / Ensayo / Esfuerzo",
    "texto3": "try",
    "texto4": "tries (plural)",
    "texto5": "He made several tries before finally succeeding.",
    "texto6": "Hizo varios intentos antes de finalmente tener éxito."
  },
  {
    "texto1": "Agarrar o interceptar algo en movimiento, especialmente después de ser lanzado, caído o disparado.",
    "texto2": "Atrapar / Coger / Agarrar / Recoger",
    "texto3": "catch",
    "texto4": "caught / will catch",
    "texto5": "The baseball player made an amazing catch.",
    "texto6": "El jugador de béisbol hizo una atrapada increíble."
  },
  {
    "texto1": "Sorprender a alguien haciendo algo, especialmente algo malo o inesperado.",
    "texto2": "Sorprender / Pillar / Descubrir / Encontrar",
    "texto3": "catch",
    "texto4": "caught / will catch",
    "texto5": "The police caught the thief trying to escape.",
    "texto6": "La policía atrapó al ladrón tratando de escapar."
  },
  {
    "texto1": "Adquirir una enfermedad o infección.",
    "texto2": "Coger (enfermedad) / Contraer / Pescar / Pillar",
    "texto3": "catch",
    "texto4": "caught / will catch",
    "texto5": "I hope I don't catch a cold this winter.",
    "texto6": "Espero no coger un resfriado este invierno."
  },
  {
    "texto1": "Llegar a tiempo para tomar un transporte público como un autobús, tren o avión.",
    "texto2": "Coger (transporte) / Alcanzar / Tomar",
    "texto3": "catch",
    "texto4": "caught / will catch",
    "texto5": "We need to leave now if we want to catch the train.",
    "texto6": "Necesitamos irnos ahora si queremos coger el tren."
  },
  {
    "texto1": "Entender o comprender algo que se ha dicho o presentado.",
    "texto2": "Entender / Captar / Comprender / Pillar (idea)",
    "texto3": "catch",
    "texto4": "caught / will catch",
    "texto5": "I didn't quite catch what you said; could you repeat it?",
    "texto6": "No capto del todo lo que dijiste; ¿podrías repetirlo?"
  },
  {
    "texto1": "Ser igual o muy similar a algo o alguien; encajar o combinar bien.",
    "texto2": "Coincidir / Combinar / Empatar / Corresponder",
    "texto3": "match",
    "texto4": "matched / will match",
    "texto5": "The curtains match the sofa perfectly.",
    "texto6": "Las cortinas combinan perfectamente con el sofá."
  },
  {
    "texto1": "Un encuentro o competición deportiva entre dos personas o equipos.",
    "texto2": "Partido / Encuentro / Competición / Contienda",
    "texto3": "match",
    "texto4": "matches (plural)",
    "texto5": "Our team won the football match.",
    "texto6": "Nuestro equipo ganó el partido de fútbol."
  },
  {
    "texto1": "Una persona o cosa que es compatible o comparable con otra.",
    "texto2": "Pareja / Correspondencia / Equivalente / Similar",
    "texto3": "match",
    "texto4": "matches (plural)",
    "texto5": "He's looking for a good match for his daughter.",
    "texto6": "Él está buscando una buena pareja para su hija."
  },
  {
    "texto1": "Un pequeño palo o tira de madera o cartón con una punta recubierta de una sustancia inflamable, utilizada para encender fuego.",
    "texto2": "Cerilla / Fósforo",
    "texto3": "match",
    "texto4": "matches (plural)",
    "texto5": "Do you have a light? I need a match.",
    "texto6": "¿Tienes fuego? Necesito una cerilla."
  },
  {
    "texto1": "Encontrar algo que corresponde a otra cosa; buscar una equivalencia.",
    "texto2": "Emparejar / Encontrar correspondencia / Cotejar / Asociar",
    "texto3": "match",
    "texto4": "matched / will match",
    "texto5": "Can you match these keys to their correct locks?",
    "texto6": "¿Puedes emparejar estas llaves con sus cerraduras correctas?"
  },
  {
    "texto1": "En un resumen muy breve y conciso, expresando las ideas principales.",
    "texto2": "En pocas palabras / En resumen / En síntesis / Brevemente",
    "texto3": "nutshell",
    "texto4": "N/A",
    "texto5": "To put it in a nutshell, we're bankrupt.",
    "texto6": "(Para decirlo en pocas palabras, estamos en bancarrota.)"
  },
  {
    "texto1": "Algo que es muy pequeño o que se presenta de forma muy compacta.",
    "texto2": "Minúsculo / Diminuto / En miniatura",
    "texto3": "nutshell",
    "texto4": "N/A",
    "texto5": "The entire plan fits in a nutshell.",
    "texto6": "(Todo el plan cabe en un espacio minúsculo.)"
  }
]
