[
  {
    "texto1": "Un verbo que describe el cese de la vida en personas, animales o plantas.",
    "texto2": "Morir / Fallecer",
    "texto3": "die /daɪ/",
    "texto4": "died /daɪd/ / will die /daɪ/ / dying /ˈdaɪ.ɪŋ/",
    "texto5": "The old tree finally died after the long winter.",
    "texto6": "El viejo árbol finalmente murió después del largo invierno."
  },
  {
    "texto1": "Un verbo que describe el fin del funcionamiento de un objeto inanimado o una costumbre.",
    "texto2": "Apagarse / Extinguirse",
    "texto3": "die /daɪ/",
    "texto4": "died /daɪd/ / will die /daɪ/ / dying /ˈdaɪ.ɪŋ/",
    "texto5": "The car engine died right as we were about to enter the tunnel.",
    "texto6": "El motor del coche se apagó justo cuando estábamos a punto de entrar en el túnel."
  },
  {
    "texto1": "Un verbo usado en expresiones idiomáticas para indicar un anhelo o deseo muy intenso de algo.",
    "texto2": "Morirse de ganas",
    "texto3": "die /daɪ/",
    "texto4": "died /daɪd/ / will die /daɪ/ / dying /ˈdaɪ.ɪŋ/",
    "texto5": "I'm dying to know how the story ends!",
    "texto6": "¡Me muero de ganas de saber cómo termina la historia!"
  },
  {
    "texto1": "Un adjetivo que describe la sensación de inestabilidad, aturdimiento, o que el entorno da vueltas. Se puede usar por diversas razones, incluyendo la ingesta de alcohol.",
    "texto2": "Mareado",
    "texto3": "dizzy /dɪzi/",
    "texto4": "N/A",
    "texto5": "I felt a bit dizzy after standing up too quickly.",
    "texto6": "Me sentí un poco mareado después de levantarme demasiado rápido."
  },
  {
    "texto1": "Un adjetivo usado en lenguaje informal para describir una sensación de aturdimiento o confusión por una experiencia emocionante, impactante, o confusa.",
    "texto2": "Atontado / Confundido",
    "texto3": "dizzy /dɪzi/",
    "texto4": "N/A",
    "texto5": "I was a little dizzy from all the new information.",
    "texto6": "Estaba un poco aturdido por tanta información nueva."
  },
  {
    "texto1": "Un adjetivo usado para describir a alguien que es tonto, superficial, o tontamente divertido.",
    "texto2": "Atontado / Tonto",
    "texto3": "dizzy /dɪzi/",
    "texto4": "N/A",
    "texto5": "She's a dizzy blonde character in the movie.",
    "texto6": "Ella es un personaje de rubia tonta en la película."
  },
  {
    "texto1": "Verbo que describe la acción de romper o hacer pedazos algo de manera repentina y violenta, especialmente algo de vidrio o cerámico. También se usa figuradamente para referirse a la destrucción de esperanzas, sueños o un silencio.",
    "texto2": "Romper / Destrozar / Hacer añicos / Destruir",
    "texto3": "shatter /ˈʃætər/",
    "texto4": "shattered / will shatter / shattering",
    "texto5": "The glass window shattered when the ball hit it.",
    "texto6": "La ventana de vidrio se rompió en pedazos cuando la pelota la golpeó."
  },
  {
    "texto1": "Verbo que describe la acción de causar un daño emocional o psicológico profundo a una persona, dejándola devastada.",
    "texto2": "Destrozar / Devastar",
    "texto3": "shatter /ˈʃætər/",
    "texto4": "shattered / will shatter / shattering",
    "texto5": "The news of his death shattered her world.",
    "texto6": "La noticia de su muerte destrozó su mundo."
  },
  {
    "texto1": "Verbo usado para describir un sonido muy fuerte que rompe el silencio o se escucha de manera repentina.",
    "texto2": "Romper / Quebrar (el silencio)",
    "texto3": "shatter /ˈʃætər/",
    "texto4": "shattered / will shatter / shattering",
    "texto5": "A loud scream shattered the silence of the night.",
    "texto6": "Un grito fuerte rompió el silencio de la noche."
  },
  {
    "texto1": "Un verbo que describe la acción de organizar, ordenar o colocar algo de una manera particular. También se usa para planificar o preparar un evento, una reunión, o un acuerdo.",
    "texto2": "Organizar / Arreglar / Preparar",
    "texto3": "arrange /əˈreɪndʒ/",
    "texto4": "arranged / will arrange / arranging",
    "texto5": "Can you help me arrange the furniture in the living room?",
    "texto6": "¿Puedes ayudarme a organizar los muebles de la sala de estar?"
  },
  {
    "texto1": "Verbo que describe el proceso de llegar a un acuerdo o establecer un arreglo con alguien sobre un plan o condición.",
    "texto2": "Acordar / Disponer / Concertar",
    "texto3": "arrange /əˈreɪndʒ/",
    "texto4": "arranged / will arrange / arranging",
    "texto5": "We need to arrange a time to meet next week.",
    "texto6": "Necesitamos acordar una hora para reunirnos la próxima semana."
  },
  {
    "texto1": "Verbo usado para referirse a la adaptación de una pieza musical para un instrumento o conjunto diferente al original.",
    "texto2": "Arreglar / Adaptar (música)",
    "texto3": "arrange /əˈreɪndʒ/",
    "texto4": "arranged / will arrange / arranging",
    "texto5": "The composer arranged the symphony for a smaller orchestra.",
    "texto6": "El compositor arregló la sinfonía para una orquesta más pequeña."
  },
  {
    "texto1": "Verbo que se usa en contextos formales, como en la floristería, para describir la acción de preparar y exhibir flores de forma artística.",
    "texto2": "Arreglar / Componer (flores)",
    "texto3": "arrange /əˈreɪndʒ/",
    "texto4": "arranged / will arrange / arranging",
    "texto5": "She arranged the flowers beautifully in the vase.",
    "texto6": "Ella arregló las flores hermosamente en el jarrón."
  },
  {
    "texto1": "Un adverbio que se refiere a un país extranjero o a un lugar fuera del propio país. También se puede usar para indicar que algo se ha difundido ampliamente o en un área grande.",
    "texto2": "En el extranjero / Fuera del país",
    "texto3": "abroad /əˈbrɔːd/",
    "texto4": "N/A",
    "texto5": "I want to study abroad next year to learn a new language.",
    "texto6": "Quiero estudiar en el extranjero el próximo año para aprender un nuevo idioma."
  },
  {
    "texto1": "Un adverbio que se refiere a la acción de viajar o moverse fuera de los límites de un espacio o un país en particular, como en la expresión 'to travel abroad'.",
    "texto2": "Afuera / Al extranjero",
    "texto3": "abroad /əˈbrɔːd/",
    "texto4": "N/A",
    "texto5": "He travels abroad for work at least twice a year.",
    "texto6": "Él viaja al extranjero por trabajo al menos dos veces al año."
  },
  {
    "texto1": "Un adverbio usado en un contexto literario o arcaico para referirse a algo que está circulando o que se ha difundido de forma amplia entre la gente, como una noticia o un rumor.",
    "texto2": "Ampliamente / Circulando",
    "texto3": "abroad /əˈbrɔːd/",
    "texto4": "N/A",
    "texto5": "The news of the discovery soon spread abroad.",
    "texto6": "La noticia del descubrimiento pronto se difundió ampliamente."
  },
  {
    "texto1": "Un verbo que describe el acto de chocar o golpear suavemente a algo o alguien, a menudo de forma accidental. También puede usarse como sustantivo para referirse al golpe o la protuberancia resultante.",
    "texto2": "Golpear / Chocar / Toparse / Bulto",
    "texto3": "bump /bʌmp/",
    "texto4": "bumped / will bump / bumping",
    "texto5": "I accidentally bumped my head on the low ceiling.",
    "texto6": "Accidentalmente me golpeé la cabeza con el techo bajo."
  },
  {
    "texto1": "Un verbo que describe el acto de subir de nivel, empujar hacia arriba, o mover a una posición más alta. En contextos de redes sociales, se usa para hacer que una publicación vuelva a la parte superior de la página.",
    "texto2": "Subir / Elevar / Impulsar",
    "texto3": "bump /bʌmp/",
    "texto4": "bumped / will bump / bumping",
    "texto5": "We need to bump this post to the top of the feed.",
    "texto6": "Necesitamos subir esta publicación a la parte superior de la página."
  },
  {
    "texto1": "Un verbo que se usa para describir el acto de quitar a alguien de un puesto, asiento, o lista de espera para dar su lugar a otra persona. Es común en el contexto de aerolíneas o eventos.",
    "texto2": "Sacar / Desplazar",
    "texto3": "bump /bʌmp/",
    "texto4": "bumped / will bump / bumping",
    "texto5": "The airline bumped me off the flight because it was overbooked.",
    "texto6": "La aerolínea me sacó del vuelo porque estaba sobrevendido."
  },
  {
    "texto1": "Un sustantivo que se refiere a un aumento o elevación en algo, como en 'speed bump' (reductor de velocidad) o 'baby bump' (protuberancia del embarazo).",
    "texto2": "Resalto / Protuberancia / Bulto",
    "texto3": "bump /bʌmp/",
    "texto4": "N/A",
    "texto5": "Be careful, there's a speed bump ahead.",
    "texto6": "Ten cuidado, hay un reductor de velocidad más adelante."
  },
  {
    "texto1": "Un verbo que describe la acción de atar o unir algo usando una cuerda, un cordón o un lazo. Como sustantivo, se refiere a una corbata o a un empate en un juego o competencia.",
    "texto2": "Atar / Unir / Empatar / Corbata",
    "texto3": "tie /taɪ/",
    "texto4": "tied / will tie / tying",
    "texto5": "Can you help me tie my shoelaces?",
    "texto6": "¿Puedes ayudarme a atarme los cordones de los zapatos?"
  },
  {
    "texto1": "Un sustantivo que se refiere a una corbata, una pieza de ropa que se usa alrededor del cuello.",
    "texto2": "Corbata",
    "texto3": "tie /taɪ/",
    "texto4": "N/A",
    "texto5": "He wore a suit and a red tie to the wedding.",
    "texto6": "Llevaba un traje y una corbata roja para la boda."
  },
  {
    "texto1": "Un sustantivo que se refiere a una situación en un juego o competencia en la que dos o más jugadores o equipos tienen la misma puntuación.",
    "texto2": "Empate",
    "texto3": "tie /taɪ/",
    "texto4": "N/A",
    "texto5": "The game ended in a tie, so they had to play an extra round.",
    "texto6": "El juego terminó en un empate, así que tuvieron que jugar una ronda extra."
  },
  {
    "texto1": "Un verbo que describe la acción de restringir o limitar la libertad o el movimiento de algo o alguien.",
    "texto2": "Atar / Restringir / Limitar",
    "texto3": "tie /taɪ/",
    "texto4": "tied / will tie / tying",
    "texto5": "The new rules tie the hands of the local government.",
    "texto6": "Las nuevas reglas atan las manos del gobierno local."
  },
  {
    "texto1": "Un adjetivo que describe algo que está firmemente sujeto o ajustado, sin dejar espacio para el movimiento. También puede referirse a una prenda de vestir que queda muy ajustada, o a un horario que es muy apretado.",
    "texto2": "Apretado / Ajustado / Tenso",
    "texto3": "tight /taɪt/",
    "texto4": "tighter / will be tight / being tight",
    "texto5": "I can't get the lid off; it's on too tight.",
    "texto6": "No puedo quitar la tapa; está demasiado apretada."
  },
  {
    "texto1": "Un adjetivo que se usa para describir a un grupo de personas, como una familia o un equipo, que están muy unidos y tienen una relación cercana y fuerte.",
    "texto2": "Unido / Cercano / Comprometido",
    "texto3": "tight /taɪt/",
    "texto4": "tighter / will be tight / being tight",
    "texto5": "They are a very tight-knit family.",
    "texto6": "Ellos son una familia muy unida."
  },
  {
    "texto1": "Un adjetivo que describe algo que está restringido o controlado de manera estricta, como las finanzas o las medidas de seguridad.",
    "texto2": "Estricto / Riguroso",
    "texto3": "tight /taɪt/",
    "texto4": "tighter / will be tight / being tight",
    "texto5": "The security was very tight at the event.",
    "texto6": "La seguridad era muy estricta en el evento."
  },
  {
    "texto1": "Un adjetivo usado en lenguaje informal para describir una situación en la que el dinero es escaso, o un horario que tiene poco tiempo libre.",
    "texto2": "Apretado (de dinero o tiempo)",
    "texto3": "tight /taɪt/",
    "texto4": "tighter / will be tight / being tight",
    "texto5": "We're on a tight budget this month.",
    "texto6": "Tenemos un presupuesto muy ajustado este mes."
  },
  {
    "texto1": "Un adjetivo que describe algo plano, liso, sin irregularidades, o un número que es divisible por dos sin residuo. Como adverbio, se usa para enfatizar algo sorprendente o inusual (incluso).",
    "texto2": "Incluso / Par / Llano / Liso",
    "texto3": "even /ˈiːvən/",
    "texto4": "N/A",
    "texto5": "The floor is not even, so the table wobbles.",
    "texto6": "El suelo no está liso, por lo que la mesa se tambalea."
  },
  {
    "texto1": "Un adverbio que se usa para enfatizar una idea sorprendente, inesperada, o para incluir algo más de lo que se ha mencionado. A menudo se traduce como 'incluso'.",
    "texto2": "Incluso / Aún",
    "texto3": "even /ˈiːvən/",
    "texto4": "N/A",
    "texto5": "He didn't even say goodbye before he left.",
    "texto6": "Ni siquiera se despidió antes de irse."
  },
  {
    "texto1": "Un adjetivo que se refiere a una situación donde las cosas son iguales o equilibradas, como en un juego o competencia donde nadie tiene una ventaja.",
    "texto2": "Igual / Empatado / Equilibrado",
    "texto3": "even /ˈiːvən/",
    "texto4": "N/A",
    "texto5": "The score is now even, 2-2.",
    "texto6": "El marcador está ahora empatado, 2-2."
  },
  {
    "texto1": "Un verbo que significa hacer algo más plano o nivelado, o equilibrar una situación. Generalmente se usa con la preposición 'out' para formar un 'phrasal verb'.",
    "texto2": "Nivelar / Equilibrar",
    "texto3": "even /ˈiːvən/",
    "texto4": "evened / will even / evening",
    "texto5": "We need to even out the top of the cake before adding the icing.",
    "texto6": "Tenemos que nivelar la parte superior del pastel antes de ponerle el glaseado."
  },
  {
    "texto1": "Un verbo que describe la acción de mover algo a una posición más alta. También se usa para aumentar una cantidad, un precio, una voz, o para criar a un niño o animal.",
    "texto2": "Elevar / Subir / Aumentar / Criar",
    "texto3": "raise /reɪz/",
    "texto4": "raised / will raise / raising",
    "texto5": "Please raise your hand if you have a question.",
    "texto6": "Por favor, levanten la mano si tienen una pregunta."
  },
  {
    "texto1": "Un verbo que describe la acción de aumentar una cantidad, un nivel, un precio o un sueldo. También puede referirse a la acción de construir o erigir algo, como un edificio.",
    "texto2": "Aumentar / Subir / Construir",
    "texto3": "raise /reɪz/",
    "texto4": "raised / will raise / raising",
    "texto5": "The company decided to raise the prices of its products.",
    "texto6": "La compañía decidió aumentar los precios de sus productos."
  },
  {
    "texto1": "Un verbo que describe la acción de criar a una persona o animal, cuidándolo y educándolo hasta que sea adulto. También puede referirse a la crianza de plantas.",
    "texto2": "Criar / Educar",
    "texto3": "raise /reɪz/",
    "texto4": "raised / will raise / raising",
    "texto5": "She was raised by her grandparents in the countryside.",
    "texto6": "Ella fue criada por sus abuelos en el campo."
  },
  {
    "texto1": "Un verbo que describe el acto de plantear un tema o una pregunta para su consideración o discusión.",
    "texto2": "Plantear / Presentar",
    "texto3": "raise /reɪz/",
    "texto4": "raised / will raise / raising",
    "texto5": "He wanted to raise the issue of low salaries at the meeting.",
    "texto6": "Él quería plantear el tema de los salarios bajos en la reunión."
  },
  {
    "texto1": "Un verbo que describe la acción de estirar el brazo o la mano para tocar o agarrar algo. También se usa para referirse a la acción de llegar a un destino, alcanzar una meta o ponerse en contacto con alguien.",
    "texto2": "Alcanzar / Llegar a / Estirar",
    "texto3": "reach /riːtʃ/",
    "texto4": "reached / will reach / reaching",
    "texto5": "Can you reach the book on the top shelf for me?",
    "texto6": "¿Puedes alcanzarme el libro que está en el estante de arriba?"
  },
  {
    "texto1": "Un verbo que describe la acción de llegar a un lugar o destino después de viajar o de un esfuerzo.",
    "texto2": "Llegar",
    "texto3": "reach /riːtʃ/",
    "texto4": "reached / will reach / reaching",
    "texto5": "We finally reached the summit after a long hike.",
    "texto6": "Finalmente llegamos a la cima después de una larga caminata."
  },
  {
    "texto1": "Un verbo que describe el acto de lograr una meta, un objetivo o un nivel específico de algo.",
    "texto2": "Alcanzar / Lograr",
    "texto3": "reach /riːtʃ/",
    "texto4": "reached / will reach / reaching",
    "texto5": "She reached her goal of running a marathon.",
    "texto6": "Ella alcanzó su objetivo de correr una maratón."
  },
  {
    "texto1": "Un verbo usado para referirse a la acción de ponerse en contacto con alguien por teléfono, correo electrónico o cualquier otro medio de comunicación.",
    "texto2": "Contactar / Ponerse en contacto",
    "texto3": "reach /riːtʃ/",
    "texto4": "reached / will reach / reaching",
    "texto5": "I tried to reach you all day, but your phone was off.",
    "texto6": "Intenté contactarte todo el día, pero tu teléfono estaba apagado."
  },
  {
    "texto1": "Un verbo que describe la acción de traicionar la confianza de alguien, especialmente revelando un secreto, engañando a esa persona, o mostrándose desleal. Es la forma en pasado y pasado participio de 'betray'.",
    "texto2": "Traicionar / Engañar / Revelar",
    "texto3": "betrayed /bɪˈtreɪd/",
    "texto4": "N/A",
    "texto5": "I feel betrayed because he told everyone my secret.",
    "texto6": "Me siento traicionado porque él le contó a todos mi secreto."
  },
  {
    "texto1": "Un verbo que se usa para describir el acto de revelar información, un sentimiento, o una cualidad sin la intención de hacerlo. A menudo se usa en un contexto más pasivo o sutil.",
    "texto2": "Revelar / Delatar / Manifestar",
    "texto3": "betrayed /bɪˈtreɪd/",
    "texto4": "N/A",
    "texto5": "His nervous trembling betrayed his fear.",
    "texto6": "Su temblor nervioso delató su miedo."
  },
  {
    "texto1": "Un verbo que describe la acción de engañar a alguien en su fe o confianza, especialmente en un contexto romántico, pero también puede ser usado en otros contextos sociales o profesionales.",
    "texto2": "Traicionar / Ser infiel",
    "texto3": "betrayed /bɪˈtreɪd/",
    "texto4": "N/A",
    "texto5": "He betrayed his country by selling government secrets.",
    "texto6": "Él traicionó a su país vendiendo secretos gubernamentales."
  },
  {
    "texto1": "Un adjetivo que describe a una persona o animal que no puede caminar normalmente debido a una lesión en la pierna o el pie. En el lenguaje informal americano, se usa para describir algo que es insatisfactorio, aburrido o poco convincente.",
    "texto2": "Cojo / Patético / Aburrido / Pobre",
    "texto3": "lame /leɪm/",
    "texto4": "lamer / will be lame / being lame",
    "texto5": "That movie was really lame; nothing exciting happened.",
    "texto6": "Esa película fue realmente patética; no pasó nada emocionante."
  },
  {
    "texto1": "Un adjetivo usado para referirse a una persona que no puede caminar normalmente debido a una lesión o defecto físico en una o ambas piernas. Este uso es más formal o técnico que el uso informal.",
    "texto2": "Cojo / Lisiado",
    "texto3": "lame /leɪm/",
    "texto4": "lamer / will be lame / being lame",
    "texto5": "The injured horse was lame and could not run in the race.",
    "texto6": "El caballo herido estaba cojo y no pudo correr en la carrera."
  },
  {
    "texto1": "Un adjetivo en lenguaje informal, especialmente entre adolescentes, para describir algo que es aburrido, poco interesante, o de baja calidad.",
    "texto2": "Aburrido / Pobre / Tonto",
    "texto3": "lame /leɪm/",
    "texto4": "lamer / will be lame / being lame",
    "texto5": "Don't be so lame; let's go out and do something fun!",
    "texto6": "¡No seas tan aburrido; salgamos a hacer algo divertido!"
  },
  {
    "texto1": "Un adjetivo usado para describir una excusa o un argumento que es débil, poco convincente o poco sincero.",
    "texto2": "Pobre / Insatisfactorio / Malo",
    "texto3": "lame /leɪm/",
    "texto4": "lamer / will be lame / being lame",
    "texto5": "He gave a lame excuse for not finishing his homework.",
    "texto6": "Dio una pobre excusa por no terminar su tarea."
  },
  {
    "texto1": "Un verbo que describe la acción de conceder, otorgar o dar algo formalmente a alguien, como un deseo, un permiso, o una solicitud. Como sustantivo, se refiere a una suma de dinero dada por una organización o el gobierno para un propósito específico.",
    "texto2": "Conceder / Otorgar / Subsidio / Beca",
    "texto3": "grant /ɡrænt/",
    "texto4": "granted / will grant / granting",
    "texto5": "The city council decided to grant the company a permit for the new building.",
    "texto6": "El consejo de la ciudad decidió conceder a la empresa un permiso para el nuevo edificio."
  },
  {
    "texto1": "Un sustantivo que se refiere a una suma de dinero que se otorga a un individuo o una organización para un propósito específico, como investigación, estudio o un proyecto, sin la expectativa de que sea devuelto.",
    "texto2": "Beca / Subsidio / Donación",
    "texto3": "grant /ɡrænt/",
    "texto4": "N/A",
    "texto5": "She received a grant to fund her research on climate change.",
    "texto6": "Ella recibió una beca para financiar su investigación sobre el cambio climático."
  },
  {
    "texto1": "Una frase verbal que se usa para describir el acto de dar por sentado algo, asumiendo que algo es cierto o que sucederá sin pensarlo realmente. A menudo se usa en la forma 'take something for granted'.",
    "texto2": "Dar por sentado",
    "texto3": "grant /ɡrænt/",
    "texto4": "N/A",
    "texto5": "He took her kindness for granted and never thanked her.",
    "texto6": "Él dio por sentado su amabilidad y nunca le dio las gracias."
  },
  {
    "texto1": "Un verbo que describe la acción de aceptar o permitir que algo suceda, a menudo a regañadientes o como parte de una discusión, en la forma 'I grant you that...'.",
    "texto2": "Admitir / Conceder",
    "texto3": "grant /ɡrænt/",
    "texto4": "granted / will grant / granting",
    "texto5": "I grant you that it's a difficult situation, but we still have to try.",
    "texto6": "Admito que es una situación difícil, pero aún así tenemos que intentarlo."
  },
  {
    "texto1": "Un verbo que describe la acción de llegar a un lugar después de un viaje o un período de tiempo. Se usa para referirse a la llegada de personas, objetos o incluso eventos, como la llegada de una carta o de una fecha.",
    "texto2": "Llegar / Arribar",
    "texto3": "arrive /əˈraɪv/",
    "texto4": "arrived / will arrive / arriving",
    "texto5": "What time did you arrive at the airport?",
    "texto6": "¿A qué hora llegaste al aeropuerto?"
  },
  {
    "texto1": "Un verbo que describe el acto de que un evento, un momento o un período de tiempo importante suceda o se presente.",
    "texto2": "Llegar / Venir",
    "texto3": "arrive /əˈraɪv/",
    "texto4": "arrived / will arrive / arriving",
    "texto5": "The time has arrived for us to make a decision.",
    "texto6": "Ha llegado el momento de que tomemos una decisión."
  },
  {
    "texto1": "Un verbo que se usa para describir el acto de conseguir el éxito o de lograr una posición de importancia o reconocimiento después de un esfuerzo sostenido.",
    "texto2": "Llegar / Tener éxito",
    "texto3": "arrive /əˈraɪv/",
    "texto4": "arrived / will arrive / arriving",
    "texto5": "After years of hard work, he finally felt that he had arrived.",
    "texto6": "Después de años de arduo trabajo, finalmente sintió que había tenido éxito."
  },
  {
    "texto1": "Un verbo que describe el acto de que una carta, un paquete o cualquier otra forma de correspondencia sea entregada en su destino.",
    "texto2": "Llegar / Recibir",
    "texto3": "arrive /əˈraɪv/",
    "texto4": "arrived / will arrive / arriving",
    "texto5": "The package arrived yesterday, but I wasn't home to receive it.",
    "texto6": "El paquete llegó ayer, pero no estaba en casa para recibirlo."
  },
  {
    "texto1": "Un verbo que describe la acción de pedir una cantidad de dinero como pago por un servicio o producto. También se usa para referirse a la acción de cargar o llenar una batería con electricidad, o para acusar a alguien de un crimen.",
    "texto2": "Cobrar / Cargar / Acusar",
    "texto3": "charge /tʃɑːrdʒ/",
    "texto4": "charged / will charge / charging",
    "texto5": "The hotel will charge your credit card when you check out.",
    "texto6": "El hotel le cobrará a su tarjeta de crédito cuando haga el check-out."
  },
  {
    "texto1": "Un verbo que describe el acto de reabastecer o llenar un dispositivo, como una batería o un teléfono, con energía eléctrica.",
    "texto2": "Cargar",
    "texto3": "charge /tʃɑːrdʒ/",
    "texto4": "charged / will charge / charging",
    "texto5": "I need to charge my phone before I leave the house.",
    "texto6": "Necesito cargar mi teléfono antes de salir de casa."
  },
  {
    "texto1": "Un verbo que se usa para referirse a la acción de acusar formalmente a alguien de un crimen o delito.",
    "texto2": "Acusar / Imputar",
    "texto3": "charge /tʃɑːrdʒ/",
    "texto4": "charged / will charge / charging",
    "texto5": "He was charged with theft and had to go to court.",
    "texto6": "Fue acusado de robo y tuvo que ir a la corte."
  },
  {
    "texto1": "Un sustantivo que se refiere a la responsabilidad o el cuidado de alguien o algo. También se usa para referirse a una tarifa o un cargo por un servicio.",
    "texto2": "Cargo / Responsabilidad",
    "texto3": "charge /tʃɑːrdʒ/",
    "texto4": "N/A",
    "texto5": "The children were left in the charge of their grandparents.",
    "texto6": "Los niños quedaron a cargo de sus abuelos."
  },
  {
    "texto1": "Un verbo que describe la acción de avanzar rápidamente hacia alguien o algo para atacar o confrontar. A menudo se usa en un contexto militar o figurado.",
    "texto2": "Cargar / Acometer / Atacar",
    "texto3": "charge /tʃɑːrdʒ/",
    "texto4": "charged / will charge / charging",
    "texto5": "The knight charged at the dragon with his sword drawn.",
    "texto6": "El caballero atacó al dragón con su espada desenvainada."
  },
  {
    "texto1": "Un verbo que describe la acción de preguntarse o sentir curiosidad sobre algo. También se usa para expresar asombro o admiración ante algo inesperado, bello o extraordinario. Como sustantivo, se refiere a algo que causa asombro.",
    "texto2": "Preguntarse / Asombrarse / Maravilla",
    "texto3": "wonder /ˈwʌndər/",
    "texto4": "wondered / will wonder / wondering",
    "texto5": "I wonder what time the train is going to arrive.",
    "texto6": "Me pregunto a qué hora va a llegar el tren."
  },
  {
    "texto1": "Un sustantivo que se refiere a un sentimiento de asombro, admiración o sorpresa por algo hermoso, extraordinario o inesperado.",
    "texto2": "Maravilla / Asombro",
    "texto3": "wonder /ˈwʌndər/",
    "texto4": "N/A",
    "texto5": "The Grand Canyon is one of the natural wonders of the world.",
    "texto6": "El Gran Cañón es una de las maravillas naturales del mundo."
  },
  {
    "texto1": "Un verbo que describe la acción de preguntarse o dudar sobre algo, especialmente de una manera que puede implicar incertidumbre o escepticismo.",
    "texto2": "Dudar / Preguntarse",
    "texto3": "wonder /ˈwʌndər/",
    "texto4": "wondered / will wonder / wondering",
    "texto5": "She wondered if she had made the right decision.",
    "texto6": "Ella se preguntaba si había tomado la decisión correcta."
  },
  {
    "texto1": "Un verbo que se usa para expresar el deseo de saber o comprender algo, a menudo con una connotación de curiosidad o intriga.",
    "texto2": "Querer saber / Tener curiosidad",
    "texto3": "wonder /ˈwʌndər/",
    "texto4": "wondered / will wonder / wondering",
    "texto5": "I wonder who called me while I was out.",
    "texto6": "Me pregunto quién me llamó mientras estaba fuera."
  },
  {
    "texto1": "Un sustantivo que se refiere a una plataforma o estructura construida en el agua, donde los barcos pueden atracar para cargar y descargar, o para ser reparados. También se usa como verbo para referirse a la acción de atracar un barco.",
    "texto2": "Muelle / Dique / Atracar",
    "texto3": "dock /dɑːk/",
    "texto4": "N/A",
    "texto5": "The cruise ship will arrive at the dock at 9 a.m.",
    "texto6": "El crucero llegará al muelle a las 9 de la mañana."
  },
  {
    "texto1": "Un verbo que describe la acción de un barco o bote que llega y se amarra a un muelle, permitiendo que la gente suba o baje.",
    "texto2": "Atracar / Amarrar",
    "texto3": "dock /dɑːk/",
    "texto4": "docked / will dock / docking",
    "texto5": "The boat docked at the small pier to let the passengers off.",
    "texto6": "El bote atracó en el pequeño muelle para dejar bajar a los pasajeros."
  },
  {
    "texto1": "Un verbo que se usa para describir el acto de deducir dinero del salario de alguien, a menudo como una multa o una penalización.",
    "texto2": "Retener / Deducir (dinero)",
    "texto3": "dock /dɑːk/",
    "texto4": "docked / will dock / docking",
    "texto5": "They will dock your pay if you are late for work again.",
    "texto6": "Te retendrán dinero de tu sueldo si llegas tarde al trabajo de nuevo."
  },
  {
    "texto1": "Un sustantivo que se refiere al área en un tribunal de justicia donde se sientan los acusados durante un juicio.",
    "texto2": "Banquillo de los acusados",
    "texto3": "dock /dɑːk/",
    "texto4": "N/A",
    "texto5": "The accused stood in the dock and listened to the verdict.",
    "texto6": "El acusado se puso de pie en el banquillo y escuchó el veredicto."
  },
  {
    "texto1": "Un verbo que describe la acción de dar, suministrar o hacer que algo esté disponible para alguien. A menudo se usa para hablar de la provisión de cosas necesarias como comida, refugio o información.",
    "texto2": "Proporcionar / Suministrar / Proveer / Dar",
    "texto3": "provide /prəˈvaɪd/",
    "texto4": "provided / will provide / providing",
    "texto5": "The school will provide all the necessary books for the students.",
    "texto6": "La escuela proporcionará todos los libros necesarios para los estudiantes."
  },
  {
    "texto1": "Un verbo que describe la acción de proveer el sustento o el apoyo financiero a una familia o a un individuo. También puede usarse para referirse a la acción de preparar con antelación para el futuro.",
    "texto2": "Mantener / Proveer para",
    "texto3": "provide /prəˈvaɪd/",
    "texto4": "provided / will provide / providing",
    "texto5": "He works hard to provide for his family.",
    "texto6": "Él trabaja duro para mantener a su familia."
  },
  {
    "texto1": "Una conjunción o adverbio que se usa para introducir una condición, a menudo en la forma de 'provided that' o 'providing that'.",
    "texto2": "Siempre que / A condición de que",
    "texto3": "provide /prəˈvaɪd/",
    "texto4": "N/A",
    "texto5": "You can go to the party, provided that you finish your homework first.",
    "texto6": "Puedes ir a la fiesta, siempre y cuando termines tu tarea primero."
  },
  {
    "texto1": "Un verbo que describe la acción de guiar a alguien en la dirección equivocada o hacer que crean algo falso, a menudo con el propósito de engañar. Se usa comúnmente para hablar de información o acciones que resultan en una conclusión errónea.",
    "texto2": "Engañar / Desorientar / Inducir a error",
    "texto3": "mislead /mɪsˈliːd/",
    "texto4": "misled / will mislead / misleading",
    "texto5": "The politician's speech was designed to mislead the public about the new law.",
    "texto6": "El discurso del político fue diseñado para engañar al público sobre la nueva ley."
  },
  {
    "texto1": "Un verbo que se usa para describir el acto de llevar a alguien por un camino equivocado, ya sea de forma física, como perderse, o de forma figurada, como dar un mal consejo.",
    "texto2": "Desorientar / Extraviar / Descaminar",
    "texto3": "mislead /mɪsˈliːd/",
    "texto4": "misled / will mislead / misleading",
    "texto5": "The old map misled us, and we ended up in the wrong town.",
    "texto6": "El viejo mapa nos desorientó, y terminamos en el pueblo equivocado."
  },
  {
    "texto1": "Un verbo que describe la acción de dar una impresión falsa o incorrecta a alguien, lo que lleva a una conclusión equivocada. Es similar a engañar, pero puede ser menos intencional.",
    "texto2": "Dar una impresión falsa / Confundir",
    "texto3": "mislead /mɪsˈliːd/",
    "texto4": "misled / will mislead / misleading",
    "texto5": "His friendly demeanor can sometimes mislead people into thinking he's not serious about his work.",
    "texto6": "Su comportamiento amigable a veces puede confundir a la gente haciéndoles pensar que no se toma en serio su trabajo."
  },
  {
    "texto1": "Un verbo que describe la acción de decir los números en orden, o determinar el número total de personas o cosas. También puede usarse para considerar o tener algo en cuenta, como en 'contar con algo'.",
    "texto2": "Contar / Calcular / Considerar",
    "texto3": "count /kaʊnt/",
    "texto4": "counted / will count / counting",
    "texto5": "I asked my son to count how many apples were in the basket.",
    "texto6": "Le pedí a mi hijo que contara cuántas manzanas había en la cesta."
  },
  {
    "texto1": "Un verbo que se usa para describir el acto de considerar o incluir algo como parte de un total o una evaluación, a menudo con la preposición 'in'.",
    "texto2": "Contar / Incluir",
    "texto3": "count /kaʊnt/",
    "texto4": "counted / will count / counting",
    "texto5": "Don't forget to count in the money you spent on groceries.",
    "texto6": "No olvides incluir el dinero que gastaste en la compra."
  },
  {
    "texto1": "Un verbo que describe el acto de depender o confiar en alguien o algo, a menudo con la preposición 'on'.",
    "texto2": "Contar con / Depender de",
    "texto3": "count /kaʊnt/",
    "texto4": "counted / will count / counting",
    "texto5": "You can count on me to be there for you no matter what.",
    "texto6": "Puedes contar conmigo para estar ahí para ti pase lo que pase."
  },
  {
    "texto1": "Un sustantivo que se refiere al acto de contar o al resultado de un conteo, como en el contexto de una votación o un censo.",
    "texto2": "Conteo / Cuenta",
    "texto3": "count /kaʊnt/",
    "texto4": "N/A",
    "texto5": "The final count showed that the 'yes' votes were higher than the 'no' votes.",
    "texto6": "El conteo final mostró que los votos a favor eran más altos que los votos en contra."
  },
  {
    "texto1": "Un sustantivo que se refiere al punto donde dos o más huesos se encuentran en el cuerpo (una articulación). También se puede usar para describir un lugar, a menudo informal y poco elegante, donde la gente se reúne para comer o socializar.",
    "texto2": "Articulación / Coyuntura / Local",
    "texto3": "joint /dʒɔɪnt/",
    "texto4": "N/A",
    "texto5": "I have some pain in my knee joint when I walk.",
    "texto6": "Tengo algo de dolor en la articulación de la rodilla cuando camino."
  },
  {
    "texto1": "Un sustantivo que se usa en lenguaje informal para referirse a un lugar, como un restaurante, un bar o un club, que es a menudo considerado de baja categoría, poco elegante o sin pretensiones.",
    "texto2": "Local / Bar / Lugar",
    "texto3": "joint /dʒɔɪnt/",
    "texto4": "N/A",
    "texto5": "Let's go to that pizza joint on the corner for a quick bite.",
    "texto6": "Vamos a ese local de pizzas en la esquina para un bocado rápido."
  },
  {
    "texto1": "Un adjetivo que se refiere a algo que se realiza, se posee o se comparte entre dos o más personas o grupos. Describe una acción o propiedad que es mutua o combinada.",
    "texto2": "Conjunto / Mutuo / Común",
    "texto3": "joint /dʒɔɪnt/",
    "texto4": "N/A",
    "texto5": "They made a joint decision to buy the house together.",
    "texto6": "Tomaron una decisión conjunta de comprar la casa juntos."
  },
  {
    "texto1": "Un sustantivo que se refiere a una articulación en el cuerpo humano o animal, o a una conexión entre dos partes, como en una tubería o en una estructura mecánica.",
    "texto2": "Unión / Conexión",
    "texto3": "joint /dʒɔɪnt/",
    "texto4": "N/A",
    "texto5": "The plumber fixed the leaky joint in the pipe.",
    "texto6": "El fontanero arregló la unión con fugas en la tubería."
  },
  {
    "texto1": "Un verbo que describe la acción de secuestrar a alguien, llevándoselo ilegalmente y reteniéndolo contra su voluntad, a menudo para pedir un rescate. Es un delito grave.",
    "texto2": "Secuestrar / Raptar",
    "texto3": "kidnap /ˈkɪdnæp/",
    "texto4": "kidnapped / will kidnap / kidnapping",
    "texto5": "The police are searching for the criminals who tried to kidnap the wealthy businessman.",
    "texto6": "La policía está buscando a los criminales que intentaron secuestrar al empresario adinerado."
  },
  {
    "texto1": "Un sustantivo que se refiere al acto ilegal de llevar a alguien, especialmente a un niño, y retenerlo contra su voluntad, a menudo con fines de extorsión o rescate.",
    "texto2": "Secuestro / Rapto",
    "texto3": "kidnap /ˈkɪdnæp/",
    "texto4": "N/A",
    "texto5": "The government refused to negotiate with the kidnappers.",
    "texto6": "El gobierno se negó a negociar con los secuestradores."
  },
  {
    "texto1": "Un verbo que se usa figuradamente para describir el acto de tomar o robar algo de manera inesperada o injusta. Es menos común que el uso literal.",
    "texto2": "Robar / Arrebatar",
    "texto3": "kidnap /ˈkɪdnæp/",
    "texto4": "kidnapped / will kidnap / kidnapping",
    "texto5": "The company was accused of trying to kidnap the best talent from their competitors.",
    "texto6": "La compañía fue acusada de intentar robar el mejor talento de sus competidores."
  },
  {
    "texto1": "Un adjetivo que describe algo que es útil o conveniente, especialmente por su diseño o ubicación. También se usa para describir a una persona que es hábil con las manos o buena para arreglar cosas.",
    "texto2": "Útil / Práctico / Manitas / A mano",
    "texto3": "handy /ˈhændi/",
    "texto4": "handier / will be handy / being handy",
    "texto5": "It's handy to have a small flashlight in the car's glove compartment.",
    "texto6": "Es práctico tener una linterna pequeña en la guantera del coche."
  },
  {
    "texto1": "Un adjetivo que se usa para describir a una persona que es hábil con las manos, buena para hacer reparaciones en la casa o para construir cosas.",
    "texto2": "Manitas / Habilidoso",
    "texto3": "handy /ˈhændi/",
    "texto4": "handier / will be handy / being handy",
    "texto5": "My dad is really handy; he built all the furniture in our house.",
    "texto6": "Mi papá es un gran manitas; construyó todos los muebles de nuestra casa."
  },
  {
    "texto1": "Un adjetivo que se usa para describir algo que está convenientemente cerca o al alcance de la mano, lo que lo hace fácil de usar o acceder.",
    "texto2": "A mano / Al alcance",
    "texto3": "handy /ˈhændi/",
    "texto4": "handier / will be handy / being handy",
    "texto5": "Keep a pen and paper handy in case you need to write something down.",
    "texto6": "Mantén un bolígrafo y papel a mano en caso de que necesites anotar algo."
  },
  {
    "texto1": "Un sustantivo que se refiere a una pieza de ajedrez, la de menor valor. También se usa para describir a una persona que es usada por otros para lograr un fin. Como verbo, significa dejar algo como garantía para obtener un préstamo.",
    "texto2": "Peón / Prenda / Empeñar",
    "texto3": "pawn /pɔːn/",
    "texto4": "N/A",
    "texto5": "He was just a pawn in their political game.",
    "texto6": "Él era solo un peón en su juego político."
  },
  {
    "texto1": "Un sustantivo que se refiere a una pieza de ajedrez, la más numerosa y con movimientos limitados, que avanza hacia adelante y puede ser sacrificada para el beneficio de las piezas más valiosas.",
    "texto2": "Peón",
    "texto3": "pawn /pɔːn/",
    "texto4": "N/A",
    "texto5": "The pawn can only move forward one square at a time.",
    "texto6": "El peón solo puede avanzar una casilla a la vez."
  },
  {
    "texto1": "Un verbo que describe la acción de dejar un objeto de valor, como joyas o un aparato electrónico, como garantía en una casa de empeños para recibir un préstamo de dinero.",
    "texto2": "Empeñar",
    "texto3": "pawn /pɔːn/",
    "texto4": "pawned / will pawn / pawning",
    "texto5": "She had to pawn her grandmother's ring to pay for the rent.",
    "texto6": "Ella tuvo que empeñar el anillo de su abuela para pagar el alquiler."
  },
  {
    "texto1": "Un sustantivo que se usa en lenguaje figurado para describir a una persona que está siendo manipulada o utilizada por otros para lograr un objetivo que no es propio.",
    "texto2": "Peón / Títere",
    "texto3": "pawn /pɔːn/",
    "texto4": "N/A",
    "texto5": "He thought he was making his own decisions, but he was really just a pawn in the CEO's scheme.",
    "texto6": "Él creía que estaba tomando sus propias decisiones, pero en realidad era solo un peón en el plan del director ejecutivo."
  },
  {
    "texto1": "Un verbo que describe la acción de hacer que alguien crea algo que no es verdad, a menudo con la intención de obtener una ventaja personal. Implica engaño, mentira o un acto de deshonestidad.",
    "texto2": "Engañar / Mentir / Charlatanear",
    "texto3": "deceive /dɪˈsiːv/",
    "texto4": "deceived / will deceive / deceiving",
    "texto5": "He tried to deceive me into thinking he was a doctor.",
    "texto6": "Él intentó engañarme para que pensara que era un doctor."
  },
  {
    "texto1": "Un verbo que describe el acto de ocultar la verdad o dar una impresión falsa sobre una situación, un hecho o una persona. Se usa comúnmente en un contexto de traición o deshonestidad deliberada.",
    "texto2": "Engañar / Falsificar",
    "texto3": "deceive /dɪˈsiːv/",
    "texto4": "deceived / will deceive / deceiving",
    "texto5": "She deceived her friends by pretending to be rich.",
    "texto6": "Ella engañó a sus amigos fingiendo ser rica."
  },
  {
    "texto1": "Un verbo que se usa para describir el acto de hacer que alguien pierda la confianza en algo o en alguien, a menudo mediante una traición o un engaño.",
    "texto2": "Decepcionar / Fallar",
    "texto3": "deceive /dɪˈsiːv/",
    "texto4": "deceived / will deceive / deceiving",
    "texto5": "He deceived my expectations and failed the exam.",
    "texto6": "Él decepcionó mis expectativas y reprobó el examen."
  },
  {
    "texto1": "Un adjetivo que describe algo que es apropiado, correcto o adecuado para una situación o propósito particular. También puede referirse a algo que es respetable, formal, o a la forma 'correcta' de hacer algo.",
    "texto2": "Adecuado / Apropiado / Correcto / Propio",
    "texto3": "proper /ˈprɑːpər/",
    "texto4": "N/A",
    "texto5": "It's not proper to wear jeans to a formal wedding.",
    "texto6": "No es apropiado usar jeans en una boda formal."
  },
  {
    "texto1": "Un adjetivo que se usa para describir algo que es de buena calidad, auténtico, o lo que se espera que sea, a menudo en un sentido de seriedad o de formalidad.",
    "texto2": "Auténtico / Genuino / Real",
    "texto3": "proper /ˈprɑːpər/",
    "texto4": "N/A",
    "texto5": "We need to get a proper shovel to dig this hole.",
    "texto6": "Necesitamos conseguir una pala de verdad para cavar este hoyo."
  },
  {
    "texto1": "Un adjetivo que se usa para describir a una persona, cosa o lugar que es considerado de la alta sociedad o que se comporta de una manera formal y respetable.",
    "texto2": "Decente / Respetable / Formal",
    "texto3": "proper /ˈprɑːpər/",
    "texto4": "N/A",
    "texto5": "She comes from a proper family and has excellent manners.",
    "texto6": "Ella proviene de una familia decente y tiene excelentes modales."
  },
  {
    "texto1": "Un adjetivo que se usa para enfatizar que algo es el nombre o término exacto o correcto para un objeto, lugar o concepto. Se usa a menudo en la frase 'the proper name'.",
    "texto2": "Propio / Exacto",
    "texto3": "proper /ˈprɑːpər/",
    "texto4": "N/A",
    "texto5": "In proper English, you should say 'thank you' and not 'thanks'.",
    "texto6": "En el inglés apropiado, debes decir 'thank you' y no 'thanks'."
  },
  {
    "texto1": "Un sustantivo que se refiere a un camino o sendero, especialmente en una zona rural o boscosa. También se usa como verbo para describir la acción de seguir a alguien o algo de cerca o para arrastrar algo detrás de uno.",
    "texto2": "Sendero / Pista / Rastro",
    "texto3": "trail /treɪl/",
    "texto4": "N/A",
    "texto5": "We followed the trail through the forest to reach the lake.",
    "texto6": "Seguimos el sendero por el bosque para llegar al lago."
  },
  {
    "texto1": "Un sustantivo que se refiere a una serie de huellas, marcas, o un rastro que se deja atrás, lo que permite seguir a alguien o algo. Puede ser literal, como huellas en la nieve, o figurado, como un rastro de destrucción.",
    "texto2": "Rastro / Huella",
    "texto3": "trail /treɪl/",
    "texto4": "N/A",
    "texto5": "The police dogs picked up the trail of the missing person.",
    "texto6": "Los perros policía siguieron el rastro de la persona desaparecida."
  },
  {
    "texto1": "Un verbo que describe la acción de arrastrar algo por el suelo o detrás de uno. También puede usarse para describir el acto de seguir a alguien o algo a distancia.",
    "texto2": "Arrastrar / Seguir",
    "texto3": "trail /treɪl/",
    "texto4": "trailed / will trail / trailing",
    "texto5": "The dog's leash trailed behind him as he ran.",
    "texto6": "La correa del perro se arrastraba detrás de él mientras corría."
  },
  {
    "texto1": "Un verbo que se usa para describir la acción de ir detrás de alguien, como un competidor, o de estar en una posición de menor éxito en una carrera o un juego.",
    "texto2": "Ir detrás / Estar a la zaga",
    "texto3": "trail /treɪl/",
    "texto4": "trailed / will trail / trailing",
    "texto5": "Our team is trailing by ten points with only a minute left in the game.",
    "texto6": "Nuestro equipo va a la zaga por diez puntos con solo un minuto restante en el juego."
  }
]
