[
  {
    "texto1": "Verbo que describe el acto de existir o tener vida, especialmente en un lugar específico o bajo ciertas condiciones.",
    "texto2": "vivir / habitar",
    "texto3": "live / lɪv /",
    "texto4": "lived / will live / living",
    "texto5": "Most developers live in urban areas with strong tech industries.",
    "texto6": "La mayoría de los desarrolladores viven en áreas urbanas con sólidas industrias tecnológicas."
  },
  {
    "texto1": "Adjetivo que describe una transmisión o evento que ocurre en tiempo real, sin retraso o grabación previa.",
    "texto2": "en vivo / en directo",
    "texto3": "live / laɪv /",
    "texto4": "n/a",
    "texto5": "We'll stream the product launch event live on our YouTube channel.",
    "texto6": "Transmitiremos el lanzamiento del producto en vivo en nuestro canal de YouTube."
  },
  {
    "texto1": "Adverbio que indica que algo está sucediendo en tiempo real, especialmente en transmisiones o eventos.",
    "texto2": "en vivo / en directo",
    "texto3": "live / laɪv /",
    "texto4": "n/a",
    "texto5": "The conference keynote will be broadcast live to remote participants.",
    "texto6": "La conferencia principal se transmitirá en vivo a participantes remotos."
  },
  {
    "texto1": "Verbo que significa experimentar algo directamente o en primera persona.",
    "texto2": "experimentar / presenciar",
    "texto3": "live / lɪv /",
    "texto4": "lived / will live / living",
    "texto5": "Developers live through multiple framework changes during their careers.",
    "texto6": "Los desarrolladores experimentan múltiples cambios de frameworks durante sus carreras."
  },
  {
    "texto1": "Sustantivo que se refiere al planeta Tierra o a la totalidad de la existencia humana y su entorno.",
    "texto2": "mundo / planeta",
    "texto3": "world / wɜːrld /",
    "texto4": "worlds / n/a",
    "texto5": "Open-source software has changed the world of technology.",
    "texto6": "El software de código abierto ha cambiado el mundo de la tecnología."
  },
  {
    "texto1": "Sustantivo que describe un dominio, campo o entorno específico, especialmente en contextos profesionales o técnicos.",
    "texto2": "ámbito / entorno / campo",
    "texto3": "world / wɜːrld /",
    "texto4": "worlds / n/a",
    "texto5": "In the world of cybersecurity, constant vigilance is essential.",
    "texto6": "En el ámbito de la ciberseguridad, la vigilancia constante es esencial."
  },
  {
    "texto1": "Sustantivo que se refiere a la totalidad de un sistema o entorno digital.",
    "texto2": "mundo / entorno",
    "texto3": "world / wɜːrld /",
    "texto4": "worlds / n/a",
    "texto5": "Virtual reality creates immersive digital worlds for users.",
    "texto6": "La realidad virtual crea mundos digitales inmersivos para los usuarios."
  },
  {
    "texto1": "Sustantivo que indica la esfera de operación o influencia de algo.",
    "texto2": "entorno / esfera",
    "texto3": "world / wɜːrld /",
    "texto4": "worlds / n/a",
    "texto5": "Containerization has revolutionized the world of software deployment.",
    "texto6": "La contenerización ha revolucionado el entorno de despliegue de software."
  },
  {
    "texto1": "Sustantivo que denota un período de siete días, comúnmente usado para planificación y programación.",
    "texto2": "semana",
    "texto3": "week / wiːk /",
    "texto4": "weeks / n/a",
    "texto5": "We deploy updates to production every Tuesday of the week.",
    "texto6": "Desplegamos actualizaciones a producción cada martes de la semana."
  },
  {
    "texto1": "Sustantivo que se refiere específicamente al período laboral de cinco días (lunes a viernes).",
    "texto2": "semana laboral",
    "texto3": "week / wiːk /",
    "texto4": "weeks / n/a",
    "texto5": "The development team works remotely three days during the work week.",
    "texto6": "El equipo de desarrollo trabaja remotamente tres días durante la semana laboral."
  },
  {
    "texto1": "Sustantivo que indica un período de siete días consecutivos a partir de cualquier punto.",
    "texto2": "semana",
    "texto3": "week / wiːk /",
    "texto4": "weeks / n/a",
    "texto5": "The sprint planning must be completed within the next calendar week.",
    "texto6": "La planificación del sprint debe completarse dentro de la próxima semana calendario."
  },
  {
    "texto1": "Verbo que se refiere a la ejecución o reproducción de contenido multimedia.",
    "texto2": "reproducir / ejecutar",
    "texto3": "play / pleɪ /",
    "texto4": "played / will play / playing",
    "texto5": "Click the button to play the instructional video.",
    "texto6": "Haz clic en el botón para reproducir el video instructivo."
  },
  {
    "texto1": "Verbo que describe la interacción con sistemas o interfaces de manera interactiva.",
    "texto2": "interactuar / utilizar",
    "texto3": "play / pleɪ /",
    "texto4": "played / will play / playing",
    "texto5": "Quality assurance testers play with the software to find bugs.",
    "texto6": "Los testers de control de calidad interactúan con el software para encontrar errores."
  },
  {
    "texto1": "Verbo que indica el papel o función que algo tiene en un sistema o proceso.",
    "texto2": "desempeñar / cumplir",
    "texto3": "play / pleɪ /",
    "texto4": "played / will play / playing",
    "texto5": "APIs play a crucial role in microservices architecture.",
    "texto6": "Las APIs desempeñan un papel crucial en la arquitectura de microservicios."
  },
  {
    "texto1": "Sustantivo que se refiere a software o hardware que permite la reproducción de medios.",
    "texto2": "reproductor",
    "texto3": "play / pleɪ /",
    "texto4": "n/a",
    "texto5": "The new video play feature supports 4K resolution.",
    "texto6": "La nueva función de reproductor de video soporta resolución 4K."
  },
  {
    "texto1": "Verbo que significa poner en funcionamiento o activar un proceso.",
    "texto2": "ejecutar / activar",
    "texto3": "play / pleɪ /",
    "texto4": "played / will play / playing",
    "texto5": "Play the script to automate the deployment process.",
    "texto6": "Ejecuta el script para automatizar el proceso de despliegue."
  },
  {
    "texto1": "Verbo modal que expresa posibilidad o probabilidad, menos seguro que 'may'.",
    "texto2": "podría / quizás",
    "texto3": "might / maɪt /",
    "texto4": "n/a (verbo modal)",
    "texto5": "This optimization might improve the application's performance.",
    "texto6": "Esta optimización podría mejorar el rendimiento de la aplicación."
  },
  {
    "texto1": "Verbo modal que indica una sugerencia o posibilidad educada.",
    "texto2": "podría (sugerencia)",
    "texto3": "might / maɪt /",
    "texto4": "n/a (verbo modal)",
    "texto5": "You might consider using a CDN for faster content delivery.",
    "texto6": "Podrías considerar usar una CDN para una entrega de contenido más rápida."
  },
  {
    "texto1": "Sustantivo que denota fuerza, poder o capacidad.",
    "texto2": "poder / fuerza",
    "texto3": "might / maɪt /",
    "texto4": "n/a",
    "texto5": "The full might of the cloud computing platform was utilized during peak traffic.",
    "texto6": "Se utilizó todo el poder de la plataforma de computación en la nube durante el tráfico pico."
  },
  {
    "texto1": "Verbo modal que expresa obligación o necesidad fuerte, indicando que algo es esencial o requerido.",
    "texto2": "debe / tiene que",
    "texto3": "must / mʌst /",
    "texto4": "n/a (verbo modal)",
    "texto5": "Developers must follow security protocols when handling user data.",
    "texto6": "Los desarrolladores deben seguir protocolos de seguridad al manejar datos de usuarios."
  },
  {
    "texto1": "Sustantivo que se refiere a algo esencial o indispensable, especialmente en contextos técnicos o de requisitos.",
    "texto2": "requisito / necesidad",
    "texto3": "must / mʌst /",
    "texto4": "musts / n/a",
    "texto5": "Version control is a must for any collaborative coding project.",
    "texto6": "El control de versiones es un requisito para cualquier proyecto de codificación colaborativo."
  },
  {
    "texto1": "Sustantivo que se refiere al lugar donde vive una persona o a un espacio que se percibe como propio y seguro.",
    "texto2": "hogar / casa",
    "texto3": "home / hoʊm /",
    "texto4": "homes / n/a",
    "texto5": "After a long trip, it feels good to be home again.",
    "texto6": "Después de un largo viaje, se siente bien volver a casa."
  },
  {
    "texto1": "Sustantivo que se refiere al directorio principal o página inicial en sistemas informáticos y sitios web.",
    "texto2": "directorio principal / página de inicio",
    "texto3": "home / hoʊm /",
    "texto4": "homes / n/a",
    "texto5": "Save your configuration files in your home directory for easy access.",
    "texto6": "Guarda tus archivos de configuración en tu directorio principal para un fácil acceso."
  },
  {
    "texto1": "Adjetivo que describe algo diseñado para uso doméstico o personal en contextos tecnológicos.",
    "texto2": "doméstico / para el hogar",
    "texto3": "home / hoʊm /",
    "texto4": "n/a",
    "texto5": "The home version of this software has limited enterprise features.",
    "texto6": "La versión doméstica de este software tiene funciones empresariales limitadas."
  },
  {
    "texto1": "Adverbio que indica el retorno a una posición o estado predeterminado en interfaces y sistemas.",
    "texto2": "a inicio / a posición inicial",
    "texto3": "home / hoʊm /",
    "texto4": "n/a",
    "texto5": "Press the home button to return to the main screen of the application.",
    "texto6": "Presiona el botón de inicio para volver a la pantalla principal de la aplicación."
  },
  {
    "texto1": "Verbo que significa dirigirse o apuntar hacia un objetivo específico, especialmente en interfaces de usuario.",
    "texto2": "dirigirse a / enfocarse en",
    "texto3": "home / hoʊm /",
    "texto4": "homed / will home / homing",
    "texto5": "The AI assistant homes in on the most relevant documentation for your query.",
    "texto6": "El asistente de IA se dirige a la documentación más relevante para tu consulta."
  },
  {
    "texto1": "Adverbio que indica la ausencia total de ocurrencia de algo en cualquier momento, pasado o futuro.",
    "texto2": "nunca / jamás",
    "texto3": "never / ˈnɛvər /",
    "texto4": "n/a",
    "texto5": "Never commit sensitive credentials like API keys to public repositories.",
    "texto6": "Nunca subas credenciales sensibles como claves API a repositorios públicos."
  },
  {
    "texto1": "Adverbio que enfatiza una prohibición o advertencia fuerte en contextos técnicos y de seguridad.",
    "texto2": "nunca / bajo ninguna circunstancia",
    "texto3": "never / ˈnɛvər /",
    "texto4": "n/a",
    "texto5": "Never disable firewall protections when working on public networks.",
    "texto6": "Jamás desactives las protecciones de firewall cuando trabajes en redes públicas."
  },
  {
    "texto1": "Verbo transitivo que significa incorporar o contener algo como parte de un todo, especialmente en código y documentación.",
    "texto2": "incluir / incorporar",
    "texto3": "include / ɪnˈkluːd /",
    "texto4": "included / will include / including",
    "texto5": "Always include error handling in your functions to prevent crashes.",
    "texto6": "Siempre incluye manejo de errores en tus funciones para prevenir caídas."
  },
  {
    "texto1": "Directiva de preprocesador en lenguajes como C/C++ que inserta el contenido de otro archivo.",
    "texto2": "incluir (directiva)",
    "texto3": "include / ɪnˈkluːd /",
    "texto4": "n/a",
    "texto5": "Use #include <stdio.h> to access standard input/output functions.",
    "texto6": "Usa #include <stdio.h> para acceder a funciones estándar de entrada/salida."
  },
  {
    "texto1": "Sustantivo que se refiere a un archivo o módulo que es incorporado en otro archivo de código.",
    "texto2": "inclusión / archivo incluido",
    "texto3": "include / ɪnˈkluːd /",
    "texto4": "includes / n/a",
    "texto5": "The header includes contain all the necessary function declarations.",
    "texto6": "Las inclusiones de cabecera contienen todas las declaraciones de funciones necesarias."
  },
  {
    "texto1": "Sustantivo que se refiere a un programa estructurado de aprendizaje, especialmente en tecnología y programación.",
    "texto2": "curso / programa",
    "texto3": "course / kɔːrs /",
    "texto4": "courses / n/a",
    "texto5": "I completed an online course on machine learning algorithms last month.",
    "texto6": "Completé un curso en línea sobre algoritmos de aprendizaje automático el mes pasado."
  },
  {
    "texto1": "Sustantivo que describe la dirección o progresión de algo en el tiempo, especialmente en desarrollo de software.",
    "texto2": "curso / desarrollo",
    "texto3": "course / kɔːrs /",
    "texto4": "courses / n/a",
    "texto5": "During the course of development, we identified several performance bottlenecks.",
    "texto6": "Durante el curso del desarrollo, identificamos varios cuellos de botella de rendimiento."
  },
  {
    "texto1": "Sustantivo que indica una secuencia de acciones o pasos en un proceso tecnológico.",
    "texto2": "trayectoria / secuencia",
    "texto3": "course / kɔːrs /",
    "texto4": "courses / n/a",
    "texto5": "The debugging course involved checking logs, replicating errors, and testing fixes.",
    "texto6": "La trayectoria de depuración implicó revisar registros, replicar errores y probar correcciones."
  },
  {
    "texto1": "Verbo que describe el flujo o movimiento de datos a través de un sistema.",
    "texto2": "fluir / circular",
    "texto3": "course / kɔːrs /",
    "texto4": "coursed / will course / coursing",
    "texto5": "Data courses through the pipeline at a rate of 1GB per second.",
    "texto6": "Los datos fluyen a través del pipeline a una velocidad de 1GB por segundo."
  },
  {
    "texto1": "Sustantivo que se refiere a un edificio para habitar, especialmente como residencia de personas o familias.",
    "texto2": "casa / vivienda / residencia",
    "texto3": "house / haʊs /",
    "texto4": "houses / n/a",
    "texto5": "The smart home system controls all devices in the house remotely.",
    "texto6": "El sistema de hogar inteligente controla todos los dispositivos en la casa remotamente."
  },
  {
    "texto1": "Sustantivo que se refiere a una empresa o institución, especialmente en contextos comerciales y tecnológicos.",
    "texto2": "empresa / compañía / firma",
    "texto3": "house / haʊs /",
    "texto4": "houses / n/a",
    "texto5": "The software house developed a custom CRM solution for the client.",
    "texto6": "La empresa de software desarrolló una solución CRM personalizada para el cliente."
  },
  {
    "texto1": "Verbo que significa almacenar o contener algo, especialmente en contextos tecnológicos y de infraestructura.",
    "texto2": "albergar / contener / hospedar",
    "texto3": "house / haʊs /",
    "texto4": "housed / will house / housing",
    "texto5": "The data center houses thousands of servers for cloud computing.",
    "texto6": "El centro de datos alberga miles de servidores para computación en la nube."
  },
  {
    "texto1": "Sustantivo que describe un tipo de música electrónica, pero también se usa para referirse a grupos o equipos en entornos colaborativos.",
    "texto2": "grupo / equipo / colectivo",
    "texto3": "house / haʊs /",
    "texto4": "houses / n/a",
    "texto5": "Our development house consists of frontend, backend, and DevOps specialists.",
    "texto6": "Nuestro grupo de desarrollo consiste en especialistas de frontend, backend y DevOps."
  },
  {
    "texto1": "Sustantivo que describe un documento formal que presenta información organizada, especialmente en contextos profesionales y técnicos.",
    "texto2": "informe / reporte",
    "texto3": "report / rɪˈpɔːrt /",
    "texto4": "reports / n/a",
    "texto5": "The quarterly performance report shows a 20% improvement in system uptime.",
    "texto6": "El informe de rendimiento trimestral muestra una mejora del 20% en el tiempo de actividad del sistema."
  },
  {
    "texto1": "Verbo que significa comunicar información, especialmente sobre eventos, hallazgos o resultados.",
    "texto2": "informar / reportar",
    "texto3": "report / rɪˈpɔːrt /",
    "texto4": "reported / will report / reporting",
    "texto5": "The monitoring system reports any anomalies in real-time.",
    "texto6": "El sistema de monitoreo informa cualquier anomalía en tiempo real."
  },
  {
    "texto1": "Sustantivo que se refiere a la función o módulo de software que genera resúmenes de datos.",
    "texto2": "reporte / generador de informes",
    "texto3": "report / rɪˈpɔːrt /",
    "texto4": "reports / n/a",
    "texto5": "Use the analytics report feature to visualize user engagement metrics.",
    "texto6": "Usa la función de reporte de análisis para visualizar métricas de engagement de usuarios."
  },
  {
    "texto1": "Verbo que indica presentarse o registrarse en un lugar o sistema.",
    "texto2": "presentarse / registrarse",
    "texto3": "report / rɪˈpɔːrt /",
    "texto4": "reported / will report / reporting",
    "texto5": "New employees must report to the IT department for their access credentials.",
    "texto6": "Los nuevos empleados deben presentarse en el departamento de TI para obtener sus credenciales de acceso."
  },
  {
    "texto1": "Sustantivo que denota una colección de personas o cosas consideradas como una unidad, especialmente en contextos organizacionales y tecnológicos.",
    "texto2": "grupo / conjunto",
    "texto3": "group / ɡruːp /",
    "texto4": "groups / n/a",
    "texto5": "Create a user group with specific permissions for this application.",
    "texto6": "Crea un grupo de usuarios con permisos específicos para esta aplicación."
  },
  {
    "texto1": "Verbo que significa organizar o clasificar elementos relacionados juntos, especialmente en interfaces y sistemas.",
    "texto2": "agrupar / clasificar",
    "texto3": "group / ɡruːp /",
    "texto4": "grouped / will group / grouping",
    "texto5": "Group related functions together in the codebase for better maintainability.",
    "texto6": "Agrupa funciones relacionadas en la base de código para una mejor mantenibilidad."
  },
  {
    "texto1": "Sustantivo que se refiere a una categoría de elementos similares en sistemas de clasificación.",
    "texto2": "categoría / clasificación",
    "texto3": "group / ɡruːp /",
    "texto4": "groups / n/a",
    "texto5": "The security group settings determine network access permissions.",
    "texto6": "Los ajustes de categoría de seguridad determinan los permisos de acceso a la red."
  },
  {
    "texto1": "Sustantivo que describe una unidad organizacional dentro de una empresa o proyecto.",
    "texto2": "equipo / división",
    "texto3": "group / ɡruːp /",
    "texto4": "groups / n/a",
    "texto5": "The focus group provided valuable feedback on the new UI design.",
    "texto6": "El equipo focalizado proporcionó retroalimentación valiosa sobre el nuevo diseño de interfaz."
  },
  {
    "texto1": "Sustantivo que describe una instancia particular o ejemplo de algo, especialmente en contextos técnicos y de resolución de problemas.",
    "texto2": "caso / ejemplo / instancia",
    "texto3": "case / keɪs /",
    "texto4": "cases / n/a",
    "texto5": "In this case, the error occurs due to memory allocation issues.",
    "texto6": "En este caso, el error ocurre debido a problemas de asignación de memoria."
  },
  {
    "texto1": "Sustantivo que se refiere a un contenedor o cubierta protectora para dispositivos electrónicos.",
    "texto2": "caja / estuche / carcasa",
    "texto3": "case / keɪs /",
    "texto4": "cases / n/a",
    "texto5": "Always use a protective case when transporting your laptop.",
    "texto6": "Siempre usa una carcasa protectora al transportar tu computadora portátil."
  },
  {
    "texto1": "Sustantivo que en programación denota una estructura de control condicional.",
    "texto2": "caso / situación",
    "texto3": "case / keɪs /",
    "texto4": "cases / n/a",
    "texto5": "Use a switch case statement for cleaner conditional logic.",
    "texto6": "Usa una declaración switch case para una lógica condicional más limpia."
  },
  {
    "texto1": "Verbo que significa investigar o examinar, especialmente en contexto de seguridad informática.",
    "texto2": "investigar / examinar",
    "texto3": "case / keɪs /",
    "texto4": "cased / will case / casing",
    "texto5": "The security team will case the network for vulnerabilities.",
    "texto6": "El equipo de seguridad investigará la red en busca de vulnerabilidades."
  },
  {
    "texto1": "Sustantivo que se refiere a una persona adulta de género femenino, especialmente en contextos demográficos y de experiencia de usuario.",
    "texto2": "mujer / adulta femenina",
    "texto3": "woman / ˈwʊmən /",
    "texto4": "women / n/a",
    "texto5": "The lead designer, a woman with 15 years of experience, presented the new UX flow.",
    "texto6": "La diseñadora principal, una mujer con 15 años de experiencia, presentó el nuevo flujo de UX."
  },
  {
    "texto1": "Sustantivo que describe profesionales femeninas en campos tecnológicos y científicos.",
    "texto2": "mujer / profesional femenina",
    "texto3": "woman / ˈwʊmən /",
    "texto4": "women / n/a",
    "texto5": "Women in Tech initiatives aim to bridge the gender gap in STEM fields.",
    "texto6": "Las iniciativas de Mujeres en Tecnología buscan cerrar la brecha de género en campos STEM."
  },
  {
    "texto1": "Adjetivo que describe características o aspectos relacionados con lo femenino en diseño y desarrollo de productos.",
    "texto2": "femenino / de mujer",
    "texto3": "woman / ˈwʊmən /",
    "texto4": "n/a",
    "texto5": "The ergonomic design includes woman-specific adjustments for comfort.",
    "texto6": "El diseño ergonómico incluye ajustes femeninos específicos para mayor comodidad."
  },
  {
    "texto1": "Preposición que indica ubicación en varios puntos o dirección no específica en un área",
    "texto2": "alrededor de / por / cerca de",
    "texto3": "around / əˈraʊnd /",
    "texto4": "n/a",
    "texto5": "The IT team installed sensors around the data center to monitor temperature.",
    "texto6": "El equipo de TI instaló sensores alrededor del centro de datos para monitorear la temperatura."
  },
  {
    "texto1": "Adverbio que significa aproximadamente o más o menos, usado para indicar estimaciones",
    "texto2": "aproximadamente / más o menos",
    "texto3": "around / əˈraʊnd /",
    "texto4": "n/a",
    "texto5": "The API response time is around 200 milliseconds under normal load.",
    "texto6": "El tiempo de respuesta de la API es aproximadamente 200 milisegundos bajo carga normal."
  },
  {
    "texto1": "Adverbio que indica disponibilidad o presencia en un lugar",
    "texto2": "disponible / presente",
    "texto3": "around / əˈraʊnd /",
    "texto4": "n/a",
    "texto5": "Is the network administrator around? We need to troubleshoot the firewall.",
    "texto6": "¿Está disponible el administrador de red? Necesitamos solucionar problemas del firewall."
  },
  {
    "texto1": "Verbo que significa circular o moverse en un área",
    "texto2": "circular / moverse",
    "texto3": "around / əˈraʊnd /",
    "texto4": "rounded / will round / rounding",
    "texto5": "The drone rounded around the building to inspect the cellular antennas.",
    "texto6": "El dron circuló alrededor del edificio para inspeccionar las antenas celulares."
  },
  {
    "texto1": "Sustantivo que se refiere a un conjunto de páginas encuadernadas para leer o escribir",
    "texto2": "libro / volumen",
    "texto3": "book / bʊk /",
    "texto4": "books / n/a",
    "texto5": "The product manager keeps a book of user stories for the development team.",
    "texto6": "El gerente de producto mantiene un libro de historias de usuario para el equipo de desarrollo."
  },
  {
    "texto1": "Verbo que significa reservar o registrar algo para uso futuro",
    "texto2": "reservar / agendar",
    "texto3": "book / bʊk /",
    "texto4": "booked / will book / booking",
    "texto5": "Book a conference room for the sprint planning meeting next Monday.",
    "texto6": "Reserva una sala de conferencias para la reunión de planificación del sprint el próximo lunes."
  },
  {
    "texto1": "Sustantivo que en contabilidad se refiere a registros financieros",
    "texto2": "registros / contabilidad",
    "texto3": "book / bʊk /",
    "texto4": "books / n/a",
    "texto5": "The finance department closed the books using the new accounting software.",
    "texto6": "El departamento de finanzas cerró los registros usando el nuevo software contable."
  },
  {
    "texto1": "Verbo que significa cargar formalmente o acusar en contextos legales",
    "texto2": "acusar / imputar",
    "texto3": "book / bʊk /",
    "texto4": "booked / will book / booking",
    "texto5": "The hacker was booked for violating cybersecurity laws.",
    "texto6": "El hacker fue acusado por violar leyes de ciberseguridad."
  },
  {
    "texto1": "Sustantivo que describe un grupo de personas relacionadas por parentesco",
    "texto2": "familia / parientes",
    "texto3": "family / ˈfæməli /",
    "texto4": "families / n/a",
    "texto5": "The company offers family health benefits to all full-time employees.",
    "texto6": "La empresa ofrece beneficios de salud familiar a todos los empleados a tiempo completo."
  },
  {
    "texto1": "Sustantivo que en taxonomía y programación se refiere a un grupo de elementos relacionados",
    "texto2": "familia / grupo",
    "texto3": "family / ˈfæməli /",
    "texto4": "families / n/a",
    "texto5": "The UTF-8 character encoding belongs to the Unicode family of standards.",
    "texto6": "La codificación de caracteres UTF-8 pertenece a la familia de estándares Unicode."
  },
  {
    "texto1": "Adjetivo que describe productos o servicios diseñados para uso doméstico",
    "texto2": "familiar / doméstico",
    "texto3": "family / ˈfæməli /",
    "texto4": "n/a",
    "texto5": "This family plan allows sharing cloud storage with up to five users.",
    "texto6": "Este plan familiar permite compartir almacenamiento en la nube con hasta cinco usuarios."
  },
  {
    "texto1": "Verbo copulativo que indica apariencia o impresión subjetiva",
    "texto2": "parecer / aparentar",
    "texto3": "seem / siːm /",
    "texto4": "seemed / will seem / seeming",
    "texto5": "The bug seems to occur only in the mobile version of the application.",
    "texto6": "El error parece ocurrir solo en la versión móvil de la aplicación."
  },
  {
    "texto1": "Verbo que expresa percepción subjetiva basada en evidencia incompleta",
    "texto2": "dar la impresión / sugerir",
    "texto3": "seem / siːm /",
    "texto4": "seemed / will seem / seeming",
    "texto5": "The network latency seems to be affecting the API response times.",
    "texto6": "La latencia de la red da la impresión de estar afectando los tiempos de respuesta de la API."
  },
  {
    "texto1": "Verbo que significa permitir o autorizar algo",
    "texto2": "permitir / autorizar",
    "texto3": "let / lɛt /",
    "texto4": "let / will let / letting",
    "texto5": "The system admin will let you access the server logs for debugging.",
    "texto6": "El administrador del sistema te permitirá acceder a los registros del servidor para depuración."
  },
  {
    "texto1": "Verbo que en programación se usa para declarar variables con alcance de bloque",
    "texto2": "declarar (variables) / permitir",
    "texto3": "let / lɛt /",
    "texto4": "let / will let / letting",
    "texto5": "Use let instead of var to declare block-scoped variables in JavaScript.",
    "texto6": "Usa let en lugar de var para declarar variables con alcance de bloque en JavaScript."
  },
  {
    "texto1": "Verbo que significa alquilar o arrendar propiedad",
    "texto2": "alquilar / arrendar",
    "texto3": "let / lɛt /",
    "texto4": "let / will let / letting",
    "texto5": "The company lets office space to startups in the tech park.",
    "texto6": "La empresa alquila espacio de oficinas a startups en el parque tecnológico."
  },
  {
    "texto1": "Verbo que significa no impedir o no prevenir",
    "texto2": "dejar / no impedir",
    "texto3": "let / lɛt /",
    "texto4": "let / will let / letting",
    "texto5": "Let the process complete before shutting down the system.",
    "texto6": "Deja que el proceso se complete antes de apagar el sistema."
  },
  {
    "texto1": "Adverbio que indica repetición de una acción o evento.",
    "texto2": "de nuevo / otra vez",
    "texto3": "again / əˈɡen /",
    "texto4": "n/a",
    "texto5": "If the build fails, run the tests again to identify the issue.",
    "texto6": "Si la compilación falla, ejecuta las pruebas de nuevo para identificar el problema."
  },
  {
    "texto1": "Adverbio que significa adicionalmente o además.",
    "texto2": "además / por otra parte",
    "texto3": "again / əˈɡen /",
    "texto4": "n/a",
    "texto5": "The framework is lightweight and again, highly extensible for custom needs.",
    "texto6": "El framework es liviano y además, altamente extensible para necesidades personalizadas."
  },
  {
    "texto1": "Sustantivo que denota una categoría o tipo con características similares.",
    "texto2": "tipo / clase / variedad",
    "texto3": "kind / kaɪnd /",
    "texto4": "kinds / n/a",
    "texto5": "What kind of database schema works best for this application?",
    "texto6": "¿Qué tipo de esquema de base de datos funciona mejor para esta aplicación?"
  },
  {
    "texto1": "Adjetivo que describe a alguien que es amable, considerado o bondadoso.",
    "texto2": "amable / bondadoso / considerado",
    "texto3": "kind / kaɪnd /",
    "texto4": "kinder / kindest / n/a",
    "texto5": "Be kind when reviewing junior developers' code submissions.",
    "texto6": "Sé amable al revisar las entregas de código de los desarrolladores junior."
  },
  {
    "texto1": "Verbo transitivo que significa mantener algo en un estado particular.",
    "texto2": "mantener / conservar",
    "texto3": "keep / kiːp /",
    "texto4": "kept / will keep / keeping",
    "texto5": "Keep the API endpoints consistent across all microservices.",
    "texto6": "Mantén los endpoints de la API consistentes en todos los microservicios."
  },
  {
    "texto1": "Verbo transitivo que significa guardar o almacenar algo para uso futuro.",
    "texto2": "guardar / almacenar",
    "texto3": "keep / kiːp /",
    "texto4": "kept / will keep / keeping",
    "texto5": "Always keep backup copies of your production database.",
    "texto6": "Siempre guarda copias de respaldo de tu base de datos de producción."
  },
  {
    "texto1": "Verbo que se usa con gerundio para indicar continuidad en una acción.",
    "texto2": "seguir / continuar",
    "texto3": "keep / kiːp /",
    "texto4": "kept / will keep / keeping",
    "texto5": "The service keeps logging errors even after the patch was applied.",
    "texto6": "El servicio sigue registrando errores incluso después de aplicar el parche."
  },
  {
    "texto1": "Expresión idiomática para proponer mantener la comunicación con alguien en el futuro.",
    "texto2": "mantenerse en contacto / seguir en contacto",
    "texto3": "keep in touch / kiːp ɪn tʌtʃ /",
    "texto4": "kept / will keep / keeping",
    "texto5": "It was great working with you. Let's keep in touch!",
    "texto6": "Fue un placer trabajar contigo. ¡Mantengámonos en contacto!"
  },
  {
    "texto1": "Verbo transitivo que significa percibir sonidos con los oídos.",
    "texto2": "oír / escuchar",
    "texto3": "hear / hɪr /",
    "texto4": "heard / will hear / hearing",
    "texto5": "Can you hear the server fans? They might indicate overheating.",
    "texto6": "¿Puedes oír los ventiladores del servidor? Podrían indicar sobrecalentamiento."
  },
  {
    "texto1": "Verbo transitivo que significa recibir información o noticias sobre algo.",
    "texto2": "enterarse / saber",
    "texto3": "hear / hɪr /",
    "texto4": "heard / will hear / hearing",
    "texto5": "We just heard about the new security vulnerability affecting our stack.",
    "texto6": "Acabamos de enterarnos de la nueva vulnerabilidad de seguridad que afecta nuestro stack."
  },
  {
    "texto1": "Verbo transitivo que se refiere a considerar una petición o caso formalmente.",
    "texto2": "atender / considerar",
    "texto3": "hear / hɪr /",
    "texto4": "heard / will hear / hearing",
    "texto5": "The ethics committee will hear concerns about AI bias in our algorithms.",
    "texto6": "El comité de ética atenderá las preocupaciones sobre sesgo de IA en nuestros algoritmos."
  },
  {
    "texto1": "Sustantivo que denota un conjunto de componentes interrelacionados que funcionan como un todo.",
    "texto2": "sistema",
    "texto3": "system / ˈsɪstəm /",
    "texto4": "systems / n/a",
    "texto5": "The operating system manages hardware resources and software processes.",
    "texto6": "El sistema operativo gestiona recursos de hardware y procesos de software."
  },
  {
    "texto1": "Sustantivo que se refiere a un método organizado o conjunto de procedimientos.",
    "texto2": "sistema / método",
    "texto3": "system / ˈsɪstəm /",
    "texto4": "systems / n/a",
    "texto5": "Implement a version control system to track code changes efficiently.",
    "texto6": "Implementa un sistema de control de versiones para rastrear cambios de código eficientemente."
  },
  {
    "texto1": "Sustantivo que describe un entorno tecnológico completo.",
    "texto2": "sistema / entorno",
    "texto3": "system / ˈsɪstəm /",
    "texto4": "systems / n/a",
    "texto5": "The distributed system handles over 1 million requests per second.",
    "texto6": "El sistema distribuido maneja más de 1 millón de solicitudes por segundo."
  },
  {
    "texto1": "Determinante que indica cada miembro individual de un grupo completo sin excepción",
    "texto2": "cada / todo",
    "texto3": "every / ˈɛvri /",
    "texto4": "n/a",
    "texto5": "Every commit must pass automated tests before merging into the main branch.",
    "texto6": "Cada commit debe pasar pruebas automatizadas antes de fusionarse en la rama principal."
  },
  {
    "texto1": "Determinante que enfatiza la totalidad en intervalos regulares",
    "texto2": "cada / todos los",
    "texto3": "every / ˈɛvri /",
    "texto4": "n/a",
    "texto5": "We run security scans every Friday at 2 AM server time.",
    "texto6": "Ejecutamos escaneos de seguridad todos los viernes a las 2 AM hora del servidor."
  },
  {
    "texto1": "Sustantivo que denota una expresión interrogativa para obtener información",
    "texto2": "pregunta / interrogante",
    "texto3": "question / ˈkwɛsʧən /",
    "texto4": "questions / n/a",
    "texto5": "The FAQ section answers common questions about API usage.",
    "texto6": "La sección de preguntas frecuentes responde a interrogantes comunes sobre el uso de la API."
  },
  {
    "texto1": "Sustantivo que se refiere a un tema o problema que necesita solución",
    "texto2": "cuestión / problema",
    "texto3": "question / ˈkwɛsʧən /",
    "texto4": "questions / n/a",
    "texto5": "The scalability question remains our top priority this quarter.",
    "texto6": "La cuestión de escalabilidad sigue siendo nuestra máxima prioridad este trimestre."
  },
  {
    "texto1": "Verbo que significa dudar o desafiar la validez de algo",
    "texto2": "cuestionar / dudar",
    "texto3": "question / ˈkwɛsʧən /",
    "texto4": "questioned / will question / questioning",
    "texto5": "We should question the security implications of this third-party library.",
    "texto6": "Deberíamos cuestionar las implicaciones de seguridad de esta biblioteca de terceros."
  },
  {
    "texto1": "Adverbio que indica constancia o ausencia de excepción en el tiempo",
    "texto2": "siempre / constantemente",
    "texto3": "always / ˈɔːlweɪz /",
    "texto4": "n/a",
    "texto5": "Always encrypt sensitive data both at rest and in transit.",
    "texto6": "Siempre cifra datos sensibles tanto en reposo como en tránsito."
  },
  {
    "texto1": "Adverbio que enfatiza persistencia o repetición continua",
    "texto2": "siempre / invariablemente",
    "texto3": "always / ˈɔːlweɪz /",
    "texto4": "n/a",
    "texto5": "The system always logs detailed error messages for debugging purposes.",
    "texto6": "El sistema siempre registra mensajes de error detallados para propósitos de depuración."
  },
  {
    "texto1": "Adjetivo que describe algo de tamaño considerable o gran escala",
    "texto2": "grande / enorme / extenso",
    "texto3": "big / bɪɡ /",
    "texto4": "bigger / biggest / n/a",
    "texto5": "Big data technologies handle petabytes of information efficiently.",
    "texto6": "Las tecnologías de big data manejan petabytes de información eficientemente."
  },
  {
    "texto1": "Adjetivo que denota importancia significativa o impacto considerable",
    "texto2": "importante / significativo",
    "texto3": "big / bɪɡ /",
    "texto4": "bigger / biggest / n/a",
    "texto5": "The product launch was a big success, exceeding user acquisition targets.",
    "texto6": "El lanzamiento del producto fue un éxito importante, superando los objetivos de adquisición de usuarios."
  },
  {
    "texto1": "Verbo que significa establecer o configurar algo en un estado específico",
    "texto2": "establecer / configurar",
    "texto3": "set / sɛt /",
    "texto4": "set / will set / setting",
    "texto5": "Set the environment variables before deploying the application.",
    "texto6": "Establece las variables de entorno antes de desplegar la aplicación."
  },
  {
    "texto1": "Sustantivo que denota una colección de elementos únicos en matemáticas y programación",
    "texto2": "conjunto / colección",
    "texto3": "set / sɛt /",
    "texto4": "sets / n/a",
    "texto5": "Use a set data structure to store unique values efficiently.",
    "texto6": "Usa una estructura de datos de conjunto para almacenar valores únicos eficientemente."
  },
  {
    "texto1": "Sustantivo que describe un grupo de herramientas o dispositivos relacionados",
    "texto2": "juego / kit",
    "texto3": "set / sɛt /",
    "texto4": "sets / n/a",
    "texto5": "The development team uses a complete set of debugging tools.",
    "texto6": "El equipo de desarrollo usa un juego completo de herramientas de depuración."
  },
  {
    "texto1": "Adjetivo que describe algo predeterminado o predefinido",
    "texto2": "predeterminado / fijo",
    "texto3": "set / sɛt /",
    "texto4": "n/a",
    "texto5": "Restore the database to its set configuration after testing.",
    "texto6": "Restaura la base de datos a su configuración predeterminada después de las pruebas."
  }
]