[
  {
    "texto1": "Hacer que el aire se mueva, expulsándolo de la boca o con el viento.",
    "texto2": "Soplar / Echar",
    "texto3": "blow /bloʊ/",
    "texto4": "blew / will blow",
    "texto5": "Can you please blow out the candles on the cake?",
    "texto6": "¿Puedes soplar las velas del pastel, por favor?"
  },
  {
    "texto1": "Ser arrastrado o destruido por la fuerza del viento o una explosión.",
    "texto2": "Volar / Explotar",
    "texto3": "blow /bloʊ/",
    "texto4": "blew / will blow",
    "texto5": "The strong wind might blow the roof off our house.",
    "texto6": "El viento fuerte podría volar el techo de nuestra casa."
  },
  {
    "texto1": "Perder o usar algo (oportunidad, dinero) de forma descuidada.",
    "texto2": "Malgastar / Desaprovechar",
    "texto3": "blow /bloʊ/",
    "texto4": "blew / will blow",
    "texto5": "I can't believe I blew my chance to get that job.",
    "texto6": "No puedo creer que desaproveché mi oportunidad de conseguir ese trabajo."
  },
  {
    "texto1": "Producir sonido en un instrumento de viento.",
    "texto2": "Sonar / Tocar",
    "texto3": "blow /bloʊ/",
    "texto4": "blew / will blow",
    "texto5": "He likes to blow his trumpet loudly in the morning.",
    "texto6": "A él le gusta tocar su trompeta ruidosamente por la mañana."
  },
  {
    "texto1": "Dejar a alguien muy impresionado o asombrado (expresión idiomática).",
    "texto2": "Asombrar / Impresionar mucho",
    "texto3": "blow away /bloʊ əˈweɪ/",
    "texto4": "blew away / will blow away",
    "texto5": "The concert really blew me away; it was incredible.",
    "texto6": "El concierto realmente me impresionó; fue increíble."
  },
  {
    "texto1": "Un gesto o acción para comunicar algo sin palabras.",
    "texto2": "Seña / Gesto",
    "texto3": "sign /saɪn/",
    "texto4": "signs / will be a sign",
    "texto5": "He made a sign with his hand to tell me to wait.",
    "texto6": "Él hizo una seña con la mano para decirme que esperara."
  },
  {
    "texto1": "Un cartel o letrero que da información o advertencia.",
    "texto2": "Señal / Letrero",
    "texto3": "sign /saɪn/",
    "texto4": "signs / will be a sign",
    "texto5": "The stop sign was clearly visible at the intersection.",
    "texto6": "La señal de alto era claramente visible en la intersección."
  },
  {
    "texto1": "Indicio o evidencia de que algo existe o sucederá.",
    "texto2": "Señal / Indicio",
    "texto3": "sign /saɪn/",
    "texto4": "signs / will be a sign",
    "texto5": "There are no signs of life in the abandoned house.",
    "texto6": "No hay señales de vida en la casa abandonada."
  },
  {
    "texto1": "Firmar un documento, escribir tu nombre para indicar aprobación o acuerdo.",
    "texto2": "Firmar",
    "texto3": "sign /saɪn/",
    "texto4": "signed / will sign",
    "texto5": "Please sign your name at the bottom of the form to confirm.",
    "texto6": "Por favor, firme con su nombre en la parte inferior del formulario para confirmar."
  },
  {
    "texto1": "Contratar a alguien oficialmente (especialmente en deportes o música).",
    "texto2": "Fichar / Contratar",
    "texto3": "sign /saɪn/",
    "texto4": "signed / will sign",
    "texto5": "The team hopes to sign a new player before the next season.",
    "texto6": "El equipo espera fichar a un nuevo jugador antes de la próxima temporada."
  },
  {
    "texto1": "Presionar o meter algo a la fuerza en un espacio reducido, haciendo que se atasque.",
    "texto2": "Atascar / Encajar a la fuerza",
    "texto3": "jam /dʒæm/",
    "texto4": "jammed / will jam",
    "texto5": "The printer kept jamming because of the crumpled paper.",
    "texto6": "La impresora seguía atascándose por el papel arrugado."
  },
  {
    "texto1": "Una situación en la que muchas personas o vehículos están muy apretados y no pueden moverse.",
    "texto2": "Atasco / Embottellamiento",
    "texto3": "jam /dʒæm/",
    "texto4": "jams / will be a jam",
    "texto5": "We were stuck in a huge traffic jam for an hour.",
    "texto6": "Estuvimos atrapados en un atasco de tráfico enorme durante una hora."
  },
  {
    "texto1": "Un tipo de conserva de fruta cocida con azúcar, usada para untar pan.",
    "texto2": "Mermelada / Jalea",
    "texto3": "jam /dʒæm/",
    "texto4": "jams / will be a jam",
    "texto5": "I like to eat toast with strawberry jam for breakfast.",
    "texto6": "Me gusta comer tostadas con mermelada de fresa para el desayuno."
  },
  {
    "texto1": "Tocar música de forma improvisada con otros músicos, por diversión.",
    "texto2": "Improvisar música / Tocar un 'jam session'",
    "texto3": "jam /dʒæm/",
    "texto4": "jammed / will jam",
    "texto5": "Let's jam together in the garage tonight and make some music!",
    "texto6": "¡Vamos a improvisar música juntos en el garaje esta noche y a hacer algo de música!"
  },
  {
    "texto1": "Bloquear o interferir una señal de radio, teléfono, etc.",
    "texto2": "Interferir / Bloquear (señal)",
    "texto3": "jam /dʒæm/",
    "texto4": "jammed / will jam",
    "texto5": "The enemy tried to jam our radio communications to stop us.",
    "texto6": "El enemigo intentó bloquear nuestras comunicaciones por radio para detenernos."
  },
  {
    "texto1": "Pedir algo de forma muy humilde, desesperada o suplicante.",
    "texto2": "Suplicar / Rogar",
    "texto3": "beg /bɛɡ/",
    "texto4": "begged / will beg",
    "texto5": "He begged for forgiveness after making a big mistake.",
    "texto6": "Él suplicó por perdón después de cometer un gran error."
  },
  {
    "texto1": "Pedir comida o dinero en la calle, generalmente por necesidad.",
    "texto2": "Mendigar / Pedir limosna",
    "texto3": "beg /bɛɡ/",
    "texto4": "begged / will beg",
    "texto5": "Many homeless people are forced to beg for food and money on the streets.",
    "texto6": "Muchas personas sin hogar se ven obligadas a mendigar comida y dinero en las calles."
  },
  {
    "texto1": "Pedir permiso para hacer algo, a menudo con insistencia.",
    "texto2": "Pedir (permiso, por favor)",
    "texto3": "beg /bɛɡ/",
    "texto4": "begged / will beg",
    "texto5": "I begged my parents to let me go to the concert with my friends.",
    "texto6": "Les rogué a mis padres que me dejaran ir al concierto con mis amigos."
  },
  {
    "texto1": "Evadir una pregunta o asunto, especialmente en la frase 'beg the question'.",
    "texto2": "Eludir la pregunta / Plantear la cuestión (idiomático)",
    "texto3": "beg /bɛɡ/",
    "texto4": "begged / will beg",
    "texto5": "His answer seemed to beg the question of his true intentions.",
    "texto6": "Su respuesta pareció eludir la cuestión de sus verdaderas intenciones."
  },
  {
    "texto1": "Solicitar (formal y educadamente) un favor o asistencia, como en 'I beg to differ'.",
    "texto2": "Permitirse (formal) / Discrepar (cortésmente)",
    "texto3": "beg /bɛɡ/",
    "texto4": "begged / will beg",
    "texto5": "I beg to differ with your opinion on this matter, although I respect it.",
    "texto6": "Me permito discrepar de su opinión sobre este asunto, aunque la respeto."
  },
  {
    "texto1": "La parte frontal de la cabeza de una persona o animal.",
    "texto2": "Cara / Rostro",
    "texto3": "face /feɪs/",
    "texto4": "faces / will be a face",
    "texto5": "She has a friendly face and a warm smile.",
    "texto6": "Ella tiene una cara amigable y una sonrisa cálida."
  },
  {
    "texto1": "La superficie frontal de un objeto o estructura.",
    "texto2": "Cara / Superficie",
    "texto3": "face /feɪs/",
    "texto4": "faces / will be a face",
    "texto5": "The clock's face shows the time and also has some decorations.",
    "texto6": "La cara del reloj muestra la hora y también tiene algunas decoraciones."
  },
  {
    "texto1": "Enfrentar o afrontar una situación difícil, un problema o un peligro.",
    "texto2": "Enfrentar / Afrontar",
    "texto3": "face /feɪs/",
    "texto4": "faced / will face",
    "texto5": "We need to face our problems directly instead of avoiding them.",
    "texto6": "Necesitamos enfrentar nuestros problemas directamente en lugar de evitarlos."
  },
  {
    "texto1": "Estar orientado hacia una dirección particular o un lugar.",
    "texto2": "Dar a / Mirar hacia",
    "texto3": "face /feɪs/",
    "texto4": "faced / will face",
    "texto5": "The house faces the east, so it gets a lot of morning sun.",
    "texto6": "La casa da al este, por lo que recibe mucho sol por la mañana."
  },
  {
    "texto1": "Lidiar con una situación o persona desafiante de manera directa.",
    "texto2": "Hacer frente a / Plantar cara a",
    "texto3": "face /feɪs/",
    "texto4": "faced / will face",
    "texto5": "You have to face the consequences of your actions, whether they are good or bad.",
    "texto6": "Tienes que hacer frente a las consecuencias de tus acciones, ya sean buenas o malas."
  },
  {
    "texto1": "Moverse alrededor de un punto central o cambiar de dirección.",
    "texto2": "Girar / Voltear",
    "texto3": "turn /tɜːrn/",
    "texto4": "turned / will turn",
    "texto5": "Please turn right at the next intersection to get to the store.",
    "texto6": "Por favor, gira a la derecha en la próxima intersección para llegar a la tienda."
  },
  {
    "texto1": "Cambiar de estado, condición o color.",
    "texto2": "Volverse / Convertirse en",
    "texto3": "turn /tɜːrn/",
    "texto4": "turned / will turn",
    "texto5": "The leaves turn yellow and red in autumn.",
    "texto6": "Las hojas se vuelven amarillas y rojas en otoño."
  },
  {
    "texto1": "Activar un aparato o luz (phrasal verb).",
    "texto2": "Encender",
    "texto3": "turn on /tɜːrn ɒn/",
    "texto4": "turned on / will turn on",
    "texto5": "Could you turn on the radio? I want to listen to some music.",
    "texto6": "¿Podrías encender la radio? Quiero escuchar música."
  },
  {
    "texto1": "Desactivar un aparato o luz (phrasal verb).",
    "texto2": "Apagar",
    "texto3": "turn off /tɜːrn ɒf/",
    "texto4": "turned off / will turn off",
    "texto5": "Don't forget to turn off the lights before you leave.",
    "texto6": "No olvides apagar las luces antes de irte."
  },
  {
    "texto1": "Pasar una página o una esquina.",
    "texto2": "Pasar / Doblar",
    "texto3": "turn /tɜːrn/",
    "texto4": "turned / will turn",
    "texto5": "Please turn to page 50 in your book and start reading.",
    "texto6": "Por favor, pasa a la página 50 de tu libro y empieza a leer."
  },
  {
    "texto1": "Devolver o entregar algo a alguien.",
    "texto2": "Entregar / Devolver",
    "texto3": "turn in /tɜːrn ɪn/",
    "texto4": "turned in / will turn in",
    "texto5": "You must turn in your homework by Friday at the latest.",
    "texto6": "Debes entregar tu tarea a más tardar el viernes."
  },
  {
    "texto1": "Cumplir una edad específica.",
    "texto2": "Cumplir (años)",
    "texto3": "turn /tɜːrn/",
    "texto4": "turned / will turn",
    "texto5": "My brother will turn 30 next month, so we are planning a party.",
    "texto6": "Mi hermano cumplirá 30 el próximo mes, así que estamos planeando una fiesta."
  },
  {
    "texto1": "Cambiar a un estado, forma, condición o cualidad diferente.",
    "texto2": "Volverse / Convertirse en / Transformarse en",
    "texto3": "turn into /tɜːrn ˈɪntu/",
    "texto4": "turned into / will turn into",
    "texto5": "The caterpillar will turn into a beautiful butterfly soon.",
    "texto6": "La oruga se convertirá en una hermosa mariposa pronto."
  },
  {
    "texto1": "Una porción delgada y plana cortada de algo más grande (sustantivo).",
    "texto2": "Rebanada / Loncha",
    "texto3": "slice /slaɪs/",
    "texto4": "slices / will be a slice",
    "texto5": "Can I have a slice of pizza for dinner tonight?",
    "texto6": "¿Puedo tomar una rebanada de pizza para la cena de esta noche?"
  },
  {
    "texto1": "Cortar algo en porciones delgadas y planas (verbo).",
    "texto2": "Rebanar / Cortar en lonchas",
    "texto3": "slice /slaɪs/",
    "texto4": "sliced / will slice",
    "texto5": "He used a sharp knife to slice the bread into thin pieces.",
    "texto6": "Él usó un cuchillo afilado para rebanar el pan en rodajas finas."
  },
  {
    "texto1": "Una porción o parte de algo, especialmente de una gran cantidad (sustantivo).",
    "texto2": "Parte / Porción",
    "texto3": "slice /slaɪs/",
    "texto4": "slices / will be a slice",
    "texto5": "Everyone wants a slice of the pie, but few want to bake it.",
    "texto6": "Todos quieren una porción del pastel, pero pocos quieren hornearlo."
  },
  {
    "texto1": "Un golpe que hace que una pelota o un objeto se desvíe hacia un lado, especialmente en deportes como el golf o el tenis (sustantivo/verbo).",
    "texto2": "Efecto / Golpe con efecto (golf/tenis)",
    "texto3": "slice /slaɪs/",
    "texto4": "slices / will slice",
    "texto5": "His golf ball took a bad slice to the right and went into the water.",
    "texto6": "Su pelota de golf tomó un mal efecto hacia la derecha y se fue al agua."
  },
  {
    "texto1": "Agarrar, coger o mover algo de un lugar a otro.",
    "texto2": "Coger / Tomar",
    "texto3": "take /teɪk/",
    "texto4": "took / will take",
    "texto5": "Please take your books with you when you leave the classroom.",
    "texto6": "Por favor, coge tus libros contigo cuando salgas del aula."
  },
  {
    "texto1": "Llevar a alguien o algo de un lugar a otro.",
    "texto2": "Llevar / Conducir",
    "texto3": "take /teɪk/",
    "texto4": "took / will take",
    "texto5": "I will take you to the airport tomorrow morning.",
    "texto6": "Te llevaré al aeropuerto mañana por la mañana."
  },
  {
    "texto1": "Aceptar o recibir algo (un regalo, una oferta, una responsabilidad).",
    "texto2": "Aceptar / Recibir",
    "texto3": "take /teɪk/",
    "texto4": "took / will take",
    "texto5": "I will take the job offer because it's a great opportunity.",
    "texto6": "Aceptaré la oferta de trabajo porque es una gran oportunidad."
  },
  {
    "texto1": "Necesitar o requerir una cantidad de tiempo, esfuerzo, etc.",
    "texto2": "Llevar (tiempo) / Requerir",
    "texto3": "take /teɪk/",
    "texto4": "took / will take",
    "texto5": "It will take about two hours to get there by car.",
    "texto6": "Llevará unas dos horas llegar allí en coche."
  },
  {
    "texto1": "Quitar algo de su lugar o de alguien.",
    "texto2": "Quitar / Sacar",
    "texto3": "take /teɪk/",
    "texto4": "took / will take",
    "texto5": "Did you take my keys from the table this morning?",
    "texto6": "¿Cogiste mis llaves de la mesa esta mañana?"
  },
  {
    "texto1": "Consumir algo (comida, bebida, medicina).",
    "texto2": "Tomar (medicina, comida)",
    "texto3": "take /teɪk/",
    "texto4": "took / will take",
    "texto5": "Remember to take your medicine twice a day, after breakfast and dinner.",
    "texto6": "Recuerda tomar tu medicamento dos veces al día, después del desayuno y la cena."
  },
  {
    "texto1": "Soportar o tolerar algo, generalmente algo desagradable.",
    "texto2": "Soportar / Aguantar",
    "texto3": "take /teɪk/",
    "texto4": "took / will take",
    "texto5": "I can't take this loud noise anymore; my head hurts.",
    "texto6": "Ya no puedo soportar este ruido tan fuerte; me duele la cabeza."
  },
  {
    "texto1": "Entender o interpretar algo de cierta manera.",
    "texto2": "Interpretar / Entender",
    "texto3": "take /teɪk/",
    "texto4": "took / will take",
    "texto5": "How do you take his comment about the project?",
    "texto6": "¿Cómo interpretas su comentario sobre el proyecto?"
  },
  {
    "texto1": "Utilizar un medio de transporte.",
    "texto2": "Tomar (transporte)",
    "texto3": "take /teɪk/",
    "texto4": "took / will take",
    "texto5": "I usually take the bus to work to avoid traffic.",
    "texto6": "Normalmente tomo el autobús para ir al trabajo para evitar el tráfico."
  },
  {
    "texto1": "Poner o colocar algo en un lugar o posición específica.",
    "texto2": "Poner / Colocar",
    "texto3": "set /sɛt/",
    "texto4": "set / will set",
    "texto5": "Please set the table for dinner before the guests arrive.",
    "texto6": "Por favor, pon la mesa para la cena antes de que lleguen los invitados."
  },
  {
    "texto1": "Establecer una fecha, hora, límite o récord.",
    "texto2": "Establecer / Fijar",
    "texto3": "set /sɛt/",
    "texto4": "set / will set",
    "texto5": "They set a new date for the meeting, so we will meet next week.",
    "texto6": "Fijaron una nueva fecha para la reunión, así que nos veremos la próxima semana."
  },
  {
    "texto1": "Ajustar un aparato (reloj, alarma) para que funcione de cierta manera.",
    "texto2": "Ajustar / Programar",
    "texto3": "set /sɛt/",
    "texto4": "set / will set",
    "texto5": "I set my alarm for 6 AM so I don't oversleep.",
    "texto6": "Ajusté mi alarma para las 6 de la mañana para no quedarme dormido."
  },
  {
    "texto1": "Hacer que algo comience o iniciar algo (ej. una tendencia, un ejemplo).",
    "texto2": "Iniciar / Comenzar / Marcar",
    "texto3": "set /sɛt/",
    "texto4": "set / will set",
    "texto5": "The company aims to set a new trend in technology with this new product.",
    "texto6": "La empresa aspira a marcar una nueva tendencia en tecnología con este nuevo producto."
  },
  {
    "texto1": "El sol o la luna bajan y desaparecen del cielo.",
    "texto2": "Ponerse (el sol)",
    "texto3": "set /sɛt/",
    "texto4": "set / will set",
    "texto5": "The sun sets in the west, creating a beautiful orange sky.",
    "texto6": "El sol se pone por el oeste, creando un hermoso cielo anaranjado."
  },
  {
    "texto1": "Determinar o decidir algo, establecer reglas o normas.",
    "texto2": "Determinar / Decidir",
    "texto3": "set /sɛt/",
    "texto4": "set / will set",
    "texto5": "The teacher will set the rules for the class at the beginning of the year.",
    "texto6": "El profesor determinará las reglas para la clase al comienzo del año."
  },
  {
    "texto1": "Preparar o disponer algo para un propósito específico.",
    "texto2": "Preparar / Disponer",
    "texto3": "set /sɛt/",
    "texto4": "set / will set",
    "texto5": "He set the trap to catch the mouse that was in the kitchen.",
    "texto6": "Él preparó la trampa para atrapar al ratón que estaba en la cocina."
  },
  {
    "texto1": "Hacer que algo se solidifique o endurezca (ej. gelatina, cemento).",
    "texto2": "Cuajar / Endurecerse",
    "texto3": "set /sɛt/",
    "texto4": "set / will set",
    "texto5": "The jelly will set in a few hours in the refrigerator.",
    "texto6": "La gelatina cuajará en unas pocas horas en el refrigerador."
  },
  {
    "texto1": "No estar bajo control o restricción; poder moverse o actuar sin impedimentos.",
    "texto2": "Libre",
    "texto3": "free /friː/",
    "texto4": "freer / will be free",
    "texto5": "The bird is free to fly wherever it wants to go.",
    "texto6": "El pájaro es libre de volar a donde quiera ir."
  },
  {
    "texto1": "No tener que pagar por algo; sin costo.",
    "texto2": "Gratis / Gratuito",
    "texto3": "free /friː/",
    "texto4": "freer / will be free",
    "texto5": "Admission to the museum is free on Sundays for everyone.",
    "texto6": "La entrada al museo es gratis los domingos para todo el mundo."
  },
  {
    "texto1": "No estar ocupado o disponible para hacer algo; tener tiempo libre.",
    "texto2": "Libre / Desocupado",
    "texto3": "free /friː/",
    "texto4": "freer / will be free",
    "texto5": "Are you free this afternoon for a coffee or a walk?",
    "texto6": "¿Estás libre esta tarde para tomar un café o dar un paseo?"
  },
  {
    "texto1": "Liberar a alguien o algo de una prisión, restricción o dificultad.",
    "texto2": "Liberar / Soltar",
    "texto3": "free /friː/",
    "texto4": "freed / will free",
    "texto5": "They managed to free the trapped animal from the net.",
    "texto6": "Consiguieron liberar al animal atrapado de la red."
  },
  {
    "texto1": "No contener o carecer de algo (ej. libre de gluten, sin azúcar).",
    "texto2": "Libre de / Exento de",
    "texto3": "free /friː/",
    "texto4": "freer / will be free",
    "texto5": "This product is free from artificial colors and preservatives.",
    "texto6": "Este producto está libre de colorantes y conservantes artificiales."
  },
  {
    "texto1": "Cuando algo es dado sin costo; como en 'buy one, get one free'.",
    "texto2": "De regalo / De obsequio",
    "texto3": "free /friː/",
    "texto4": "freer / will be free",
    "texto5": "Buy one pizza and get another one free with this coupon.",
    "texto6": "¡Compra una pizza y llévate otra gratis con este cupón!"
  },
  {
    "texto1": "Estar o colocar algo suspendido desde arriba sin tocar el suelo o una superficie.",
    "texto2": "Colgar / Pender",
    "texto3": "hang /hæŋ/",
    "texto4": "hung / will hang",
    "texto5": "Please hang your coat on the hook by the door.",
    "texto6": "Por favor, cuelga tu abrigo en el gancho de la puerta."
  },
  {
    "texto1": "Suspender a una persona por el cuello como forma de ejecución (histórico).",
    "texto2": "Ahorcar",
    "texto3": "hang /hæŋ/",
    "texto4": "hanged / will hang",
    "texto5": "In the past, criminals were sometimes condemned to be hanged for their crimes.",
    "texto6": "En el pasado, los criminales a veces eran condenados a ser ahorcados por sus crímenes."
  },
  {
    "texto1": "Mantenerse en el aire o permanecer suspendido (ej. humo, niebla).",
    "texto2": "Flotar / Quedarse (en el aire)",
    "texto3": "hang /hæŋ/",
    "texto4": "hung / will hang",
    "texto5": "A thick mist began to hang over the valley as the sun set.",
    "texto6": "Una densa niebla comenzó a quedarse sobre el valle al ponerse el sol."
  },
  {
    "texto1": "Decorar o cubrir paredes con cuadros, tapices, etc.",
    "texto2": "Colgar (cuadros) / Tapizar",
    "texto3": "hang /hæŋ/",
    "texto4": "hung / will hang",
    "texto5": "They decided to hang new curtains in the living room for the spring.",
    "texto6": "Decidieron colgar cortinas nuevas en la sala para la primavera."
  },
  {
    "texto1": "Cuando una prenda de vestir cae o se ajusta de cierta manera.",
    "texto2": "Caer / Ajustar (prenda)",
    "texto3": "hang /hæŋ/",
    "texto4": "hung / will hang",
    "texto5": "The dress doesn't hang well on me, it's a bit too big.",
    "texto6": "El vestido no me sienta bien, es un poco demasiado grande."
  },
  {
    "texto1": "Reparar o arreglar algo que está roto o dañado.",
    "texto2": "Reparar / Arreglar",
    "texto3": "fix /fɪks/",
    "texto4": "fixed / will fix",
    "texto5": "Can you fix my broken bicycle before the weekend?",
    "texto6": "¿Puedes reparar mi bicicleta rota antes del fin de semana?"
  },
  {
    "texto1": "Preparar comida o bebida.",
    "texto2": "Preparar (comida)",
    "texto3": "fix /fɪks/",
    "texto4": "fixed / will fix",
    "texto5": "I need to fix some breakfast before I leave for work.",
    "texto6": "Necesito preparar el desayuno antes de irme a trabajar."
  },
  {
    "texto1": "Establecer o determinar algo de forma permanente o segura.",
    "texto2": "Fijar / Establecer",
    "texto3": "fix /fɪks/",
    "texto4": "fixed / will fix",
    "texto5": "Let's fix a date for our next meeting so we can all be there.",
    "texto6": "Fijemos una fecha para nuestra próxima reunión para que todos podamos estar allí."
  },
  {
    "texto1": "Dirigir la mirada o la atención de forma constante a algo o alguien.",
    "texto2": "Fijar (la mirada)",
    "texto3": "fix /fɪks/",
    "texto4": "fixed / will fix",
    "texto5": "She fixed her eyes on the distant horizon, lost in thought.",
    "texto6": "Ella fijó su mirada en el horizonte distante, perdida en sus pensamientos."
  },
  {
    "texto1": "Una dosis de una droga adictiva (sustantivo, informal).",
    "texto2": "Dosis / Dosis de droga",
    "texto3": "fix /fɪks/",
    "texto4": "fixes / will be a fix",
    "texto5": "He was desperate for his daily fix after a long day.",
    "texto6": "Estaba desesperado por su dosis diaria después de un largo día."
  },
  {
    "texto1": "Pronunciar el nombre de alguien o algo para atraer su atención o indicar su presencia.",
    "texto2": "Llamar / Nombrar",
    "texto3": "call /kɔːl/",
    "texto4": "called / will call",
    "texto5": "Could you please call my name when it's my turn?",
    "texto6": "¿Podrías por favor decir mi nombre cuando sea mi turno?"
  },
  {
    "texto1": "Intentar comunicarse con alguien por teléfono.",
    "texto2": "Llamar por teléfono",
    "texto3": "call /kɔːl/",
    "texto4": "called / will call",
    "texto5": "I need to call my mom after work to tell her about my day.",
    "texto6": "Necesito llamar a mi mamá después del trabajo para contarle sobre mi día."
  },
  {
    "texto1": "Designar o referirse a algo o alguien con un nombre particular.",
    "texto2": "Llamar / Denominar",
    "texto3": "call /kɔːl/",
    "texto4": "called / will call",
    "texto5": "They call him 'the professor' because he knows so much about history.",
    "texto6": "Lo llaman 'el profesor' porque sabe mucho de historia."
  },
  {
    "texto1": "Visitar brevemente un lugar o a alguien.",
    "texto2": "Visitar (brevemente)",
    "texto3": "call /kɔːl/",
    "texto4": "called / will call",
    "texto5": "I'll call on you later this evening to see how you are.",
    "texto6": "Te visitaré más tarde esta noche para ver cómo estás."
  },
  {
    "texto1": "Considerar o describir algo de una manera particular.",
    "texto2": "Considerar / Describir",
    "texto3": "call /kɔːl/",
    "texto4": "called / will call",
    "texto5": "It's difficult to call that a victory after we lost half our team.",
    "texto6": "Es difícil considerar eso una victoria después de que perdimos a la mitad de nuestro equipo."
  },
  {
    "texto1": "Solicitar la presencia de alguien o pedirle que venga.",
    "texto2": "Convocar / Llamar (a alguien)",
    "texto3": "call /kɔːl/",
    "texto4": "called / will call",
    "texto5": "The manager decided to call a meeting to discuss the new project.",
    "texto6": "El gerente decidió convocar una reunión para discutir el nuevo proyecto."
  },
  {
    "texto1": "Una breve visita (sustantivo).",
    "texto2": "Visita (corta)",
    "texto3": "call /kɔːl/",
    "texto4": "calls / will be a call",
    "texto5": "I paid a quick call to my aunt while I was in the neighborhood.",
    "texto6": "Le hice una visita rápida a mi tía mientras estaba en el vecindario."
  },
  {
    "texto1": "Un ruido o sonido que se usa para llamar la atención (sustantivo).",
    "texto2": "Llamada / Grito",
    "texto3": "call /kɔːl/",
    "texto4": "calls / will be a call",
    "texto5": "We heard the call of a strange bird in the forest last night.",
    "texto6": "Escuchamos el grito de un pájaro extraño en el bosque anoche."
  },
  {
    "texto1": "Permitir que algo sea visto; presentar o hacer visible.",
    "texto2": "Mostrar / Enseñar",
    "texto3": "show /ʃoʊ/",
    "texto4": "showed / will show",
    "texto5": "Can you show me how to use this new app on my phone?",
    "texto6": "¿Puedes enseñarme cómo usar esta nueva aplicación en mi teléfono?"
  },
  {
    "texto1": "Exhibir algo en público, como una obra de arte o un producto.",
    "texto2": "Exhibir / Exponer",
    "texto3": "show /ʃoʊ/",
    "texto4": "showed / will show",
    "texto5": "The gallery will show her latest paintings next month for the public.",
    "texto6": "La galería exhibirá sus últimas pinturas el próximo mes para el público."
  },
  {
    "texto1": "Demostrar una cualidad, habilidad o sentimiento.",
    "texto2": "Demostrar / Revelar",
    "texto3": "show /ʃoʊ/",
    "texto4": "showed / will show",
    "texto5": "Her actions show great courage and determination in difficult times.",
    "texto6": "Sus acciones demuestran un gran valor y determinación en tiempos difíciles."
  },
  {
    "texto1": "Indicar o señalar algo con un gesto o dirección.",
    "texto2": "Indicar / Señalar",
    "texto3": "show /ʃoʊ/",
    "texto4": "showed / will show",
    "texto5": "The map will show you the way to the station from here.",
    "texto6": "El mapa te indicará el camino a la estación desde aquí."
  },
  {
    "texto1": "Un espectáculo, una obra de teatro, una película o un programa de televisión (sustantivo).",
    "texto2": "Espectáculo / Programa",
    "texto3": "show /ʃoʊ/",
    "texto4": "shows / will be a show",
    "texto5": "We went to see a fantastic magic show last night with my family.",
    "texto6": "Fuimos a ver un fantástico espectáculo de magia anoche con mi familia."
  },
  {
    "texto1": "Una feria o exhibición donde se presentan productos o animales (sustantivo).",
    "texto2": "Feria / Exhibición",
    "texto3": "show /ʃoʊ/",
    "texto4": "shows / will be a show",
    "texto5": "Are you going to the car show this weekend? They have a new model.",
    "texto6": "¿Vas a la exhibición de autos este fin de semana? Tienen un modelo nuevo."
  },
  {
    "texto1": "Separado o a distancia; no juntos en el espacio o el tiempo.",
    "texto2": "Separado / Aparte",
    "texto3": "apart /əˈpɑːrt/",
    "texto4": "further apart / will be apart",
    "texto5": "The two houses are quite far apart from each other.",
    "texto6": "Las dos casas están bastante separadas la una de la otra."
  },
  {
    "texto1": "En pedazos o desintegrado; roto en partes.",
    "texto2": "En pedazos / Desarmado",
    "texto3": "apart /əˈpɑːrt/",
    "texto4": "fell apart / will fall apart",
    "texto5": "The old machine fell apart when he tried to move it.",
    "texto6": "La vieja máquina se desarmó cuando intentó moverla."
  },
  {
    "texto1": "Excepto o con la excepción de (generalmente en la frase 'apart from').",
    "texto2": "Aparte de / Excepto",
    "texto3": "apart /əˈpɑːrt/",
    "texto4": "apart from / will be apart from",
    "texto5": "Everything went well, apart from a small delay at the beginning.",
    "texto6": "Todo salió bien, aparte de un pequeño retraso al principio."
  },
  {
    "texto1": "De manera individual o distinta; con distinción de los demás.",
    "texto2": "Individualmente / Distintamente",
    "texto3": "apart /əˈpɑːrt/",
    "texto4": "stands apart / will stand apart",
    "texto5": "He stands apart from the others because of his unique talent.",
    "texto6": "Se distingue de los demás por su talento único."
  },
  {
    "texto1": "Desglosar o analizar algo en sus componentes individuales (ej. 'pull apart', 'take apart').",
    "texto2": "Desglosar / Desarmar",
    "texto3": "apart /əˈpɑːrt/",
    "texto4": "took apart / will take apart",
    "texto5": "We need to take this engine apart to find the problem.",
    "texto6": "Necesitamos desarmar este motor para encontrar el problema."
  },
  {
    "texto1": "Atribuir la responsabilidad de un error o algo negativo a alguien o algo.",
    "texto2": "Culpar / Echar la culpa",
    "texto3": "blame /bleɪm/",
    "texto4": "blamed / will blame",
    "texto5": "Don't blame me for your mistakes; you are responsible for your own actions.",
    "texto6": "No me culpes por tus errores; eres responsable de tus propias acciones."
  },
  {
    "texto1": "La responsabilidad de un error o de algo malo (sustantivo).",
    "texto2": "Culpa / Responsabilidad",
    "texto3": "blame /bleɪm/",
    "texto4": "blames / will be the blame",
    "texto5": "The manager took all the blame for the failed project, even though it wasn't his fault.",
    "texto6": "El gerente asumió toda la culpa por el proyecto fallido, a pesar de que no fue su culpa."
  },
  {
    "texto1": "Sentir o expresar que algo o alguien tiene la culpa (generalmente en 'be to blame').",
    "texto2": "Tener la culpa / Ser culpable",
    "texto3": "blame /bleɪm/",
    "texto4": "was to blame / will be to blame",
    "texto5": "He was to blame for the accident because he was driving too fast.",
    "texto6": "Él tuvo la culpa del accidente porque estaba conduciendo demasiado rápido."
  },
  {
    "texto1": "Reprochar o censurar a alguien por algo (menos común que 'culpar').",
    "texto2": "Reprochar / Censurar",
    "texto3": "blame /bleɪm/",
    "texto4": "blamed / will blame",
    "texto5": "You can't blame him for trying to do his best, even if he failed.",
    "texto6": "No puedes reprocharle que intentara dar lo mejor de sí, incluso si fracasó."
  },
  {
    "texto1": "Dirigir los ojos hacia algo o alguien para ver.",
    "texto2": "Mirar / Ver",
    "texto3": "look /lʊk/",
    "texto4": "looked / will look",
    "texto5": "Please look at me when I'm talking to you so you can understand.",
    "texto6": "Por favor, mírame cuando te esté hablando para que puedas entender."
  },
  {
    "texto1": "Parecer o tener una apariencia determinada.",
    "texto2": "Parecer / Verse",
    "texto3": "look /lʊk/",
    "texto4": "looked / will look",
    "texto5": "You look very tired today; you should rest.",
    "texto6": "Hoy pareces muy cansado; deberías descansar."
  },
  {
    "texto1": "Buscar algo o a alguien.",
    "texto2": "Buscar",
    "texto3": "look for /lʊk fɔːr/",
    "texto4": "looked for / will look for",
    "texto5": "I need to look for my lost keys before I go out.",
    "texto6": "Necesito buscar mis llaves perdidas antes de salir."
  },
  {
    "texto1": "Una mirada o una expresión visual (sustantivo).",
    "texto2": "Mirada / Aspecto",
    "texto3": "look /lʊk/",
    "texto4": "looks / will be a look",
    "texto5": "She gave me a strange look after I told her the news.",
    "texto6": "Ella me dio una mirada extraña después de que le di la noticia."
  },
  {
    "texto1": "Investigar o examinar algo cuidadosamente.",
    "texto2": "Investigar / Examinar",
    "texto3": "look into /lʊk ˈɪntuː/",
    "texto4": "looked into / will look into",
    "texto5": "The police will look into the matter and decide what to do next.",
    "texto6": "La policía investigará el asunto y decidirá qué hacer a continuación."
  },
  {
    "texto1": "Volver los ojos en una dirección específica.",
    "texto2": "Mirar hacia",
    "texto3": "look out /lʊk aʊt/",
    "texto4": "looked out / will look out",
    "texto5": "He looked out the window at the snow falling softly.",
    "texto6": "Miró por la ventana la nieve cayendo suavemente."
  },
  {
    "texto1": "Tomar o coger algo rápidamente o con fuerza.",
    "texto2": "Agarrar / Coger",
    "texto3": "grab /ɡræb/",
    "texto4": "grabbed / will grab",
    "texto5": "He tried to grab the falling vase before it hit the floor.",
    "texto6": "Él intentó agarrar el jarrón que se caía antes de que tocara el suelo."
  },
  {
    "texto1": "Aprovechar una oportunidad rápidamente.",
    "texto2": "Aprovechar / Agarrar (oportunidad)",
    "texto3": "grab /ɡræb/",
    "texto4": "grabbed / will grab",
    "texto5": "You should grab this chance for a promotion while you can.",
    "texto6": "Deberías aprovechar esta oportunidad para un ascenso mientras puedas."
  },
  {
    "texto1": "Comer o beber algo rápidamente.",
    "texto2": "Comer/Beber (rápidamente)",
    "texto3": "grab /ɡræb/",
    "texto4": "grabbed / will grab",
    "texto5": "Let's grab a quick bite to eat before the movie starts.",
    "texto6": "Vamos a comer algo rápido antes de que empiece la película."
  },
  {
    "texto1": "Obtener la atención de alguien rápidamente.",
    "texto2": "Captar (atención)",
    "texto3": "grab /ɡræb/",
    "texto4": "grabbed / will grab",
    "texto5": "The headline immediately grabbed my attention because it was so interesting.",
    "texto6": "El titular captó inmediatamente mi atención porque era muy interesante."
  },
  {
    "texto1": "Tomar posesión de algo, a menudo de forma ilícita o agresiva.",
    "texto2": "Arrebatar / Aferrarse a",
    "texto3": "grab /ɡræb/",
    "texto4": "grabbed / will grab",
    "texto5": "The thief grabbed her purse and ran away down the street.",
    "texto6": "El ladrón le arrebató el bolso y salió corriendo por la calle."
  },
  {
    "texto1": "Romper o fracturar algo sin que se separe completamente.",
    "texto2": "Rajar / Agrietar",
    "texto3": "crack /kræk/",
    "texto4": "cracked / will crack",
    "texto5": "The glass window started to crack from the cold weather.",
    "texto6": "La ventana de vidrio comenzó a agrietarse por el clima frío."
  },
  {
    "texto1": "Hacer un sonido seco y fuerte al romperse o golpearse.",
    "texto2": "Crujir / Estallar",
    "texto3": "crack /kræk/",
    "texto4": "cracked / will crack",
    "texto5": "I heard a loud crack as the heavy branch fell from the tree.",
    "texto6": "Oí un crujido fuerte cuando la pesada rama cayó del árbol."
  },
  {
    "texto1": "Abrir algo con un sonido abrupto (ej. un huevo, una nuez).",
    "texto2": "Romper (un huevo, una nuez)",
    "texto3": "crack /kræk/",
    "texto4": "cracked / will crack",
    "texto5": "Please crack the eggs into the bowl carefully for the recipe.",
    "texto6": "Por favor, rompe los huevos en el tazón con cuidado para la receta."
  },
  {
    "texto1": "Una línea estrecha donde algo se ha roto o agrietado (sustantivo).",
    "texto2": "Grieta / Raja",
    "texto3": "crack /kræk/",
    "texto4": "cracks / will be a crack",
    "texto5": "There's a crack in the wall that needs to be fixed.",
    "texto6": "Hay una grieta en la pared que necesita ser reparada."
  },
  {
    "texto1": "Una abertura estrecha o rendija.",
    "texto2": "Rendija / Hendidura",
    "texto3": "crack /kræk/",
    "texto4": "cracks / will be a crack",
    "texto5": "Light shone through the crack in the door, making a small line on the floor.",
    "texto6": "La luz brillaba a través de la rendija de la puerta, haciendo una pequeña línea en el suelo."
  },
  {
    "texto1": "Intentar o resolver un problema o un código (coloquial).",
    "texto2": "Resolver / Descifrar (coloquial)",
    "texto3": "crack /kræk/",
    "texto4": "cracked / will crack",
    "texto5": "We need to crack this problem before the deadline arrives.",
    "texto6": "Necesitamos resolver este problema antes de que llegue la fecha límite."
  },
  {
    "texto1": "Movimiento o forma elegante y fluida.",
    "texto2": "Gracia / Elegancia",
    "texto3": "grace /ɡreɪs/",
    "texto4": "graces / will be a grace",
    "texto5": "The ballet dancer moved with incredible grace and precision on the stage.",
    "texto6": "La bailarina de ballet se movía con una gracia e increíble precisión en el escenario."
  },
  {
    "texto1": "Cortesía, amabilidad o buena voluntad.",
    "texto2": "Gracia / Cortesía",
    "texto3": "grace /ɡreɪs/",
    "texto4": "graces / will be a grace",
    "texto5": "He accepted the defeat with grace, congratulating his opponent.",
    "texto6": "Él aceptó la derrota con cortesía, felicitando a su oponente."
  },
  {
    "texto1": "Un período de tiempo adicional otorgado para cumplir una obligación.",
    "texto2": "Plazo de gracia",
    "texto3": "grace /ɡreɪs/",
    "texto4": "graces / will be a grace",
    "texto5": "You have a 30-day grace period to pay the bill without penalty.",
    "texto6": "Tienes un plazo de gracia de 30 días para pagar la factura sin penalización."
  },
  {
    "texto1": "Una cualidad de belleza o atractivo que se muestra en la forma o el movimiento.",
    "texto2": "Gracia / Encanto",
    "texto3": "grace /ɡreɪs/",
    "texto4": "graces / will be a grace",
    "texto5": "Her natural grace and charm captivated everyone at the party.",
    "texto6": "Su gracia y encanto naturales cautivaron a todos en la fiesta."
  },
  {
    "texto1": "Añadir elegancia o adorno a algo.",
    "texto2": "Adornar / Engalanar (verbo)",
    "texto3": "grace /ɡreɪs/",
    "texto4": "graced / will grace",
    "texto5": "Her presence will grace the event and make it more special.",
    "texto6": "Su presencia engalanará el evento y lo hará más especial."
  },
  {
    "texto1": "Un sentimiento de satisfacción y felicidad por haber alcanzado un objetivo, desarrollado el potencial o vivido de una manera significativa.",
    "texto2": "Realización / Plenitud / Satisfacción",
    "texto3": "fulfillment /fʊlˈfɪl.mənt/",
    "texto4": "fulfillments / will be a fulfillment",
    "texto5": "She found great fulfillment in her career helping others.",
    "texto6": "Ella encontró una gran realización en su carrera ayudando a los demás."
  },
  {
    "texto1": "Mostrar buenas maneras, cortesía y respeto hacia los demás.",
    "texto2": "Educado / Cortés",
    "texto3": "polite /pəˈlaɪt/",
    "texto4": "politer / will be polite",
    "texto5": "It's important to be polite when you talk to strangers or new people.",
    "texto6": "Es importante ser educado cuando hablas con extraños o personas nuevas."
  },
  {
    "texto1": "Actuar de una manera respetuosa y con buenos modales.",
    "texto2": "Amable / Atento",
    "texto3": "polite /pəˈlaɪt/",
    "texto4": "politer / will be polite",
    "texto5": "She gave a polite nod as she walked past, acknowledging my presence.",
    "texto6": "Ella dio un asentimiento amable al pasar, reconociendo mi presencia."
  },
  {
    "texto1": "Expresar algo de forma indirecta o suave para no ofender.",
    "texto2": "Discreto / Suave (al expresar)",
    "texto3": "polite /pəˈlaɪt/",
    "texto4": "politer / will be polite",
    "texto5": "He made a polite suggestion, rather than a direct order, to his boss.",
    "texto6": "Hizo una sugerencia discreta, en lugar de una orden directa, a su jefe."
  },
  {
    "texto1": "Refiriéndose a la sociedad o el comportamiento social que se considera refinado o civilizado.",
    "texto2": "Refinado / Civilizado",
    "texto3": "polite /pəˈlaɪt/",
    "texto4": "politer / will be polite",
    "texto5": "In polite society, it's customary to offer guests a drink upon arrival.",
    "texto6": "En la sociedad civilizada, es costumbre ofrecer una bebida a los invitados al llegar."
  },
  {
    "texto1": "Dar a alguien apoyo, coraje o esperanza para hacer algo.",
    "texto2": "Animar / Animar a",
    "texto3": "encourage /ɪnˈkʌr.ɪdʒ/",
    "texto4": "encouraged / will encourage",
    "texto5": "Her friends encouraged her to apply for the job she really wanted.",
    "texto6": "Sus amigos la animaron a postularse para el trabajo que realmente quería."
  },
  {
    "texto1": "Considerar algo probable que suceda o que alguien llegue.",
    "texto2": "Esperar / Contar con",
    "texto3": "expect /ɪkˈspɛkt/",
    "texto4": "expected / will expect",
    "texto5": "I expect her to arrive any minute now for our meeting.",
    "texto6": "Espero que ella llegue en cualquier momento para nuestra reunión."
  },
  {
    "texto1": "Creer que algo es verdad o que es lo normal o lo que se debe hacer.",
    "texto2": "Esperar / Suponer",
    "texto3": "expect /ɪkˈspɛkt/",
    "texto4": "expected / will expect",
    "texto5": "I expect you'll want to rest after your long journey.",
    "texto6": "Supongo que querrás descansar después de tu largo viaje."
  },
  {
    "texto1": "Requerir o demandar algo de alguien porque se considera su deber o derecho.",
    "texto2": "Exigir / Requerir",
    "texto3": "expect /ɪkˈspɛkt/",
    "texto4": "expected / will expect",
    "texto5": "They expect high standards from their employees, so they work hard.",
    "texto6": "Ellos exigen altos estándares de sus empleados, por lo que trabajan duro."
  },
  {
    "texto1": "Anticipar el nacimiento de un bebé.",
    "texto2": "Esperar (un bebé)",
    "texto3": "expect /ɪkˈspɛkt/",
    "texto4": "expected / will expect",
    "texto5": "My sister is expecting her first child in October, and we are all very excited.",
    "texto6": "Mi hermana está esperando a su primer hijo en octubre, y estamos todos muy emocionados."
  },
  {
    "texto1": "La capacidad de ver; el sentido de la vista.",
    "texto2": "Vista",
    "texto3": "sight /saɪt/",
    "texto4": "sights / will be a sight",
    "texto5": "His sight is not as good as it used to be, so he wears glasses.",
    "texto6": "Su vista no es tan buena como solía ser, así que usa gafas."
  },
  {
    "texto1": "Algo que se ve o se puede ver; una vista o un espectáculo.",
    "texto2": "Vista / Espectáculo",
    "texto3": "sight /saɪt/",
    "texto4": "sights / will be a sight",
    "texto5": "The Grand Canyon is an amazing sight, especially at sunrise.",
    "texto6": "El Gran Cañón es un espectáculo asombroso, especialmente al amanecer."
  },
  {
    "texto1": "Un lugar o edificio que es popular para visitar; una atracción turística.",
    "texto2": "Sitio turístico / Atracción",
    "texto3": "sight /saɪt/",
    "texto4": "sights / will be a sight",
    "texto5": "We visited all the famous sights in Paris, including the Eiffel Tower.",
    "texto6": "Visitamos todos los sitios turísticos famosos de París, incluida la Torre Eiffel."
  },
  {
    "texto1": "El acto de ver o percibir algo.",
    "texto2": "Avistamiento / Percepción",
    "texto3": "sight /saɪt/",
    "texto4": "sights / will be a sight",
    "texto5": "The first sight of land after weeks at sea brought cheers from the sailors.",
    "texto6": "El primer avistamiento de tierra después de semanas en el mar provocó vítores entre los marineros."
  },
  {
    "texto1": "Algo desagradable o desordenado de ver (coloquial, a menudo negativo).",
    "texto2": "Espectáculo lamentable / Desastre",
    "texto3": "sight /saɪt/",
    "texto4": "sights / will be a sight",
    "texto5": "Your room is a sight! Please clean it up before your friends arrive.",
    "texto6": "¡Tu habitación es un desastre! Por favor, límpiala antes de que lleguen tus amigos."
  },
  {
    "texto1": "Establecerse en un lugar de forma permanente o por un período prolongado.",
    "texto2": "Establecerse / Asentarse / Instalarse",
    "texto3": "settle /ˈsɛt.əl/",
    "texto4": "settled / will settle",
    "texto5": "They decided to settle in a small town in the countryside to start a new life.",
    "texto6": "Decidieron establecerse en un pueblo pequeño en el campo para empezar una nueva vida."
  },
  {
    "texto1": "Llegar a un acuerdo o resolver una disputa o problema.",
    "texto2": "Resolver / Acordar / Zanja",
    "texto3": "settle /ˈsɛt.əl/",
    "texto4": "settled / will settle",
    "texto5": "The two companies managed to settle their dispute out of court.",
    "texto6": "Las dos empresas lograron resolver su disputa fuera de los tribunales."
  },
  {
    "texto1": "Calmarse o tranquilizarse, especialmente después de un período de agitación o excitación.",
    "texto2": "Calmarse / Tranquilizarse / Serenarse",
    "texto3": "settle /ˈsɛt.əl/",
    "texto4": "settled / will settle",
    "texto5": "The children finally settled down after their exciting day at the park.",
    "texto6": "Los niños finalmente se calmaron después de su emocionante día en el parque."
  },
  {
    "texto1": "Pagar una deuda o una cuenta.",
    "texto2": "Pagar / Saldar / Liquidar",
    "texto3": "settle /ˈsɛt.əl/",
    "texto4": "settled / will settle",
    "texto5": "I need to settle my bill before checking out of the hotel tomorrow morning.",
    "texto6": "Necesito pagar mi cuenta antes de salir del hotel mañana por la mañana."
  },
  {
    "texto1": "Sentarse o recostarse cómodamente.",
    "texto2": "Acomodarse / Sentarse / Recostarse",
    "texto3": "settle /ˈsɛt.əl/",
    "texto4": "settled / will settle",
    "texto5": "She settled into her favorite armchair with a book and a cup of tea.",
    "texto6": "Se acomodó en su sillón favorito con un libro y una taza de té."
  },
  {
    "texto1": "Un objeto, marca o forma que consiste en dos líneas o barras que se cruzan. También puede referirse a un símbolo religioso cristiano.",
    "texto2": "Cruz / Cruce / Símbolo",
    "texto3": "cross /krɔːs/",
    "texto4": "crosses / will be a cross",
    "texto5": "The old church had a large wooden cross on its altar, which was very beautiful.",
    "texto6": "La iglesia antigua tenía una gran cruz de madera en su altar, que era muy hermosa."
  },
  {
    "texto1": "Acción de moverse de un lado a otro, o de un punto a otro, generalmente con el fin de llegar a un destino.",
    "texto2": "Cruzar / Atravesar / Pasar",
    "texto3": "cross /krɔːs/",
    "texto4": "crossed / will cross",
    "texto5": "Be careful when you cross the street, and always look both ways.",
    "texto6": "Ten cuidado cuando cruces la calle y mira siempre a ambos lados."
  },
  {
    "texto1": "Estar enojado o irritado con alguien.",
    "texto2": "Enojado / Irritado / Molesto",
    "texto3": "cross /krɔːs/",
    "texto4": "crossed / will cross",
    "texto5": "Don't cross your mother when she's in a bad mood, it's not a good idea.",
    "texto6": "No hagas enojar a tu madre cuando está de mal humor, no es una buena idea."
  },
  {
    "texto1": "Un híbrido, un animal o planta que es una mezcla de dos razas o especies diferentes.",
    "texto2": "Híbrido / Cruce / Mestizo",
    "texto3": "cross /krɔːs/",
    "texto4": "crosses / will be a cross",
    "texto5": "The new rose is a cross between two different varieties to get a new color.",
    "texto6": "La nueva rosa es un cruce entre dos variedades diferentes para obtener un nuevo color."
  },
  {
    "texto1": "Permitir o dar permiso para que algo suceda o para que alguien haga algo.",
    "texto2": "Permitir / Dejar / Conceder",
    "texto3": "let /lɛt/",
    "texto4": "let / will let",
    "texto5": "My parents let me go to the party with my friends.",
    "texto6": "Mis padres me dejaron ir a la fiesta con mis amigos."
  },
  {
    "texto1": "Alquilar o arrendar una propiedad.",
    "texto2": "Alquilar / Arrendar / Ceder en alquiler",
    "texto3": "let /lɛt/",
    "texto4": "let / will let",
    "texto5": "They decided to let their spare room to a student for the semester.",
    "texto6": "Decidieron alquilar su habitación libre a un estudiante por el semestre."
  },
  {
    "texto1": "Causar o permitir que algo se mueva o fluya.",
    "texto2": "Dejar salir / Soltar / Liberar",
    "texto3": "let /lɛt/",
    "texto4": "let / will let",
    "texto5": "She opened the window to let the fresh air in.",
    "texto6": "Abrió la ventana para dejar entrar el aire fresco."
  },
  {
    "texto1": "En tenis y otros deportes de raqueta, una jugada que debe repetirse porque la pelota toca la red pero cae en el campo correcto.",
    "texto2": "Repetición / Nula / Bola a la red",
    "texto3": "let /lɛt/",
    "texto4": "lets / will be a let",
    "texto5": "The umpire called a let after the serve touched the net and we had to repeat it.",
    "texto6": "El árbitro cantó 'let' después de que el saque tocó la red y tuvimos que repetirlo."
  },
  {
    "texto1": "Repetir o escribir las palabras exactas de alguien o de algún texto.",
    "texto2": "Citar / Mencionar / Referenciar",
    "texto3": "quote /kwoʊt/",
    "texto4": "quoted / will quote",
    "texto5": "He likes to quote famous philosophers in his essays to support his ideas.",
    "texto6": "Le gusta citar a filósofos famosos en sus ensayos para apoyar sus ideas."
  },
  {
    "texto1": "Dar un precio estimado por un trabajo o servicio.",
    "texto2": "Cotizar / Presupuestar / Tarifar",
    "texto3": "quote /kwoʊt/",
    "texto4": "quoted / will quote",
    "texto5": "Can you quote me a price for repairing my car before you start the work?",
    "texto6": "¿Puedes cotizarme un precio por reparar mi coche antes de que empieces el trabajo?"
  },
  {
    "texto1": "Una sección de texto o discurso extraída de un libro, documento o de las palabras de alguien.",
    "texto2": "Cita / Extracto / Frase",
    "texto3": "quote /kwoʊt/",
    "texto4": "quotes / will be a quote",
    "texto5": "The article began with a powerful quote from the president, which set the tone.",
    "texto6": "El artículo comenzó con una cita poderosa del presidente, que marcó el tono."
  },
  {
    "texto1": "En el mercado de valores, el precio actual de una acción o un valor.",
    "texto2": "Cotización / Precio / Valor",
    "texto3": "quote /kwoʊt/",
    "texto4": "quotes / will be a quote",
    "texto5": "The stock market quotes change throughout the day depending on the demand.",
    "texto6": "Las cotizaciones del mercado de valores cambian a lo largo del día dependiendo de la demanda."
  },
  {
    "texto1": "Apoyar o defender públicamente una causa, una política o a un grupo de personas.",
    "texto2": "Abogar por / Defender / Promover",
    "texto3": "advocate /ˈæd.və.keɪt/",
    "texto4": "advocated / will advocate",
    "texto5": "They advocate for healthier eating habits in schools to improve children's health.",
    "texto6": "Ellos abogan por hábitos alimenticios más saludables en las escuelas para mejorar la salud de los niños."
  },
  {
    "texto1": "Luchar con gran esfuerzo para lograr algo o superar una dificultad.",
    "texto2": "Luchar / Esforzarse / Batallar",
    "texto3": "struggle /ˈstrʌɡ.əl/",
    "texto4": "struggled / will struggle",
    "texto5": "He had to struggle to finish the marathon, but he never gave up.",
    "texto6": "Tuvo que esforzarse mucho para terminar el maratón, pero nunca se rindió."
  },
  {
    "texto1": "Tener dificultades económicas o para sobrevivir.",
    "texto2": "Apuros / Penurias / Dificultades",
    "texto3": "struggle /ˈstrʌɡ.əl/",
    "texto4": "struggled / will struggle",
    "texto5": "Many families struggle to make ends meet in this current economy.",
    "texto6": "Muchas familias tienen dificultades para llegar a fin de mes en esta economía actual."
  },
  {
    "texto1": "Un esfuerzo grande y difícil para lograr algo.",
    "texto2": "Lucha / Esfuerzo / Dificultad",
    "texto3": "struggle /ˈstrʌɡ.əl/",
    "texto4": "struggles / will be a struggle",
    "texto5": "Her struggle for justice lasted for years, but she finally won.",
    "texto6": "Su lucha por la justicia duró años, pero finalmente ganó."
  },
  {
    "texto1": "Una pelea o combate físico en el que se ejerce fuerza.",
    "texto2": "Forcejeo / Pelea / Refriega",
    "texto3": "struggle /ˈstrʌɡ.əl/",
    "texto4": "struggles / will be a struggle",
    "texto5": "There was a brief struggle before the police subdued him and took him away.",
    "texto6": "Hubo un breve forcejeo antes de que la policía lo sometiera y se lo llevara."
  },
  {
    "texto1": "Una característica distintiva o cualidad importante de algo.",
    "texto2": "Característica / Atributo / Cualidad",
    "texto3": "feature /ˈfiːtʃər/",
    "texto4": "features / will be a feature",
    "texto5": "The new phone has many impressive features, including a high-resolution camera and a long-lasting battery.",
    "texto6": "El nuevo teléfono tiene muchas características impresionantes, incluyendo una cámara de alta resolución y una batería de larga duración."
  },
  {
    "texto1": "Una parte prominente del rostro, como los ojos, la nariz o la boca.",
    "texto2": "Rasgo / Facción / Rasgo facial",
    "texto3": "feature /ˈfiːtʃər/",
    "texto4": "features / will be a feature",
    "texto5": "Her most striking feature is her beautiful blue eyes and a kind smile.",
    "texto6": "Su rasgo más llamativo son sus hermosos ojos azules y una sonrisa amable."
  },
  {
    "texto1": "Presentar o incluir algo o a alguien como una parte importante o prominente.",
    "texto2": "Presentar / Destacar / Incluir",
    "texto3": "feature /ˈfiːtʃər/",
    "texto4": "featured / will feature",
    "texto5": "The documentary will feature interviews with famous scientists and their new discoveries.",
    "texto6": "El documental presentará entrevistas con científicos famosos y sus nuevos descubrimientos."
  },
  {
    "texto1": "Un artículo o programa especial que se presenta con prominencia en un periódico, revista, sitio web o emisión de televisión.",
    "texto2": "Reportaje / Artículo especial / Pieza central",
    "texto3": "feature /ˈfiːtʃər/",
    "texto4": "features / will be a feature",
    "texto5": "The newspaper ran a feature on the growing trend of remote work and its impact on society.",
    "texto6": "El periódico publicó un reportaje sobre la creciente tendencia del trabajo remoto y su impacto en la sociedad."
  },
  {
    "texto1": "Unión o conexión entre dos o más cosas, ideas o personas.",
    "texto2": "Vínculo / Conexión / Enlace",
    "texto3": "link /lɪŋk/",
    "texto4": "links / will be a link",
    "texto5": "There's a strong link between a healthy diet and a good physical condition.",
    "texto6": "Hay un fuerte vínculo entre una dieta saludable y una buena condición física."
  },
  {
    "texto1": "Un elemento en una página web que permite navegar a otra página o recurso al hacer clic en él.",
    "texto2": "Enlace / Hipervínculo / Link",
    "texto3": "link /lɪŋk/",
    "texto4": "links / will be a link",
    "texto5": "Click on the link to download the document you requested.",
    "texto6": "Haz clic en el enlace para descargar el documento que solicitaste."
  },
  {
    "texto1": "Conectar o unir dos o más cosas, personas o eventos.",
    "texto2": "Conectar / Unir / Vincular",
    "texto3": "link /lɪŋk/",
    "texto4": "linked / will link",
    "texto5": "The new bridge will link the two cities and improve communication.",
    "texto6": "El nuevo puente unirá las dos ciudades y mejorará la comunicación."
  },
  {
    "texto1": "Un eslabón en una cadena o serie.",
    "texto2": "Eslabón / Aro / Pieza",
    "texto3": "link /lɪŋk/",
    "texto4": "links / will be a link",
    "texto5": "Each link in the chain was carefully crafted by hand.",
    "texto6": "Cada eslabón de la cadena fue cuidadosamente elaborado a mano."
  },
  {
    "texto1": "Una persona, un objeto o un evento que es inusual, extraño o peculiar.",
    "texto2": "Rareza / Peculiaridad / Curiosidad",
    "texto3": "oddity /ˈɒd.ə.ti/",
    "texto4": "oddities / will be an oddity",
    "texto5": "The oddity of the situation was that nobody seemed to notice the elephant in the room.",
    "texto6": "La rareza de la situación era que nadie parecía notar el elefante en la habitación."
  },
  {
    "texto1": "Hacia adelante; continuando en una dirección o curso.",
    "texto2": "Hacia adelante / Adelante / En adelante",
    "texto3": "forth /fɔːrθ/",
    "texto4": "came forth / will go forth",
    "texto5": "From this day forth, I will work harder and dedicate myself to my goals.",
    "texto6": "De este día en adelante, trabajaré más duro y me dedicaré a mis metas."
  },
  {
    "texto1": "Fuera a la vista; hacia la existencia o a la luz.",
    "texto2": "A la vista / A la luz / Fuera",
    "texto3": "forth /fɔːrθ/",
    "texto4": "came forth / will come forth",
    "texto5": "The sun came forth from behind the clouds, bringing warmth and light.",
    "texto6": "El sol salió de detrás de las nubes, trayendo calidez y luz."
  },
  {
    "texto1": "Desde un lugar o fuente específica, o como un resultado.",
    "texto2": "Desde / A partir de / Como resultado",
    "texto3": "forth /fɔːrθ/",
    "texto4": "poured forth / will pour forth",
    "texto5": "The music poured forth from the speakers, filling the room with sound.",
    "texto6": "La música brotaba de los altavoces, llenando la habitación de sonido."
  },
  {
    "texto1": "Un trozo delgado de madera, más largo que ancho, que ha sido cortado o roto de un árbol o arbusto.",
    "texto2": "Palo / Rama / Vara",
    "texto3": "stick /stɪk/",
    "texto4": "sticks / will be a stick",
    "texto5": "The dog loves to fetch sticks in the park and play with them for hours.",
    "texto6": "Al perro le encanta ir a buscar palos en el parque y jugar con ellos durante horas."
  },
  {
    "texto1": "Un objeto largo y delgado utilizado para un propósito específico, como un bastón o un palo de hockey.",
    "texto2": "Bastón / Palo / Barra",
    "texto3": "stick /stɪk/",
    "texto4": "sticks / will be a stick",
    "texto5": "He used a walking stick to help him climb the hill safely.",
    "texto6": "Usó un bastón para ayudarse a subir la colina de manera segura."
  },
  {
    "texto1": "Adherirse o pegarse a una superficie.",
    "texto2": "Pegar / Adherir / Enganchar",
    "texto3": "stick /stɪk/",
    "texto4": "stuck / will stick",
    "texto5": "The mud stuck to his boots, making it difficult to walk.",
    "texto6": "El barro se le pegó a las botas, lo que le dificultaba caminar."
  },
  {
    "texto1": "Sobresalir o proyectarse de una superficie.",
    "texto2": "Asomar / Sobresalir / Proyectarse",
    "texto3": "stick /stɪk/",
    "texto4": "stuck / will stick",
    "texto5": "A small branch was sticking out of the bush and scratched my arm.",
    "texto6": "Una pequeña rama sobresalía del arbusto y me arañó el brazo."
  },
  {
    "texto1": "Ser difícil o imposible de quitar de un lugar o situación.",
    "texto2": "Atascarse / Quedarse atorado / Bloquearse",
    "texto3": "stick /stɪk/",
    "texto4": "stuck / will stick",
    "texto5": "The key got stuck in the lock and I couldn't open the door.",
    "texto6": "La llave se atascó en la cerradura y no pude abrir la puerta."
  },
  {
    "texto1": "Permanecer con algo, como una decisión o un plan, a pesar de las dificultades.",
    "texto2": "Perseverar / Mantenerse firme / Insistir",
    "texto3": "stick to /stɪk tuː/",
    "texto4": "stuck to / will stick to",
    "texto5": "You need to stick to your decision, even if it gets tough.",
    "texto6": "Tienes que mantenerte firme en tu decisión, incluso si se pone difícil."
  },
  {
    "texto1": "Un beneficio o ventaja adicional que se recibe por un trabajo, un cargo o una situación.",
    "texto2": "Beneficio / Ventaja / Extra",
    "texto3": "perk /pɜːrk/",
    "texto4": "perks / will be a perk",
    "texto5": "One of the perks of the job is free travel to different countries.",
    "texto6": "Uno de los beneficios del trabajo es viajar gratis a diferentes países."
  },
  {
    "texto1": "Levantar la cabeza de forma rápida y enérgica, a menudo para escuchar o mirar algo.",
    "texto2": "Levantar / Erguir / Alzar",
    "texto3": "perk up /pɜːrk ʌp/",
    "texto4": "perked up / will perk up",
    "texto5": "The dog perked up its ears when it heard the doorbell.",
    "texto6": "El perro levantó las orejas cuando escuchó el timbre."
  },
  {
    "texto1": "Profundo dolor o sufrimiento causado por la pérdida de algo o alguien, especialmente por la muerte de una persona.",
    "texto2": "Pena / Duelo / Tristeza profunda",
    "texto3": "grief /ɡriːf/",
    "texto4": "griefs / will be a grief",
    "texto5": "She felt overwhelming grief after the loss of her pet, a loyal dog for 15 years.",
    "texto6": "Ella sintió una pena abrumadora después de la pérdida de su mascota, un perro leal durante 15 años."
  },
  {
    "texto1": "Causa de gran angustia o molestia.",
    "texto2": "Angustia / Molestia / Sufrimiento",
    "texto3": "grief /ɡriːf/",
    "texto4": "griefs / will be a grief",
    "texto5": "The constant delays caused them a lot of grief during their travel.",
    "texto6": "Los constantes retrasos les causaron mucha molestia durante su viaje."
  },
  {
    "texto1": "Presumir o alardear de los propios logros, posesiones o cualidades de manera excesiva y jactanciosa.",
    "texto2": "Alardear / Presumir / Jactarse",
    "texto3": "brag /bræɡ/",
    "texto4": "bragged / will brag",
    "texto5": "He always brags about his expensive car to everyone he meets.",
    "texto6": "Él siempre alardea de su coche caro a todo el mundo que conoce."
  },
  {
    "texto1": "Un acto de presumir o una declaración jactanciosa.",
    "texto2": "Alarde / Fanfarronería / Presunción",
    "texto3": "brag /bræɡ/",
    "texto4": "brags / will be a brag",
    "texto5": "I'm not trying to make a brag, but I did win the competition fairly.",
    "texto6": "No estoy tratando de alardear, pero sí gané la competición de forma justa."
  },
  {
    "texto1": "Prestar dinero o un objeto a alguien con la expectativa de que sea devuelto.",
    "texto2": "Prestar / Dejar / Facilitar",
    "texto3": "lend /lɛnd/",
    "texto4": "lent / will lend",
    "texto5": "Can you lend me your pen for a moment to sign this document?",
    "texto6": "¿Puedes prestarme tu bolígrafo un momento para firmar este documento?"
  },
  {
    "texto1": "Dar o añadir una cualidad o característica a algo.",
    "texto2": "Dar / Aportar / Conferir",
    "texto3": "lend /lɛnd/",
    "texto4": "lent / will lend",
    "texto5": "The flowers lend a touch of beauty to the room and make it feel more welcoming.",
    "texto6": "Las flores aportan un toque de belleza a la habitación y la hacen sentir más acogedora."
  },
  {
    "texto1": "Permitirse o ser susceptible a algo.",
    "texto2": "Prestarse a / Ser propenso a / Permitir",
    "texto3": "lend /lɛnd/",
    "texto4": "lent / will lend",
    "texto5": "The story doesn't lend itself to a simple explanation because it's so complex.",
    "texto6": "La historia no se presta a una explicación sencilla porque es muy compleja."
  },
  {
    "texto1": "Guiar o dirigir a un grupo de personas o una organización.",
    "texto2": "Dirigir / Guiar / Encabezar",
    "texto3": "lead /liːd/",
    "texto4": "led / will lead",
    "texto5": "She will lead the team on the new project to success.",
    "texto6": "Ella dirigirá el equipo en el nuevo proyecto hacia el éxito."
  },
  {
    "texto1": "Ir delante o en primera posición.",
    "texto2": "Ir a la cabeza / Encabezar / Delantero",
    "texto3": "lead /liːd/",
    "texto4": "led / will lead",
    "texto5": "The fastest runner will lead the race from the beginning.",
    "texto6": "El corredor más rápido irá a la cabeza de la carrera desde el principio."
  },
  {
    "texto1": "Causar que algo ocurra o tenga un resultado específico.",
    "texto2": "Conducir a / Llevar a / Provocar",
    "texto3": "lead /liːd/",
    "texto4": "led / will lead",
    "texto5": "Lack of exercise can lead to health problems in the long run.",
    "texto6": "La falta de ejercicio puede llevar a problemas de salud a largo plazo."
  },
  {
    "texto1": "El acto o ejemplo de guiar o dirigir.",
    "texto2": "Liderazgo / Dirección / Guía",
    "texto3": "lead /liːd/",
    "texto4": "leads / will be a lead",
    "texto5": "Her strong lead inspired the rest of the team to work harder.",
    "texto6": "Su fuerte liderazgo inspiró al resto del equipo a trabajar más duro."
  },
  {
    "texto1": "El papel principal en una obra de teatro, película o grupo musical.",
    "texto2": "Protagonista / Papel principal / Voz principal",
    "texto3": "lead /liːd/",
    "texto4": "leads / will be a lead",
    "texto5": "He got the lead role in the school play because of his acting talent.",
    "texto6": "Él obtuvo el papel principal en la obra de teatro de la escuela debido a su talento para actuar."
  },
  {
    "texto1": "Un metal pesado, blando y gris, utilizado en baterías y otros productos.",
    "texto2": "Plomo",
    "texto3": "lead /lɛd/",
    "texto4": "leads / will be lead",
    "texto5": "Old pipes were often made of lead, which is now known to be toxic.",
    "texto6": "Las tuberías antiguas a menudo estaban hechas de plomo, que ahora se sabe que es tóxico."
  },
  {
    "texto1": "Un frío desagradable o ligeramente frío.",
    "texto2": "Fresco / Frío / Templado",
    "texto3": "chilly /ˈtʃɪl.i/",
    "texto4": "chillier / will be chilly",
    "texto5": "It's a bit chilly outside, so you might want to wear a jacket.",
    "texto6": "Hace un poco de frío afuera, así que quizás quieras ponerte una chaqueta."
  },
  {
    "texto1": "Una sensación de frío en el cuerpo, a menudo acompañada de escalofríos.",
    "texto2": "Escalofrío / Sensación de frío / Cardenal",
    "texto3": "chilly /ˈtʃɪl.i/",
    "texto4": "chillier / will be chilly",
    "texto5": "She felt a chilly sensation running down her spine when she heard the noise.",
    "texto6": "Sintió un escalofrío recorriendo su espalda cuando escuchó el ruido."
  },
  {
    "texto1": "De manera fría, distante o poco amigable.",
    "texto2": "Frío / Distante / Poco amigable",
    "texto3": "chilly /ˈtʃɪl.i/",
    "texto4": "chillier / will be chilly",
    "texto5": "His response was a bit chilly, and I felt unwelcome at the meeting.",
    "texto6": "Su respuesta fue un poco fría y me sentí incómodo en la reunión."
  },
  {
    "texto1": "Un punto de acceso o entrada a un lugar o sistema, ya sea físico o virtual.",
    "texto2": "Acceso / Entrada / Portal",
    "texto3": "gateway /ˈɡeɪt.weɪ/",
    "texto4": "gateways / will be a gateway",
    "texto5": "The city gate served as a gateway to the ancient fortress, protecting it from invaders.",
    "texto6": "La puerta de la ciudad servía como acceso a la antigua fortaleza, protegiéndola de los invasores."
  },
  {
    "texto1": "Un dispositivo o sistema que permite la comunicación entre redes con protocolos diferentes.",
    "texto2": "Pasarela / Puerta de enlace / Conector",
    "texto3": "gateway /ˈɡeɪt.weɪ/",
    "texto4": "gateways / will be a gateway",
    "texto5": "The internet router acts as a gateway to the worldwide web, allowing us to connect with others.",
    "texto6": "El router de internet actúa como una pasarela a la red mundial, permitiéndonos conectar con otros."
  },
  {
    "texto1": "Algo que sirve como medio para lograr algo más grande o más importante.",
    "texto2": "Vía / Canal / Paso",
    "texto3": "gateway /ˈɡeɪt.weɪ/",
    "texto4": "gateways / will be a gateway",
    "texto5": "This training program is a gateway to a new career and a better future.",
    "texto6": "Este programa de capacitación es una vía para una nueva carrera y un futuro mejor."
  },
  {
    "texto1": "Una gran cantidad de dinero, propiedades u otros recursos valiosos.",
    "texto2": "Riqueza / Fortuna / Patrimonio",
    "texto3": "wealth /wɛlθ/",
    "texto4": "wealths / will be wealth",
    "texto5": "The family accumulated great wealth over generations through their business.",
    "texto6": "La familia acumuló una gran riqueza a lo largo de generaciones a través de su negocio."
  },
  {
    "texto1": "Abundancia de algo deseable o valioso.",
    "texto2": "Abundancia / Profusión / Riqueza",
    "texto3": "wealth /wɛlθ/",
    "texto4": "wealths / will be wealth",
    "texto5": "The country has a wealth of natural resources, including oil and gas.",
    "texto6": "El país tiene una gran riqueza de recursos naturales, incluyendo petróleo y gas."
  },
  {
    "texto1": "El estado de ser rico o próspero.",
    "texto2": "Prosperidad / Afluencia / Opulencia",
    "texto3": "wealth /wɛlθ/",
    "texto4": "wealths / will be a wealth",
    "texto5": "His goal in life was to achieve wealth and happiness for his family.",
    "texto6": "Su objetivo en la vida era alcanzar la riqueza y la felicidad para su familia."
  },
  {
    "texto1": "Realizar o llevar a cabo una acción, especialmente una ilegal o incorrecta.",
    "texto2": "Cometer / Perpetrar / Realizar",
    "texto3": "commit /kəˈmɪt/",
    "texto4": "committed / will commit",
    "texto5": "He committed a serious error in judgment that cost him the project.",
    "texto6": "Cometió un grave error de juicio que le costó el proyecto."
  },
  {
    "texto1": "Dedicarse o prometerse firmemente a una persona, causa o curso de acción.",
    "texto2": "Comprometerse / Dedicarse / Prometerse",
    "texto3": "commit /kəˈmɪt/",
    "texto4": "committed / will commit",
    "texto5": "She is committed to her work and always gives her best.",
    "texto6": "Ella está comprometida con su trabajo y siempre da lo mejor de sí."
  },
  {
    "texto1": "Confiar a alguien o algo al cuidado de otro, o enviar a alguien a una institución, como una prisión o un hospital psiquiátrico.",
    "texto2": "Encomendar / Ingresar / Internar",
    "texto3": "commit /kəˈmɪt/",
    "texto4": "committed / will commit",
    "texto5": "The judge decided to commit the patient to a psychiatric hospital for treatment.",
    "texto6": "El juez decidió internar al paciente en un hospital psiquiátrico para recibir tratamiento."
  },
  {
    "texto1": "En sistemas de control de versiones, guardar los cambios realizados en un archivo o conjunto de archivos en el repositorio.",
    "texto2": "Confirmar / Guardar cambios / Consolidar",
    "texto3": "commit /kəˈmɪt/",
    "texto4": "committed / will commit",
    "texto5": "Don't forget to commit your changes before pushing the code to the repository.",
    "texto6": "No olvides confirmar tus cambios antes de subir el código al repositorio."
  },
  {
    "texto1": "Un acto o una instancia de cometer algo.",
    "texto2": "Compromiso / Acto / Ejecución",
    "texto3": "commit /kəˈmɪt/",
    "texto4": "commits / will be a commit",
    "texto5": "The company showed a strong commit to environmental protection by reducing its carbon footprint.",
    "texto6": "La empresa mostró un fuerte compromiso con la protección del medio ambiente al reducir su huella de carbono."
  },
  {
    "texto1": "Producir o generar un resultado, beneficio o cosecha.",
    "texto2": "Producir / Generar / Rendir",
    "texto3": "yield /jiːld/",
    "texto4": "yielded / will yield",
    "texto5": "The apple tree yields a lot of fruit every summer, which we use to make cider.",
    "texto6": "El manzano produce mucha fruta cada verano, que usamos para hacer sidra."
  },
  {
    "texto1": "Ceder el paso o la prioridad, especialmente en el tráfico o en una discusión.",
    "texto2": "Ceder el paso / Ceder / Rendirse",
    "texto3": "yield /jiːld/",
    "texto4": "yielded / will yield",
    "texto5": "You must yield to pedestrians at the crosswalk, it's the law.",
    "texto6": "Debes ceder el paso a los peatones en el cruce de peatones, es la ley."
  },
  {
    "texto1": "Colapsar o doblarse bajo presión o fuerza.",
    "texto2": "Ceder / Colapsar / Doblarse",
    "texto3": "yield /jiːld/",
    "texto4": "yielded / will yield",
    "texto5": "The old bridge might yield under the heavy weight of the new trucks.",
    "texto6": "El viejo puente podría ceder bajo el peso pesado de los nuevos camiones."
  },
  {
    "texto1": "La cantidad producida o generada por un proceso o cultivo.",
    "texto2": "Rendimiento / Producción / Cosecha",
    "texto3": "yield /jiːld/",
    "texto4": "yields / will be a yield",
    "texto5": "The farmer was pleased with the high yield of corn this year, which meant a great profit.",
    "texto6": "El agricultor estaba contento con el alto rendimiento de maíz este año, lo que significó una gran ganancia."
  },
  {
    "texto1": "El ingreso o ganancia obtenida de una inversión.",
    "texto2": "Rentabilidad / Rendimiento / Ganancia",
    "texto3": "yield /jiːld/",
    "texto4": "yields / will be a yield",
    "texto5": "The bond has a high yield, making it an attractive investment for many people.",
    "texto6": "El bono tiene un alto rendimiento, lo que lo convierte en una inversión atractiva para muchas personas."
  },
  {
    "texto1": "Que tiene poca fuerza física, energía o resistencia.",
    "texto2": "Débil / Frágil / Enteble",
    "texto3": "weak /wiːk/",
    "texto4": "weaker / will be weak",
    "texto5": "He felt too weak to lift the heavy box after being sick for a week.",
    "texto6": "Se sentía demasiado débil para levantar la caja pesada después de haber estado enfermo durante una semana."
  },
  {
    "texto1": "Que es propenso a ceder, romperse o fallar; que no es fuerte o sólido.",
    "texto2": "Débil / Vulnerable / Poco resistente",
    "texto3": "weak /wiːk/",
    "texto4": "weaker / will be weak",
    "texto5": "The bridge's structure was weak and needed repairs to be safe.",
    "texto6": "La estructura del puente era débil y necesitaba reparaciones para ser segura."
  },
  {
    "texto1": "Que carece de poder, autoridad o influencia.",
    "texto2": "Débil / Impotente / Indefenso",
    "texto3": "weak /wiːk/",
    "texto4": "weaker / will be weak",
    "texto5": "The argument was based on weak evidence and couldn't be proven.",
    "texto6": "El argumento se basaba en pruebas débiles y no pudo ser probado."
  },
  {
    "texto1": "Que tiene una concentración o intensidad baja, como una bebida o una luz.",
    "texto2": "Flojo / Suave / Diluido",
    "texto3": "weak /wiːk/",
    "texto4": "weaker / will be weak",
    "texto5": "I prefer weak coffee in the mornings, it's easier on my stomach.",
    "texto6": "Prefiero el café flojo por las mañanas, es más suave para mi estómago."
  },
  {
    "texto1": "Que no tiene convicción o resolución; que es fácilmente influenciable.",
    "texto2": "Débil de carácter / Indeciso / Influenciable",
    "texto3": "weak /wiːk/",
    "texto4": "weaker / will be weak",
    "texto5": "He has a weak will when it comes to resisting desserts, so he always eats them.",
    "texto6": "Tiene una voluntad débil cuando se trata de resistir los postres, por lo que siempre los come."
  },
  {
    "texto1": "Una réplica de un ser humano, a menudo utilizada para exhibiciones o pruebas.",
    "texto2": "Muñeco / Maniquí / Bulto",
    "texto3": "dummy /ˈdʌm.i/",
    "texto4": "dummies / will be a dummy",
    "texto5": "The crash test dummy was used to simulate a person in a car accident.",
    "texto6": "El muñeco de prueba de choque se usó para simular a una persona en un accidente de coche."
  },
  {
    "texto1": "Una persona tonta o estúpida (uso informal y a menudo despectivo).",
    "texto2": "Tonto / Bobo / Idiota",
    "texto3": "dummy /ˈdʌm.i/",
    "texto4": "dummies / will be a dummy",
    "texto5": "Don't be such a dummy and make that mistake again.",
    "texto6": "No seas tan tonto y cometas ese error de nuevo."
  },
  {
    "texto1": "Algo falso o de imitación, utilizado para reemplazar a algo real.",
    "texto2": "Falso / De mentira / Imitación",
    "texto3": "dummy /ˈdʌm.i/",
    "texto4": "dummies / will be a dummy",
    "texto5": "The shop window had a dummy cake on display.",
    "texto6": "El escaparate de la tienda tenía un pastel de mentira en exhibición."
  },
  {
    "texto1": "En algunos juegos de cartas, un jugador que ha revelado sus cartas y cuyo compañero las juega.",
    "texto2": "Muerto / Dummy (en juegos de cartas)",
    "texto3": "dummy /ˈdʌm.i/",
    "texto4": "dummies / will be a dummy",
    "texto5": "In bridge, the dummy lays down their cards and lets their partner play.",
    "texto6": "En bridge, el muerto revela sus cartas y deja que su compañero juegue."
  },
  {
    "texto1": "Llevar o transportar algo o a alguien de un lugar a otro.",
    "texto2": "Traer / Llevar / Aportar",
    "texto3": "bring /brɪŋ/",
    "texto4": "brought / will bring",
    "texto5": "Don't forget to bring your umbrella; it might rain later.",
    "texto6": "No olvides traer tu paraguas; podría llover más tarde."
  },
  {
    "texto1": "Causar que algo ocurra o suceda.",
    "texto2": "Provocar / Causar / Generar",
    "texto3": "bring about /brɪŋ əˈbaʊt/",
    "texto4": "brought about / will bring about",
    "texto5": "The new policy will bring about significant changes to the company.",
    "texto6": "La nueva política provocará cambios significativos en la empresa."
  },
  {
    "texto1": "Hacer que alguien o algo llegue a un estado o condición particular.",
    "texto2": "Poner / Dejar / Conducir a",
    "texto3": "bring /brɪŋ/",
    "texto4": "brought / will bring",
    "texto5": "The bad news brought her to tears when she heard it.",
    "texto6": "La mala noticia la hizo llorar cuando la escuchó."
  },
  {
    "texto1": "Presentar una demanda o una acusación formal.",
    "texto2": "Presentar / Interponer / Entablar",
    "texto3": "bring /brɪŋ/",
    "texto4": "brought / will bring",
    "texto5": "They decided to bring a lawsuit against the company for the damages.",
    "texto6": "Decidieron interponer una demanda contra la empresa por los daños."
  },
  {
    "texto1": "Con relación a o con respecto a algo o alguien.",
    "texto2": "Respecto a / En cuanto a / Sobre",
    "texto3": "regarding /rɪˈɡɑːrdɪŋ/",
    "texto4": "regardings / will be a regarding",
    "texto5": "I have a question regarding your recent announcement about the new policy.",
    "texto6": "Tengo una pregunta con respecto a su reciente anuncio sobre la nueva política."
  },
  {
    "texto1": "Considerar o ver a alguien o algo de una manera particular.",
    "texto2": "Considerar / Ver / Estimar",
    "texto3": "regard /rɪˈɡɑːrd/",
    "texto4": "regarded / will regard",
    "texto5": "She is regarded as one of the best artists of her generation for her unique style.",
    "texto6": "Ella es considerada una de las mejores artistas de su generación por su estilo único."
  },
  {
    "texto1": "Mirar o observar a alguien o algo, prestando atención.",
    "texto2": "Mirar / Observar / Contemplar",
    "texto3": "regard /rɪˈɡɑːrd/",
    "texto4": "regarded / will regard",
    "texto5": "She regarded him with a puzzled expression, trying to understand what he meant.",
    "texto6": "Ella lo miró con una expresión perpleja, tratando de entender lo que él quería decir."
  },
  {
    "texto1": "Respeto, admiración o aprecio por alguien o algo.",
    "texto2": "Respeto / Admiración / Estima",
    "texto3": "regard /rɪˈɡɑːrd/",
    "texto4": "regards / will be a regard",
    "texto5": "I have great regard for her honesty, as she always tells the truth.",
    "texto6": "Tengo un gran respeto por su honestidad, ya que siempre dice la verdad."
  },
  {
    "texto1": "Atención o consideración hacia algo.",
    "texto2": "Atención / Consideración / Cuidado",
    "texto3": "regard /rɪˈɡɑːrd/",
    "texto4": "regards / will be a regard",
    "texto5": "You should act with due regard for safety when you are working with these machines.",
    "texto6": "Debes actuar con la debida consideración por la seguridad cuando trabajes con estas máquinas."
  },
  {
    "texto1": "Saludos o buenos deseos para una persona o un grupo, usado comúnmente para cerrar correos electrónicos.",
    "texto2": "Saludos",
    "texto3": "regards /rɪˈɡɑːrdz/",
    "texto4": "regards",
    "texto5": "Please give my best regards to your family when you see them.",
    "texto6": "Por favor, dale mis mejores saludos a tu familia cuando los veas."
  },
  {
    "texto1": "Sorprender o asombrar a alguien de una manera que causa admiración o desconcierto.",
    "texto2": "Asombrar / Sorprender / Maravillar",
    "texto3": "amaze /əˈmeɪz/",
    "texto4": "amazed / will amaze",
    "texto5": "The magician's tricks always amaze the audience, leaving them in awe.",
    "texto6": "Los trucos del mago siempre asombran a la audiencia, dejándolos boquiabiertos."
  },
  {
    "texto1": "Causar gran admiración o impacto.",
    "texto2": "Impresionar / Deslumbrar / Fascinar",
    "texto3": "amaze /əˈmeɪz/",
    "texto4": "amazed / will amaze",
    "texto5": "Her talent continues to amaze everyone who sees her perform on stage.",
    "texto6": "Su talento sigue asombrando a todos los que la ven actuar en el escenario."
  },
  {
    "texto1": "Que se espera que ocurra o se realice en un momento determinado; con fecha límite.",
    "texto2": "Previsto / Vencido / A pagar",
    "texto3": "due /duː/",
    "texto4": "dues / will be due",
    "texto5": "The rent is due on the first of every month, so we need to pay it soon.",
    "texto6": "El alquiler vence el primer día de cada mes, así que tenemos que pagarlo pronto."
  },
  {
    "texto1": "Adecuado o apropiado para una situación o propósito.",
    "texto2": "Debido / Apropiado / Justo",
    "texto3": "due /duː/",
    "texto4": "dues / will be due",
    "texto5": "Please give the matter due consideration before making a decision.",
    "texto6": "Por favor, tómese el asunto con la debida consideración antes de tomar una decisión."
  },
  {
    "texto1": "Como resultado de o causado por algo.",
    "texto2": "Debido a / A causa de / Gracias a",
    "texto3": "due to /duː tuː/",
    "texto4": "dues to / will be due to",
    "texto5": "The accident was due to careless driving, according to the police report.",
    "texto6": "El accidente fue debido a la conducción descuidada, según el informe policial."
  },
  {
    "texto1": "Un pago o cuota que se debe.",
    "texto2": "Cuota / Cargo / Tarifa",
    "texto3": "due /duː/",
    "texto4": "dues / will be due",
    "texto5": "Membership dues are collected annually to maintain the club.",
    "texto6": "Las cuotas de membresía se cobran anualmente para mantener el club."
  },
  {
    "texto1": "Una plataforma elevada en un teatro, sala de conciertos, etc., donde actúan los artistas.",
    "texto2": "Escenario / Tarima / Plataforma",
    "texto3": "stage /steɪdʒ/",
    "texto4": "stages / will be a stage",
    "texto5": "The band walked onto the stage to a cheering crowd, ready to perform.",
    "texto6": "La banda subió al escenario ante una multitud que aplaudía, lista para actuar."
  },
  {
    "texto1": "Un período o fase en el desarrollo de algo.",
    "texto2": "Etapa / Fase / Estadio",
    "texto3": "stage /steɪdʒ/",
    "texto4": "stages / will be a stage",
    "texto5": "The project is in its final stage of development and will be released soon.",
    "texto6": "El proyecto está en su etapa final de desarrollo y se lanzará pronto."
  },
  {
    "texto1": "Organizar o llevar a cabo un evento, una obra de teatro o una protesta.",
    "texto2": "Organizar / Montar / Escenificar",
    "texto3": "stage /steɪdʒ/",
    "texto4": "staged / will stage",
    "texto5": "The students decided to stage a protest against the new rules.",
    "texto6": "Los estudiantes decidieron organizar una protesta contra las nuevas reglas."
  },
  {
    "texto1": "La profesión de actor o actriz en el teatro.",
    "texto2": "Teatro / Escena / Interpretación",
    "texto3": "stage /steɪdʒ/",
    "texto4": "stages / will be a stage",
    "texto5": "She always dreamed of a career on the stage and becoming a famous actress.",
    "texto6": "Ella siempre soñó con una carrera en el teatro y convertirse en una actriz famosa."
  },
  {
    "texto1": "Ser del tamaño o la forma correctos para alguien o algo.",
    "texto2": "Ajustar / Quedar bien / Servir",
    "texto3": "fit /fɪt/",
    "texto4": "fitted / will fit",
    "texto5": "These shoes fit me perfectly, they are very comfortable.",
    "texto6": "Estos zapatos me quedan perfectos, son muy cómodos."
  },
  {
    "texto1": "Ser adecuado o apropiado para una situación o propósito.",
    "texto2": "Encajar / Ser apropiado / Corresponder",
    "texto3": "fit /fɪt/",
    "texto4": "fitted / will fit",
    "texto5": "His explanation didn't quite fit the facts presented in court.",
    "texto6": "Su explicación no encajaba del todo con los hechos presentados en el tribunal."
  },
  {
    "texto1": "Instalar o colocar algo en una posición específica.",
    "texto2": "Instalar / Montar / Colocar",
    "texto3": "fit /fɪt/",
    "texto4": "fitted / will fit",
    "texto5": "We need to fit a new lock on the door for extra security.",
    "texto6": "Necesitamos instalar una cerradura nueva en la puerta para mayor seguridad."
  },
  {
    "texto1": "En buena condición física o saludable.",
    "texto2": "En forma / Saludable / Atlético",
    "texto3": "fit /fɪt/",
    "texto4": "fitter / will be fit",
    "texto5": "She works out regularly to stay fit and healthy.",
    "texto6": "Ella hace ejercicio regularmente para mantenerse en forma y saludable."
  },
  {
    "texto1": "Un acceso o arrebato repentino de una emoción o enfermedad.",
    "texto2": "Ataque / Acceso / Arrebato",
    "texto3": "fit /fɪt/",
    "texto4": "fits / will be a fit",
    "texto5": "He had a fit of coughing after inhaling the smoke from the bonfire.",
    "texto6": "Le dio un ataque de tos después de inhalar el humo de la hoguera."
  },
  {
    "texto1": "Percibir con los ojos; notar o ser consciente de algo usando el sentido de la vista.",
    "texto2": "Ver / Mirar / Observar",
    "texto3": "see /siː/",
    "texto4": "saw / will see",
    "texto5": "Did you see that beautiful bird on the tree just now?",
    "texto6": "¿Viste ese pájaro hermoso en el árbol justo ahora?"
  },
  {
    "texto1": "Entender o comprender algo.",
    "texto2": "Entender / Comprender / Darse cuenta",
    "texto3": "see /siː/",
    "texto4": "saw / will see",
    "texto5": "Now I see what you mean and I agree with you.",
    "texto6": "Ahora entiendo lo que quieres decir y estoy de acuerdo contigo."
  },
  {
    "texto1": "Encontrarse o reunirse con alguien.",
    "texto2": "Ver a / Reunirse con / Encontrarse con",
    "texto3": "see /siː/",
    "texto4": "saw / will see",
    "texto5": "I'll see you tomorrow at the office to discuss the new project.",
    "texto6": "Te veré mañana en la oficina para discutir el nuevo proyecto."
  },
  {
    "texto1": "Acompañar a alguien a un lugar o guiarlo.",
    "texto2": "Acompañar / Guiar / Llevar",
    "texto3": "see /siː/",
    "texto4": "saw / will see",
    "texto5": "Let me see you to the door and make sure you get there safely.",
    "texto6": "Déjame acompañarte a la puerta y asegurarme de que llegues a salvo."
  },
  {
    "texto1": "Asegurarse de que algo se haga o suceda.",
    "texto2": "Asegurarse / Encargarse / Velar por",
    "texto3": "see to /siː tuː/",
    "texto4": "saw to / will see to",
    "texto5": "Can you see to it that the report is finished on time?",
    "texto6": "¿Puedes encargarte de que el informe esté terminado a tiempo?"
  },
  {
    "texto1": "Hacerse visible o presentarse, especialmente de forma inesperada o repentina.",
    "texto2": "Aparecer / Surgir / Manifestarse",
    "texto3": "appear /əˈpɪər/",
    "texto4": "appeared / will appear",
    "texto5": "A strange light appeared in the sky, and we didn't know what it was.",
    "texto6": "Una luz extraña apareció en el cielo, y no sabíamos lo que era."
  },
  {
    "texto1": "Dar la impresión de ser o existir de cierta manera.",
    "texto2": "Parecer / Aparentar / Tener aspecto de",
    "texto3": "appear /əˈpɪər/",
    "texto4": "appeared / will appear",
    "texto5": "He appears to be very tired today after working all night.",
    "texto6": "Parece estar muy cansado hoy después de trabajar toda la noche."
  },
  {
    "texto1": "Presentarse formalmente en un lugar, como un tribunal o un escenario.",
    "texto2": "Comparecer / Actuar / Presentarse",
    "texto3": "appear /əˈpɪər/",
    "texto4": "appeared / will appear",
    "texto5": "The lawyer will appear in court tomorrow to defend his client.",
    "texto6": "El abogado comparecerá ante el tribunal mañana para defender a su cliente."
  },
  {
    "texto1": "Ser publicado o salir a la luz (refiriéndose a un libro, artículo, etc.).",
    "texto2": "Publicarse / Salir / Ver la luz",
    "texto3": "appear /əˈpɪər/",
    "texto4": "appeared / will appear",
    "texto5": "His new novel will appear next month in all the major bookstores.",
    "texto6": "Su nueva novela se publicará el próximo mes en todas las librerías principales."
  },
  {
    "texto1": "Un trozo de madera plano y largo, a menudo utilizado para la construcción o la artesanía.",
    "texto2": "Tabla / Tablón",
    "texto3": "board /bɔːrd/",
    "texto4": "boards / will be a board",
    "texto5": "He used a long board to make a shelf for his books.",
    "texto6": "Él usó una tabla larga para hacer un estante para sus libros."
  },
  {
    "texto1": "Una pieza de material duro y plano, a menudo utilizada para exhibir información, como en una pizarra o un tablón de anuncios.",
    "texto2": "Pizarra / Tablón / Panel",
    "texto3": "board /bɔːrd/",
    "texto4": "boards / will be a board",
    "texto5": "She wrote the lesson on the board for all the students to see.",
    "texto6": "Ella escribió la lección en la pizarra para que todos los estudiantes la vieran."
  },
  {
    "texto1": "Un grupo de personas que dirige o administra una organización, empresa o institución.",
    "texto2": "Junta / Consejo / Comité",
    "texto3": "board /bɔːrd/",
    "texto4": "boards / will be a board",
    "texto5": "The board of directors approved the new project's budget.",
    "texto6": "La junta directiva aprobó el presupuesto del nuevo proyecto."
  },
  {
    "texto1": "Subir a un vehículo de transporte público como un avión, tren o barco.",
    "texto2": "Embarcar / Subir a bordo",
    "texto3": "board /bɔːrd/",
    "texto4": "boarded / will board",
    "texto5": "Passengers are now ready to board the plane to Paris.",
    "texto6": "Los pasajeros ya están listos para embarcar en el avión a París."
  },
  {
    "texto1": "Proporcionar comida y alojamiento por un precio.",
    "texto2": "Alojarse / Hospedar / Dar pensión",
    "texto3": "board /bɔːrd/",
    "texto4": "boarded / will board",
    "texto5": "He boards with a local family while studying abroad.",
    "texto6": "Él se aloja con una familia local mientras estudia en el extranjero."
  },
  {
    "texto1": "Que tiene un carácter o temperamento suave, amable y considerado, evitando la brusquedad o la dureza.",
    "texto2": "Amable / Suave / Tierno",
    "texto3": "gentle /ˈdʒɛntəl/",
    "texto4": "gentler / will be gentle",
    "texto5": "He has a very gentle nature and is always kind to everyone, even to strangers.",
    "texto6": "Tiene un carácter muy amable y siempre es bueno con todos, incluso con los extraños."
  },
  {
    "texto1": "Que es delicado, ligero y no causa daño ni dolor, especialmente en el tacto o el movimiento.",
    "texto2": "Delicado / Leve / Suave",
    "texto3": "gentle /ˈdʒɛntəl/",
    "texto4": "gentler / will be gentle",
    "texto5": "She applied the cream with gentle strokes to avoid irritating her sensitive skin.",
    "texto6": "Aplicó la crema con suaves toques para evitar irritar su piel sensible."
  },
  {
    "texto1": "Que tiene una inclinación o pendiente ligera y gradual.",
    "texto2": "Suave / Leve / Ligero",
    "texto3": "gentle /ˈdʒɛntəl/",
    "texto4": "gentler / will be gentle",
    "texto5": "The path led down a gentle slope to the river, making it easy to walk.",
    "texto6": "El camino bajaba por una suave pendiente hasta el río, lo que lo hacía fácil de caminar."
  },
  {
    "texto1": "Que pertenece a una clase social distinguida o noble.",
    "texto2": "Noble / De buena familia / Distinguido",
    "texto3": "gentle /ˈdʒɛntəl/",
    "texto4": "gentler / will be gentle",
    "texto5": "He was born into a gentle family with a long history of serving the country.",
    "texto6": "Nació en una familia noble con una larga historia de servir al país."
  },
  {
    "texto1": "Formular una pregunta a alguien para obtener información o una respuesta.",
    "texto2": "Preguntar / Interrogar / Cuestionar",
    "texto3": "ask /æsk/",
    "texto4": "asked / will ask",
    "texto5": "I need to ask my teacher about the homework because I'm a bit confused about the instructions.",
    "texto6": "Necesito preguntarle a mi profesor sobre la tarea porque estoy un poco confundido con las instrucciones."
  },
  {
    "texto1": "Pedir algo, como ayuda, permiso o un favor.",
    "texto2": "Pedir / Solicitar / Rogar",
    "texto3": "ask /æsk/",
    "texto4": "asked / will ask",
    "texto5": "She decided to ask for a raise at work because she felt she deserved it.",
    "texto6": "Ella decidió pedir un aumento en el trabajo porque sentía que se lo merecía."
  },
  {
    "texto1": "Invitar a alguien a ir a un lugar o a hacer algo.",
    "texto2": "Invitar / Convidar / Llamar",
    "texto3": "ask /æsk/",
    "texto4": "asked / will ask",
    "texto5": "He asked her to the dance, and she was very happy to accept.",
    "texto6": "Él la invitó al baile, y ella estaba muy feliz de aceptar."
  },
  {
    "texto1": "Exigir o requerir algo, especialmente un precio o una condición.",
    "texto3": "ask /æsk/",
    "texto4": "asked / will ask",
    "texto5": "The antique dealer was asking a very high price for the vase, so we decided not to buy it.",
    "texto6": "El anticuario estaba pidiendo un precio muy alto por el jarrón, así que decidimos no comprarlo."
  },
  {
    "texto1": "Depender de alguien o algo para recibir apoyo, ayuda o para que algo suceda.",
    "texto2": "Depender / Confiar / Contar con",
    "texto3": "rely on /rɪˈlaɪ ɒn/",
    "texto4": "relied on / will rely on",
    "texto5": "You can always rely on me for help, no matter what the situation is.",
    "texto6": "Siempre puedes contar conmigo para que te ayude, sin importar cuál sea la situación."
  },
  {
    "texto1": "Tener confianza o fe en alguien o algo.",
    "texto2": "Confiar / Fiarse / Creer en",
    "texto3": "rely on /rɪˈlaɪ ɒn/",
    "texto4": "relied on / will rely on",
    "texto5": "We rely on our data for accurate predictions and to make important decisions.",
    "texto6": "Confiamos en nuestros datos para predicciones precisas y para tomar decisiones importantes."
  },
  {
    "texto1": "Que tiene la capacidad, los medios o la cualificación para hacer algo.",
    "texto2": "Capaz / Habilidoso / Competente",
    "texto3": "able /ˈeɪbəl/",
    "texto4": "abler / will be able",
    "texto5": "She is able to speak three languages fluently, which is a great skill to have.",
    "texto6": "Ella es capaz de hablar tres idiomas con fluidez, lo que es una gran habilidad."
  },
  {
    "texto1": "Que tiene el poder o la oportunidad de hacer algo.",
    "texto2": "Capaz de / En condiciones de / Con posibilidad de",
    "texto3": "able /ˈeɪbəl/",
    "texto4": "abler / will be able",
    "texto5": "I won't be able to attend the meeting tomorrow because I have another appointment.",
    "texto6": "No podré asistir a la reunión mañana porque tengo otra cita."
  },
  {
    "texto1": "Que es inteligente, competente o tiene talento.",
    "texto2": "Inteligente / Capaz / Talentoso",
    "texto3": "able /ˈeɪbəl/",
    "texto4": "abler / will be able",
    "texto5": "He is an able student who quickly grasps new concepts and excels in his classes.",
    "texto6": "Es un estudiante capaz que asimila rápidamente nuevos conceptos y se destaca en sus clases."
  },
  {
    "texto1": "Dirigir o apuntar algo, como un arma o una cámara, hacia un objetivo específico.",
    "texto2": "Apuntar / Enfoque / Dirigir",
    "texto3": "aim /eɪm/",
    "texto4": "aimed / will aim",
    "texto5": "He aimed the camera at the bird to take a photo.",
    "texto6": "Él apuntó la cámara al pájaro para tomar una foto."
  },
  {
    "texto1": "Tener la intención de lograr un objetivo o meta.",
    "texto2": "Aspirar / Pretender / Tener como objetivo",
    "texto3": "aim /eɪm/",
    "texto4": "aimed / will aim",
    "texto5": "She aims to become a doctor so she can help people.",
    "texto6": "Ella aspira a convertirse en doctora para poder ayudar a la gente."
  },
  {
    "texto1": "El propósito o intención detrás de una acción.",
    "texto2": "Objetivo / Meta / Propósito",
    "texto3": "aim /eɪm/",
    "texto4": "aims / will be an aim",
    "texto5": "The aim of the project is to reduce waste in the city.",
    "texto6": "El objetivo del proyecto es reducir los residuos en la ciudad."
  },
  {
    "texto1": "La acción de apuntar o dirigir algo.",
    "texto2": "Puntería / Apunte / Dirección",
    "texto3": "aim /eɪm/",
    "texto4": "aims / will be an aim",
    "texto5": "Her aim was so precise that she hit the target every time.",
    "texto6": "Su puntería era tan precisa que le daba al objetivo cada vez."
  },
  {
    "texto1": "Revolcarse en lodo, agua o polvo, generalmente para refrescarse o por placer.",
    "texto2": "Revolcarse / Cerdear / Bañarse",
    "texto3": "wallow /ˈwɒl.oʊ/",
    "texto4": "wallowed / will wallow",
    "texto5": "The pigs wallow in the mud to keep cool on a hot day.",
    "texto6": "Los cerdos se revuelcan en el lodo para mantenerse frescos en un día caluroso."
  },
  {
    "texto1": "Permitirse un sentimiento, emoción o situación, especialmente una desagradable, de manera prolongada y a menudo autodestructiva.",
    "texto2": "Regodearse / Deleitarse / Recrearse",
    "texto3": "wallow /ˈwɒl.oʊ/",
    "texto4": "wallowed / will wallow",
    "texto5": "She's wallowing in self-pity after the breakup, refusing to move on.",
    "texto6": "Ella se está regodeando en la autocompasión después de la ruptura, negándose a seguir adelante."
  },
  {
    "texto1": "Una zona fangosa o de lodo donde los animales se revuelcan.",
    "texto2": "Revolcadero / Lodazal / Cienagal",
    "texto3": "wallow /ˈwɒl.oʊ/",
    "texto4": "wallows / will be a wallow",
    "texto5": "The buffalo found a large wallow to cool off near the river.",
    "texto6": "El búfalo encontró un gran revolcadero para refrescarse cerca del río."
  },
  {
    "texto1": "Hundirse o descender bajo la superficie del agua o de un líquido.",
    "texto2": "Hundirse / Sumergirse / Irse a pique",
    "texto3": "sink /sɪŋk/",
    "texto4": "sank / will sink",
    "texto5": "The heavy stone began to sink in the water, creating ripples on the surface.",
    "texto6": "La piedra pesada comenzó a hundirse en el agua, creando ondas en la superficie."
  },
  {
    "texto1": "Descender o moverse hacia abajo lentamente.",
    "texto2": "Bajar / Caer / Descender",
    "texto3": "sink /sɪŋk/",
    "texto4": "sank / will sink",
    "texto5": "The sun began to sink below the horizon, painting the sky with orange and pink colors.",
    "texto6": "El sol comenzó a descender por debajo del horizonte, pintando el cielo con colores anaranjados y rosados."
  },
  {
    "texto1": "Empeorar o disminuir en calidad, cantidad o intensidad.",
    "texto2": "Deteriorarse / Degradar / Disminuir",
    "texto3": "sink /sɪŋk/",
    "texto4": "sank / will sink",
    "texto5": "His health began to sink after the illness, so he needed medical attention.",
    "texto6": "Su salud comenzó a deteriorarse después de la enfermedad, por lo que necesitaba atención médica."
  },
  {
    "texto1": "Un recipiente fijo con grifos, generalmente en una cocina o baño, para lavarse o lavar cosas.",
    "texto2": "Fregadero / Lavabo / Pila",
    "texto3": "sink /sɪŋk/",
    "texto4": "sinks / will be a sink",
    "texto5": "Please put the dirty dishes in the kitchen sink so I can wash them later.",
    "texto6": "Por favor, pon los platos sucios en el fregadero de la cocina para que pueda lavarlos más tarde."
  },
  {
    "texto1": "Un lugar bajo o deprimido donde el agua tiende a acumularse.",
    "texto2": "Depresión / Hondonada / Sumidero",
    "texto3": "sink /sɪŋk/",
    "texto4": "sinks / will be a sink",
    "texto5": "The area became a natural sink for rainwater, which created a small pond.",
    "texto6": "El área se convirtió en un sumidero natural para el agua de lluvia, lo que creó un pequeño estanque."
  },
  {
    "texto1": "Un mamífero marino con aletas, pelaje grueso y cuerpo fusiforme, que vive en regiones costeras y polares.",
    "texto2": "Foca / Lobo marino / Otaria",
    "texto3": "seal /siːl/",
    "texto4": "seals / will be a seal",
    "texto5": "We saw a large seal basking on the rocks and enjoying the sun.",
    "texto6": "Vimos una foca grande tomando el sol en las rocas y disfrutando del sol."
  },
  {
    "texto1": "Un dispositivo o material que se utiliza para cerrar o asegurar algo herméticamente, impidiendo la entrada o salida de aire, líquido, etc.",
    "texto2": "Sello / Junta / Cierre hermético",
    "texto3": "seal /siːl/",
    "texto4": "seals / will be a seal",
    "texto5": "Make sure the container has a tight seal to keep the food fresh for longer.",
    "texto6": "Asegúrate de que el recipiente tenga un cierre hermético para mantener la comida fresca por más tiempo."
  },
  {
    "texto1": "Un diseño o imagen estampado en cera, papel, etc., para autenticar un documento, o un troquel o sello con el que se hace esta marca.",
    "texto2": "Sello / Timbre / Emblema",
    "texto3": "seal /siːl/",
    "texto4": "seals / will be a seal",
    "texto5": "The letter had the king's official seal, which meant it was an important message.",
    "texto6": "La carta tenía el sello oficial del rey, lo que significaba que era un mensaje importante."
  },
  {
    "texto1": "Cerrar o asegurar algo herméticamente para evitar fugas o la entrada de elementos externos.",
    "texto2": "Sellar / Cerrar / Hermetizar",
    "texto3": "seal /siːl/",
    "texto4": "sealed / will seal",
    "texto5": "You need to seal the package properly before mailing it to its destination.",
    "texto6": "Necesitas sellar el paquete correctamente antes de enviarlo a su destino."
  },
  {
    "texto1": "Confirmar o finalizar un acuerdo o pacto.",
    "texto2": "Sellar / Ratificar / Confirmar",
    "texto3": "seal /siːl/",
    "texto4": "sealed / will seal",
    "texto5": "They shook hands to seal the deal and agree on the new terms.",
    "texto6": "Se dieron la mano para sellar el trato y acordar los nuevos términos."
  },
  {
    "texto1": "Que muestra una falta de experiencia, juicio o sofisticación, a menudo por inocencia o credulidad.",
    "texto2": "Ingenuo / Inocente / Crédulo",
    "texto3": "naive /naɪˈiːv/",
    "texto4": "naiver / will be naive",
    "texto5": "She was so naive she believed everything he told her without question.",
    "texto6": "Era tan ingenua que creyó todo lo que él le dijo sin cuestionar."
  },
  {
    "texto1": "Que es demasiado simple o poco realista en su concepción, a menudo debido a la falta de consideración de las complejidades del mundo real.",
    "texto2": "Simplista / Poco realista / Cándido",
    "texto3": "naive /naɪˈiːv/",
    "texto4": "naiver / will be naive",
    "texto5": "His plan for world peace was a bit naive, as it didn't account for human nature.",
    "texto6": "Su plan para la paz mundial era un poco ingenuo, ya que no tenía en cuenta la naturaleza humana."
  },
  {
    "texto1": "Referido al arte, un estilo que carece de formación académica formal, a menudo caracterizado por una simplicidad y espontaneidad.",
    "texto2": "Naíf / Primitivo / Informal",
    "texto3": "naive /naɪˈiːv/",
    "texto4": "naiver / will be naive",
    "texto5": "The painting had a charming, naive quality that made it feel authentic.",
    "texto6": "La pintura tenía una cualidad encantadora y naíf que la hacía sentir auténtica."
  },
  {
    "texto1": "El desarrollo inevitable y predestinado de los acontecimientos; el destino.",
    "texto2": "Destino / Hado / Suerte",
    "texto3": "fate /feɪt/",
    "texto4": "fates / will be a fate",
    "texto5": "It was fate that brought them together on that rainy day.",
    "texto6": "Fue el destino lo que los unió en ese día lluvioso."
  },
  {
    "texto1": "Un poder o agencia supuestamente responsable de predeterminar y ordenar los acontecimientos.",
    "texto2": "Sino / Fortuna / Providencia",
    "texto3": "fate /feɪt/",
    "texto4": "fates / will be a fate",
    "texto5": "She believed her fate was to become a great artist and share her work with the world.",
    "texto6": "Ella creía que su sino era convertirse en una gran artista y compartir su trabajo con el mundo."
  },
  {
    "texto1": "El resultado final o la consecuencia de algo o de la vida de una persona.",
    "texto2": "Desenlace / Fin / Condición final",
    "texto3": "fate /feɪt/",
    "texto4": "fates / will be a fate",
    "texto5": "The fate of the missing explorers remains unknown after all these years.",
    "texto6": "El desenlace de los exploradores desaparecidos sigue siendo desconocido después de todos estos años."
  },
  {
    "texto1": "Un proceso formal en un tribunal para determinar la culpabilidad o inocencia de una persona acusada de un delito.",
    "texto2": "Juicio / Proceso judicial / Visto",
    "texto3": "trial /ˈtraɪəl/",
    "texto4": "trials / will be a trial",
    "texto5": "The criminal trials can last for several weeks or even months.",
    "texto6": "Los juicios penales pueden durar varias semanas o incluso meses."
  },
  {
    "texto1": "Un experimento o prueba para evaluar la eficacia, calidad o seguridad de algo.",
    "texto2": "Ensayo / Prueba / Experimentación",
    "texto3": "trial /ˈtraɪəl/",
    "texto4": "trials / will be a trial",
    "texto5": "The new drug is currently undergoing clinical trials to ensure it is safe and effective.",
    "texto6": "El nuevo medicamento está actualmente en ensayos clínicos para asegurar que es seguro y efectivo."
  },
  {
    "texto1": "Dificultades o problemas que alguien enfrenta en la vida.",
    "texto2": "Penalidades / Tribulaciones / Adversidades",
    "texto3": "trial /ˈtraɪəl/",
    "texto4": "trials / will be a trial",
    "texto5": "She faced many trials and tribulations throughout her life, but she never gave up.",
    "texto6": "Ella enfrentó muchas penalidades y tribulaciones a lo largo de su vida, pero nunca se rindió."
  },
  {
    "texto1": "Una competición o serie de competiciones para probar habilidades o capacidades.",
    "texto2": "Pruebas / Eliminatorias / Competiciones",
    "texto3": "trial /ˈtraɪəl/",
    "texto4": "trials / will be a trial",
    "texto5": "The Olympic trials will determine who represents the country in the next games.",
    "texto6": "Las pruebas olímpicas determinarán quién representa al país en los próximos juegos."
  },
  {
    "texto1": "El fundamento o la razón principal de algo; la base sobre la que se construye o se apoya algo.",
    "texto2": "Base / Fundamento / Cimiento",
    "texto3": "basis /ˈbeɪ.sɪs/",
    "texto4": "bases / will be a basis",
    "texto5": "The theory forms the basis for his entire research project.",
    "texto6": "La teoría constituye la base de todo su proyecto de investigación."
  },
  {
    "texto1": "La forma o el modo en que se organiza o se hace algo.",
    "texto2": "Forma / Modo / Criterio",
    "texto3": "basis /ˈbeɪ.sɪs/",
    "texto4": "bases / will be a basis",
    "texto5": "They meet on a regular basis to discuss their progress with the project.",
    "texto6": "Se reúnen de forma regular para discutir su progreso con el proyecto."
  },
  {
    "texto1": "Un ingrediente principal o componente esencial de algo.",
    "texto2": "Componente / Ingrediente / Elemento principal",
    "texto3": "basis /ˈbeɪ.sɪs/",
    "texto4": "bases / will be a basis",
    "texto5": "This recipe uses tomatoes as its main basis for the sauce.",
    "texto6": "Esta receta usa tomates como su principal componente para la salsa."
  },
  {
    "texto1": "Pretérito y participio pasado de 'mean'. Tener la intención de hacer algo o tener un propósito particular.",
    "texto2": "Quiso decir / Tuvo la intención / Significó",
    "texto3": "meant /mɛnt/",
    "texto4": "meant / was meant",
    "texto5": "I meant to call you earlier, but I got busy with work.",
    "texto6": "Quise llamarte antes, pero me ocupé con el trabajo."
  },
  {
    "texto1": "Pretérito y participio pasado de 'mean'. Transmitir o expresar un significado o idea.",
    "texto2": "Significó / Quería decir / Representó",
    "texto3": "meant /mɛnt/",
    "texto4": "meant / was meant",
    "texto5": "What he said meant a lot to me, it was a very kind and thoughtful gesture.",
    "texto6": "Lo que dijo significó mucho para mí, fue un gesto muy amable y considerado."
  },
  {
    "texto1": "Pretérito y participio pasado de 'mean'. Estar destinado a ser o a ocurrir.",
    "texto2": "Estaba destinado / Debía ser / Corresponder",
    "texto3": "meant /mɛnt/",
    "texto4": "meant / was meant",
    "texto5": "They were meant to be together from the very beginning.",
    "texto6": "Estaban destinados a estar juntos desde el principio."
  },
  {
    "texto1": "Preocupación, ansiedad o inquietud sobre algo.",
    "texto2": "Preocupación / Inquietud / Ansiedad",
    "texto3": "concern /kənˈsɜːrn/",
    "texto4": "concerns / will be a concern",
    "texto5": "There is growing concern about climate change and its impact on the planet.",
    "texto6": "Existe una creciente preocupación por el cambio climático y su impacto en el planeta."
  },
  {
    "texto1": "Un asunto que afecta o es de interés para alguien o algo.",
    "texto2": "Asunto / Interés / Incumbencia",
    "texto3": "concern /kənˈsɜːrn/",
    "texto4": "concerns / will be a concern",
    "texto5": "That's no concern of yours, so please stay out of it.",
    "texto6": "Eso no es asunto tuyo, así que por favor no te metas."
  },
  {
    "texto1": "Afectar, involucrar o ser relevante para alguien o algo.",
    "texto2": "Afectar / Atener / Incumbir",
    "texto3": "concern /kənˈsɜːrn/",
    "texto4": "concerned / will concern",
    "texto5": "The new regulations primarily concern environmental protection and sustainability.",
    "texto6": "Las nuevas regulaciones conciernen principalmente a la protección del medio ambiente y la sostenibilidad."
  },
  {
    "texto1": "Causar preocupación o ansiedad a alguien.",
    "texto2": "Preocupar / Inquietar / Afligir",
    "texto3": "concern /kənˈsɜːrn/",
    "texto4": "concerned / will concern",
    "texto5": "His poor health greatly concerns his family, who want him to get better.",
    "texto6": "Su mala salud preocupa mucho a su familia, que quiere que se mejore."
  },
  {
    "texto1": "El uso de la fuerza física o mental para lograr algo; un intento arduo o laborioso.",
    "texto2": "Esfuerzo / Empeño / Dédicacion",
    "texto3": "effort /ˈɛfərt/",
    "texto4": "efforts / will be an effort",
    "texto5": "Learning a new language requires a lot of effort, but it's very rewarding.",
    "texto6": "Aprender un nuevo idioma requiere mucho esfuerzo, pero es muy gratificante."
  },
  {
    "texto1": "Un resultado del trabajo o la acción; un logro.",
    "texto2": "Logro / Resultado / Obra",
    "texto3": "effort /ˈɛfərt/",
    "texto4": "efforts / will be an effort",
    "texto5": "The charity gala was a great effort and raised a lot of money for a good cause.",
    "texto6": "La gala benéfica fue un gran esfuerzo y recaudó mucho dinero para una buena causa."
  },
  {
    "texto1": "Un intento serio o determinado de hacer algo.",
    "texto2": "Intento / Tentativa / Prueba",
    "texto3": "effort /ˈɛfərt/",
    "texto4": "efforts / will be an effort",
    "texto5": "He made an effort to be more punctual and arrived on time for all his meetings.",
    "texto6": "Hizo un esfuerzo por ser más puntual y llegó a tiempo a todas sus reuniones."
  },
  {
    "texto1": "Una medida, cantidad o frecuencia de algo en relación con otra cantidad o período de tiempo.",
    "texto2": "Tasa / Índice / Proporción",
    "texto3": "rate /reɪt/",
    "texto4": "rates / will be a rate",
    "texto5": "The birth rate in the country has decreased significantly in the last decade.",
    "texto6": "La tasa de natalidad en el país ha disminuido significativamente en la última década."
  },
  {
    "texto1": "El costo o cargo por un servicio o producto, a menudo expresado por unidad.",
    "texto2": "Tarifa / Precio / Cuota",
    "texto3": "rate /reɪt/",
    "texto4": "rates / will be a rate",
    "texto5": "What's the hourly rate for this service? I need to know the total cost.",
    "texto6": "¿Cuál es la tarifa por hora de este servicio? Necesito saber el costo total."
  },
  {
    "texto1": "Asignar un valor, clasificación o evaluación a algo o alguien.",
    "texto2": "Clasificar / Evaluar / Calificar",
    "texto3": "rate /reɪt/",
    "texto4": "rated / will rate",
    "texto5": "How would you rate this movie out of five stars? I'm curious to know your opinion.",
    "texto6": "¿Cómo calificarías esta película de cinco estrellas? Tengo curiosidad por saber tu opinión."
  },
  {
    "texto1": "Considerar algo o a alguien de una manera particular.",
    "texto2": "Considerar / Estimar / Valorar",
    "texto3": "rate /reɪt/",
    "texto4": "rated / will rate",
    "texto5": "I would rate him as one of the best players on the team, he has a lot of talent.",
    "texto6": "Lo consideraría uno de los mejores jugadores del equipo, tiene mucho talento."
  },
  {
    "texto1": "Permitir que algo o alguien salga o se libere de un lugar, control o confinamiento.",
    "texto2": "Soltar / Liberar / Dejar ir",
    "texto3": "release /rɪˈliːs/",
    "texto4": "released / will release",
    "texto5": "The police decided to release the suspect due to lack of evidence in the case.",
    "texto6": "La policía decidió soltar al sospechoso por falta de pruebas en el caso."
  },
  {
    "texto1": "Hacer que un producto, una película, un disco, etc., esté disponible para el público.",
    "texto2": "Lanzar / Estrenar / Publicar",
    "texto3": "release /rɪˈliːs/",
    "texto4": "released / will release",
    "texto5": "The band will release their new album next month and their fans are very excited.",
    "texto6": "La banda lanzará su nuevo álbum el próximo mes y sus fans están muy emocionados."
  },
  {
    "texto1": "El acto de liberar o dejar salir a alguien o algo.",
    "texto2": "Liberación / Descarga / Soltura",
    "texto3": "release /rɪˈliːs/",
    "texto4": "releases / will be a release",
    "texto5": "The prisoner's release was celebrated by his family, who had been waiting for years.",
    "texto6": "La liberación del prisionero fue celebrada por su familia, que había estado esperando durante años."
  },
  {
    "texto1": "Un producto, como una película, un álbum de música o un software, que se ha hecho público.",
    "texto2": "Lanzamiento / Estreno / Publicación",
    "texto3": "release /rɪˈliːs/",
    "texto4": "releases / will be a release",
    "texto5": "The new movie is a major release for the studio, they expect it to be a huge hit.",
    "texto6": "La nueva película es un gran lanzamiento para el estudio, esperan que sea un gran éxito."
  },
  {
    "texto1": "Una autorización formal para hacer algo público o disponible.",
    "texto2": "Autorización / Permiso / Licencia",
    "texto3": "release /rɪˈliːs/",
    "texto4": "releases / will be a release",
    "texto5": "They signed a press release to announce the event and provide all the details.",
    "texto6": "Firmaron un comunicado de prensa para anunciar el evento y proporcionar todos los detalles."
  },
  {
    "texto1": "Golpear algo o a alguien con fuerza.",
    "texto2": "Golpear / Pegar / Azotar",
    "texto3": "strike /straɪk/",
    "texto4": "struck / will strike",
    "texto5": "The clock began to strike twelve, signaling the start of a new day.",
    "texto6": "El reloj empezó a dar las doce, marcando el inicio de un nuevo día."
  },
  {
    "texto1": "Un paro de trabajo organizado por un grupo de empleados para protestar por las condiciones laborales o exigir mejores salarios.",
    "texto2": "Huelga / Paro / Cese de actividades",
    "texto3": "strike /straɪk/",
    "texto4": "strikes / will be a strike",
    "texto5": "The workers decided to go on strike for better pay and safer working conditions.",
    "texto6": "Los trabajadores decidieron ir a la huelga por un mejor sueldo y condiciones laborales más seguras."
  },
  {
    "texto1": "Ocurrir a alguien repentinamente, como una idea o una enfermedad.",
    "texto2": "Sobrevenir / Afligir / Acometer",
    "texto3": "strike /straɪk/",
    "texto4": "struck / will strike",
    "texto5": "A sudden illness struck him down and he had to be hospitalized.",
    "texto6": "Una enfermedad repentina lo abatió y tuvo que ser hospitalizado."
  },
  {
    "texto1": "Causar una impresión particular en la mente de alguien.",
    "texto2": "Impresionar / Llamar la atención / Sorprender",
    "texto3": "strike /straɪk/",
    "texto4": "struck / will strike",
    "texto5": "His honesty struck me as unusual, as most people aren't so direct.",
    "texto6": "Su honestidad me pareció inusual, ya que la mayoría de la gente no es tan directa."
  },
  {
    "texto1": "En béisbol, una pelota lanzada que pasa por la zona de strike y no es bateada, o una pelota que es bateada fuera de juego o fallada.",
    "texto2": "Strike / Bola mala / Ponche",
    "texto3": "strike /straɪk/",
    "texto4": "strikes / will be a strike",
    "texto5": "The batter got two strikes before hitting the ball and getting a home run.",
    "texto6": "El bateador tuvo dos strikes antes de golpear la pelota y conseguir un jonrón."
  },
  {
    "texto1": "Un descubrimiento repentino e importante de petróleo, gas o minerales.",
    "texto2": "Hallazgo / Descubrimiento / Yacimiento",
    "texto3": "strike /straɪk/",
    "texto4": "strikes / will be a strike",
    "texto5": "The company announced a major oil strike in the North Sea, which will bring them a lot of profit.",
    "texto6": "La empresa anunció un importante hallazgo de petróleo en el Mar del Norte, lo que les traerá muchas ganancias."
  },
  {
    "texto1": "Desmoronarse o romperse en pedazos pequeños, especialmente algo seco y quebradizo.",
    "texto2": "Desmoronarse / Deshacerse / Fragmentarse",
    "texto3": "crumble /ˈkrʌm.bəl/",
    "texto4": "crumbled / will crumble",
    "texto5": "The old wall began to crumble with age and neglect.",
    "texto6": "La vieja pared comenzó a desmoronarse con la edad y el abandono."
  },
  {
    "texto1": "Colapsar, desintegrarse o fallar gradualmente.",
    "texto2": "Colapsar / Deteriorarse / Venirse abajo",
    "texto3": "crumble /ˈkrʌm.bəl/",
    "texto4": "crumbled / will crumble",
    "texto5": "The empire began to crumble from within due to political conflicts.",
    "texto6": "El imperio empezó a colapsar desde dentro debido a conflictos políticos."
  },
  {
    "texto1": "Un postre de frutas horneado con una cobertura desmenuzada hecha de harina, mantequilla y azúcar.",
    "texto2": "Crumble / Pastel desmenuzado / Postre de frutas",
    "texto3": "crumble /ˈkrʌm.bəl/",
    "texto4": "crumbles / will be a crumble",
    "texto5": "My grandmother makes the best apple crumble, it's my favorite dessert.",
    "texto6": "Mi abuela hace el mejor crumble de manzana, es mi postre favorito."
  },
  {
    "texto1": "Manipular, tocar o gestionar algo con las manos.",
    "texto2": "Manejar / Tocar / Manipular",
    "texto3": "handle /ˈhæn.dəl/",
    "texto4": "handled / will handle",
    "texto5": "Please handle the delicate items with care so they don't break.",
    "texto6": "Por favor, manipule los artículos delicados con cuidado para que no se rompan."
  },
  {
    "texto1": "Gestionar, controlar o resolver una situación, un problema o a una persona.",
    "texto2": "Gestionar / Ocuparse de / Resolver",
    "texto3": "handle /ˈhæn.dəl/",
    "texto4": "handled / will handle",
    "texto5": "She's good at handling difficult customers and resolving their complaints.",
    "texto6": "Ella es buena gestionando clientes difíciles y resolviendo sus quejas."
  },
  {
    "texto1": "La parte de un objeto que está diseñada para ser agarrada o sostenida.",
    "texto2": "Mango / Asa / Manija",
    "texto3": "handle /ˈhæn.dəl/",
    "texto4": "handles / will be a handle",
    "texto5": "The cup has a comfortable handle, making it easy to hold.",
    "texto6": "La taza tiene un mango cómodo, lo que la hace fácil de sostener."
  },
  {
    "texto1": "Un nombre o apodo, especialmente uno utilizado en un sistema de comunicación o en línea.",
    "texto2": "Nombre de usuario / Nick / Alias",
    "texto3": "handle /ˈhæn.dəl/",
    "texto4": "handles / will be a handle",
    "texto5": "What's your Twitter handle? I'd like to follow you.",
    "texto6": "¿Cuál es tu nombre de usuario de Twitter? Me gustaría seguirte."
  },
  {
    "texto1": "Comerciar o traficar con bienes específicos, a menudo de forma ilegal.",
    "texto2": "Comerciar / Traficar / Vender",
    "texto3": "handle /ˈhæn.dəl/",
    "texto4": "handled / will handle",
    "texto5": "They were accused of handling stolen goods and were arrested by the police.",
    "texto6": "Fueron acusados de traficar con bienes robados y fueron arrestados por la policía."
  },
  {
    "texto1": "Cubrir o envolver algo con un material flexible.",
    "texto2": "Envolver / Envolver / Cubrir",
    "texto3": "wrap /ræp/",
    "texto4": "wrapped / will wrap",
    "texto5": "Please wrap the gift in colorful paper so it looks festive.",
    "texto6": "Por favor, envuelve el regalo en papel de colores para que se vea festivo."
  },
  {
    "texto1": "Un material flexible utilizado para envolver o cubrir algo.",
    "texto2": "Envoltura / Envoltorio / Cubierta",
    "texto3": "wrap /ræp/",
    "texto4": "wraps / will be a wrap",
    "texto5": "The plastic wrap keeps the food fresh by sealing it tightly.",
    "texto6": "El envoltorio de plástico mantiene la comida fresca al sellarla herméticamente."
  },
  {
    "texto1": "Terminar o completar una actividad, un proyecto o un evento.",
    "texto2": "Finalizar / Concluir / Terminar",
    "texto3": "wrap up /ræp ʌp/",
    "texto4": "wrapped up / will wrap up",
    "texto5": "We need to wrap up the meeting soon, as it's getting late.",
    "texto6": "Necesitamos terminar la reunión pronto, ya que se está haciendo tarde."
  },
  {
    "texto1": "Rodear o abrazar con los brazos o con algo flexible.",
    "texto2": "Rodear / Abrazar / Ceñir",
    "texto3": "wrap /ræp/",
    "texto4": "wrapped / will wrap",
    "texto5": "She wrapped her arms around her child to give him a warm hug.",
    "texto6": "Ella rodeó a su hijo con los brazos para darle un cálido abrazo."
  }
]
