[
  {
    "texto1": "Algo o alguien que es socialmente torpe, poco a la moda o un poco tonto, a menudo de una manera entrañable.",
    "texto2": "Bobo / Tonto / Patoso / Torpe / Nerdo",
    "texto3": "dorky",
    "texto4": "dorkier / dorkiest (comparative/superlative for describing things or people as more/most dorky); will be dorky (future)",
    "texto5": "He wore a dorky hat to the party, but he still looked cute.",
    "texto6": "Llevaba un sombrero bobo a la fiesta, pero aun así se veía lindo."
  },
  {
    "texto1": "Mantenerse firme, equilibrado y sin cambios en su posición o estado.",
    "texto2": "Firme / Estable / Constante / Equilibrado",
    "texto3": "steady",
    "texto4": "steadied / will steady",
    "texto5": "Hold the camera steady to get a clear shot.",
    "texto6": "Sostén la cámara firme para obtener una toma clara."
  },
  {
    "texto1": "Algo que no cambia de intensidad, velocidad o cantidad; uniforme.",
    "texto2": "Constante / Regular / Uniforme / Continuo",
    "texto3": "steady",
    "texto4": "steadied / will steady",
    "texto5": "The car maintained a steady speed on the highway.",
    "texto6": "El coche mantuvo una velocidad constante en la autopista."
  },
  {
    "texto1": "Una persona que es confiable, responsable y sensata.",
    "texto2": "Serio / Formal / Responsable / Confiable",
    "texto3": "steady",
    "texto4": "steadied / will steady",
    "texto5": "He's a steady worker, always gets the job done.",
    "texto6": "Es un trabajador serio, siempre termina el trabajo."
  },
  {
    "texto1": "Una dirección general en la que algo se está desarrollando o cambiando; una forma de comportarse, proceder, etc., que se está volviendo más común o popular.",
    "texto2": "Tendencia / Dirección / Movimiento / Inclinación",
    "texto3": "trend",
    "texto4": "trended / will trend",
    "texto5": "The latest trend in technology is artificial intelligence.",
    "texto6": "La última tendencia en tecnología es la inteligencia artificial."
  },
  {
    "texto1": "Algo que es actualmente popular o de moda, especialmente en la industria de la moda, el entretenimiento o el comportamiento social.",
    "texto2": "Moda / Voga / Estilo / Corriente",
    "texto3": "trend",
    "texto4": "trended / will trend",
    "texto5": "Bright colors are a big trend this season.",
    "texto6": "Los colores brillantes son una gran tendencia esta temporada."
  },
  {
    "texto1": "En redes sociales o plataformas de noticias, un tema, palabra o nombre que está siendo mencionado con mayor frecuencia en un momento particular.",
    "texto2": "Tendencia / Trending topic",
    "texto3": "trend",
    "texto4": "trended / will trend",
    "texto5": "The hashtag started to trend on Twitter after the announcement.",
    "texto6": "El hashtag empezó a ser tendencia en Twitter después del anuncio."
  },
  {
    "texto1": "Una comprensión profunda y clara de una situación o problema complejo.",
    "texto2": "Conocimiento / Comprensión / Perspicacia / Revelación",
    "texto3": "insight",
    "texto4": "insights (plural) / gained insight (past) / will gain insight (future)",
    "texto5": "The report provided valuable insights into consumer behavior.",
    "texto6": "El informe proporcionó conocimientos valiosos sobre el comportamiento del consumidor."
  },
  {
    "texto1": "La capacidad de obtener una comprensión precisa e intuitiva de una persona o cosa.",
    "texto2": "Clarividencia / Intuición / Percepción / Agudeza",
    "texto3": "insight",
    "texto4": "insights (plural) / gained insight (past) / will gain insight (future)",
    "texto5": "Her unique insight allowed her to solve the difficult problem quickly.",
    "texto6": "Su percepción única le permitió resolver el problema difícil rápidamente."
  },
  {
    "texto1": "Un pequeño fragmento, pieza o parte de algo, especialmente de información o código.",
    "texto2": "Fragmento / Pedazo / Trozo / Retazo",
    "texto3": "snippet",
    "texto4": "snippets (plural)",
    "texto5": "Could you send me a small snippet of the code?",
    "texto6": "Me podrías enviar un pequeño fragmento del código?"
  },
  {
    "texto1": "Una breve porción de una conversación, una canción, un video u otra forma de contenido.",
    "texto2": "Extracto / Recorte / Muestra / Clip",
    "texto3": "snippet",
    "texto4": "snippets (plural)",
    "texto5": "I heard a snippet of their new song on the radio.",
    "texto6": "Escuché un extracto de su nueva canción en la radio."
  },
  {
    "texto1": "Juntar o recolectar cosas o personas de diferentes lugares.",
    "texto2": "Reunir / Recoger / Acumular / Agrupar",
    "texto3": "gather",
    "texto4": "gathered / will gather",
    "texto5": "We need to gather all the documents for the meeting.",
    "texto6": "Necesitamos reunir todos los documentos para la reunión."
  },
  {
    "texto1": "Formar una opinión o conclusión a partir de la información disponible.",
    "texto2": "Deducir / Concluir / Inferir / Comprender",
    "texto3": "gather",
    "texto4": "gathered / will gather",
    "texto5": "From what he said, I gather he's not happy with the decision.",
    "texto6": "Por lo que dijo, deduzco que no está contento con la decisión."
  },
  {
    "texto1": "Acercarse o juntarse en un grupo.",
    "texto2": "Juntarse / Congregar / Agruparse / Reunirse",
    "texto3": "gather",
    "texto4": "gathered / will gather",
    "texto5": "The crowd began to gather outside the stadium.",
    "texto6": "La multitud comenzó a juntarse afuera del estadio."
  },
  {
    "texto1": "Ocupar o atraer la atención, el interés o las emociones de alguien.",
    "texto2": "Atraer / Cautivar / Fascinar / Interesar",
    "texto3": "engage",
    "texto4": "engaged / will engage",
    "texto5": "The speaker's story really engaged the audience.",
    "texto6": "La historia del orador realmente atrajo a la audiencia."
  },
  {
    "texto1": "Participar o involucrarse en una actividad, conversación o proceso.",
    "texto2": "Participar / Involucrarse / Comprometerse / Entablar",
    "texto3": "engage",
    "texto4": "engaged / will engage",
    "texto5": "It's important to engage in regular physical activity.",
    "texto6": "Es importante participar en actividad física regular."
  },
  {
    "texto1": "Hacer que algo (como un mecanismo o sistema) encaje o se conecte para funcionar.",
    "texto2": "Acoplar / Conectar / Engranar / Poner en marcha",
    "texto3": "engage",
    "texto4": "engaged / will engage",
    "texto5": "Make sure the gears engage properly before starting the machine.",
    "texto6": "Asegúrate de que los engranajes se acoplen correctamente antes de encender la máquina."
  },
  {
    "texto1": "Comenzar una batalla o enfrentamiento con un oponente.",
    "texto2": "Enfrentar / Entrar en combate / Luchar contra",
    "texto3": "engage",
    "texto4": "engaged / will engage",
    "texto5": "The troops were ordered to engage the enemy.",
    "texto6": "Las tropas recibieron la orden de enfrentar al enemigo."
  },
  {
    "texto1": "Convertir información o datos a un formato diferente, especialmente para su transmisión, almacenamiento o procesamiento por un sistema informático o electrónico.",
    "texto2": "Codificar / Cifrar / Encriptar / Transcribir",
    "texto3": "encode",
    "texto4": "encoded / will encode",
    "texto5": "The software will encode the video file into a smaller format.",
    "texto6": "El software codificará el archivo de video a un formato más pequeño."
  },
  {
    "texto1": "Convertir un mensaje o señal en un código o lenguaje secreto para ocultar su significado.",
    "texto2": "Cifrar / Encriptar / Codificar (en secreto)",
    "texto3": "encode",
    "texto4": "encoded / will encode",
    "texto5": "The spies encoded their messages to prevent them from being intercepted.",
    "texto6": "Los espías cifraron sus mensajes para evitar que fueran interceptados."
  },
  {
    "texto1": "Formar una memoria en el cerebro; convertir información sensorial en una forma que pueda ser almacenada y recuperada.",
    "texto2": "Grabar (en la memoria) / Fijar / Registrar",
    "texto3": "encode",
    "texto4": "encoded / will encode",
    "texto5": "Our brains encode new experiences into long-term memories.",
    "texto6": "Nuestros cerebros graban nuevas experiencias en memorias a largo plazo."
  },
  {
    "texto1": "Un conjunto de equipos o indumentaria que se usa para un propósito particular.",
    "texto2": "Equipo / Indumentaria / Atuendo / Material",
    "texto3": "gear",
    "texto4": "geared (as in 'geared up' - to prepare with gear); will gear (as in 'will gear up')",
    "texto5": "Don't forget to pack your hiking gear for the trip.",
    "texto6": "No olvides empacar tu equipo de senderismo para el viaje."
  },
  {
    "texto1": "Un mecanismo con dientes, como una rueda o cilindro, que engrana con otro para transmitir o cambiar el movimiento o la potencia.",
    "texto2": "Engranaje / Piñón / Rueda dentada",
    "texto3": "gear",
    "texto4": "geared (as in 'geared to' - designed or adjusted for a particular purpose); will gear",
    "texto5": "The car's transmission uses several gears to change speed.",
    "texto6": "La transmisión del coche usa varios engranajes para cambiar la velocidad."
  },
  {
    "texto1": "La ropa o atuendo que se usa para protegerse o para realizar una actividad específica.",
    "texto2": "Ropa / Vestimenta / Equipo de protección",
    "texto3": "gear",
    "texto4": "geared (as in 'geared up' for an event); will gear (as in 'will gear up' for something)",
    "texto5": "The firefighters put on their protective gear before entering the building.",
    "texto6": "Los bomberos se pusieron su equipo de protección antes de entrar al edificio."
  },
  {
    "texto1": "Declarar o afirmar que algo es verdadero o que uno tiene derecho a algo.",
    "texto2": "Afirmar / Declarar / Sostener / Reclamar / Alegar",
    "texto3": "claim",
    "texto4": "claimed / will claim",
    "texto5": "She claims to be the rightful owner of the property.",
    "texto6": "Ella afirma ser la legítima dueña de la propiedad."
  },
  {
    "texto1": "Pedir oficialmente una cantidad de dinero a una organización porque se tiene derecho a ella.",
    "texto2": "Reclamar / Solicitar / Demandar / Pedir una indemnización",
    "texto3": "claim",
    "texto4": "claimed / will claim",
    "texto5": "You can claim expenses for your business trip.",
    "texto6": "Puedes reclamar los gastos de tu viaje de negocios."
  },
  {
    "texto1": "Un derecho legal a algo; una demanda o petición formal de algo.",
    "texto2": "Reclamo / Demanda / Derecho / Petición",
    "texto3": "claim",
    "texto4": "claims (plural)",
    "texto5": "The insurance company denied his claim for damages.",
    "texto6": "La compañía de seguros denegó su reclamo por daños."
  },
  {
    "texto1": "Una afirmación que se hace sin prueba, que puede ser discutible o no.",
    "texto2": "Aserción / Afirmación / Alegación / Proposición",
    "texto3": "claim",
    "texto4": "claims (plural)",
    "texto5": "His claim that he never received the letter was false.",
    "texto6": "Su afirmación de que nunca recibió la carta era falsa."
  },
  {
    "texto1": "Pasar la lengua por algo o sobre algo.",
    "texto2": "Lamer / Relamer / Chupar",
    "texto3": "lick",
    "texto4": "licked / will lick",
    "texto5": "The dog licked the ice cream cone.",
    "texto6": "El perro lamió el cono de helado."
  },
  {
    "texto1": "Tocar o moverse sobre una superficie suavemente y por un breve tiempo.",
    "texto2": "Rozar / Tocar / Besar",
    "texto3": "lick",
    "texto4": "licked / will lick",
    "texto5": "Flames began to lick the dry wood.",
    "texto6": "Las llamas comenzaron a rozar la madera seca."
  },
  {
    "texto1": "Derrotar o vencer a alguien con facilidad.",
    "texto2": "Vencer / Derrotar / Ganar (fácilmente)",
    "texto3": "lick",
    "texto4": "licked / will lick",
    "texto5": "Our team licked the competition in the final game.",
    "texto6": "Nuestro equipo venció fácilmente a la competencia en el juego final."
  },
  {
    "texto1": "El punto más alto de una montaña o colina.",
    "texto2": "Cima / Pico / Cúspide / Cumbre",
    "texto3": "peak",
    "texto4": "peaked / will peak",
    "texto5": "They reached the peak of the mountain after a long climb.",
    "texto6": "Alcanzaron la cima de la montaña después de una larga subida."
  },
  {
    "texto1": "El punto más alto de actividad, rendimiento o intensidad.",
    "texto2": "Punto máximo / Auge / Apogeo / Cénit",
    "texto3": "peak",
    "texto4": "peaked / will peak",
    "texto5": "The singer's career reached its peak in the 1990s.",
    "texto6": "La carrera del cantante alcanzó su punto máximo en los años 90."
  },
  {
    "texto1": "Alcanzar el punto más alto de algo, como una actividad, un rendimiento o una intensidad.",
    "texto2": "Alcanzar el máximo / Llegar al punto álgido / Tocar techo",
    "texto3": "peak",
    "texto4": "peaked / will peak",
    "texto5": "Traffic usually peaks between 5 and 6 PM.",
    "texto6": "El tráfico suele alcanzar su máximo entre las 5 y las 6 de la tarde."
  },
  {
    "texto1": "Una ventaja o beneficio adicional que se recibe por un trabajo o posición.",
    "texto2": "Beneficio / Ventaja / Prebenda / Gaje",
    "texto3": "perk",
    "texto4": "perks (plural)",
    "texto5": "Free coffee and snacks are a nice perk of the job.",
    "texto6": "Café y aperitivos gratis son un buen beneficio del trabajo."
  },
  {
    "texto1": "La acción de animarse o levantar la cabeza rápidamente, a menudo con interés o curiosidad.",
    "texto2": "Levantar / Animar / Espabilarse / Avivar",
    "texto3": "perk",
    "texto4": "perked / will perk",
    "texto5": "The dog's ears perked up when it heard a noise.",
    "texto6": "Las orejas del perro se levantaron cuando escuchó un ruido."
  },
  {
    "texto1": "Revitalizar o mejorar el ánimo de alguien; hacer que alguien se sienta más animado o enérgico.",
    "texto2": "Animar / Reavivar / Vigorizar / Tonificar",
    "texto3": "perk",
    "texto4": "perked / will perk",
    "texto5": "A strong cup of coffee can really perk you up in the morning.",
    "texto6": "Una taza de café fuerte realmente te puede animar por la mañana."
  },
  {
    "texto1": "Sentirse seguro de uno mismo o de sus habilidades; creer firmemente en algo.",
    "texto2": "Seguro / Confiado / Firme / Persuadido",
    "texto3": "confident",
    "texto4": "more confident / most confident (comparative/superlative); felt confident (past); will be confident (future)",
    "texto5": "She felt confident about her presentation after rehearsing it multiple times.",
    "texto6": "Se sentía segura de su presentación después de ensayarla varias veces."
  },
  {
    "texto1": "Estar seguro de que algo sucederá o es verdad.",
    "texto2": "Seguro / Convencido / Certero / Con la certeza",
    "texto3": "confident",
    "texto4": "more confident / most confident (comparative/superlative); felt confident (past); will be confident (future)",
    "texto5": "I am confident that we will find a solution to this problem.",
    "texto6": "Estoy seguro de que encontraremos una solución a este problema."
  },
  {
    "texto1": "Una respuesta a una pregunta, problema o solicitud.",
    "texto2": "Respuesta / Solución / Contestación / Réplica",
    "texto3": "answer",
    "texto4": "answered / will answer",
    "texto5": "Please write your answer on a separate sheet of paper.",
    "texto6": "Por favor, escribe tu respuesta en una hoja de papel aparte."
  },
  {
    "texto1": "Responder a una pregunta, resolver un problema o cumplir con una solicitud.",
    "texto2": "Responder / Contestar / Solucionar / Resolver",
    "texto3": "answer",
    "texto4": "answered / will answer",
    "texto5": "I will answer your question after the presentation.",
    "texto6": "Responderé a tu pregunta después de la presentación."
  },
  {
    "texto1": "El resultado o la solución de un problema matemático o un enigma.",
    "texto2": "Resultado / Solución / Clave / Desenlace",
    "texto3": "answer",
    "texto4": "answered / will answer",
    "texto5": "The correct answer to the riddle was 'a secret'.",
    "texto6": "La respuesta correcta al acertijo era 'un secreto'."
  },
  {
    "texto1": "Llevar a cabo, ejecutar o realizar una acción, tarea o función.",
    "texto2": "Realizar / Ejecutar / Llevar a cabo / Cumplir",
    "texto3": "perform",
    "texto4": "performed / will perform",
    "texto5": "The surgeon will perform a complex operation tomorrow.",
    "texto6": "El cirujano realizará una operación compleja mañana."
  },
  {
    "texto1": "Actuar, cantar, bailar u ofrecer un espectáculo para el entretenimiento de una audiencia.",
    "texto2": "Actuar / Representar / Presentar / Entretener",
    "texto3": "perform",
    "texto4": "performed / will perform",
    "texto5": "The band will perform live at the festival next month.",
    "texto6": "La banda actuará en vivo en el festival el próximo mes."
  },
  {
    "texto1": "Funcionar o comportarse de una manera específica o con una cierta eficiencia.",
    "texto2": "Funcionar / Rendir / Trabajar / Desempeñarse",
    "texto3": "perform",
    "texto4": "performed / will perform",
    "texto5": "The new engine performs much better than the old one.",
    "texto6": "El nuevo motor funciona mucho mejor que el anterior."
  },
  {
    "texto1": "El proceso de convertir información en un código para evitar el acceso no autorizado, especialmente durante la transmisión o el almacenamiento.",
    "texto2": "Cifrado / Codificación / Encriptación",
    "texto3": "encryption",
    "texto4": "encrypted (past tense of the verb 'to encrypt') / will encrypt (future tense of the verb 'to encrypt')",
    "texto5": "Strong encryption is essential for protecting sensitive data online.",
    "texto6": "Un cifrado fuerte es esencial para proteger los datos sensibles en línea."
  },
  {
    "texto1": "La técnica de transformar datos de su forma original legible (texto plano) a una forma ilegible (texto cifrado) utilizando un algoritmo y una clave, de modo que solo las partes autorizadas puedan descifrarla.",
    "texto2": "Cifrado de datos / Criptografía / Encriptación de información",
    "texto3": "encryption",
    "texto4": "encrypted (past tense of the verb 'to encrypt') / will encrypt (future tense of the verb 'to encrypt')",
    "texto5": "End-to-end encryption ensures that only the sender and intended recipient can read the messages.",
    "texto6": "El cifrado de extremo a extremo asegura que solo el remitente y el destinatario previsto puedan leer los mensajes."
  },
  {
    "texto1": "Un propósito o papel natural para el que una persona o cosa está diseñada o empleada.",
    "texto2": "Función / Propósito / Rol / cometido",
    "texto3": "function",
    "texto4": "functioned / will function",
    "texto5": "The main function of the heart is to pump blood.",
    "texto6": "La función principal del corazón es bombear sangre."
  },
  {
    "texto1": "Una actividad o propósito para el cual algo existe o es utilizado.",
    "texto2": "Actividad / Operación / Tarea / Uso",
    "texto3": "function",
    "texto4": "functioned / will function",
    "texto5": "The new machine performs its function perfectly.",
    "texto6": "La nueva máquina realiza su función perfectamente."
  },
  {
    "texto1": "En informática, un bloque de código diseñado para realizar una tarea específica y que puede ser llamado y reutilizado dentro de un programa.",
    "texto2": "Función / Subrutina / Procedimiento",
    "texto3": "function",
    "texto4": "functioned / will function",
    "texto5": "This function calculates the total sum of the numbers in the list.",
    "texto6": "Esta función calcula la suma total de los números en la lista."
  },
  {
    "texto1": "Trabajar o funcionar de una manera particular.",
    "texto2": "Funcionar / Operar / Servir",
    "texto3": "function",
    "texto4": "functioned / will function",
    "texto5": "The old car still functions well despite its age.",
    "texto6": "El coche viejo todavía funciona bien a pesar de su edad."
  }
]
